class CWorldCompositionChunkReferenceElement_t // server
{
	CUtlString m_strMapToLoad; // 0x0000
	CUtlString m_strLandmarkName; // 0x0008
};
class C_INIT_PositionWarpScalar : public CParticleFunctionInitializer // particles
{
	Vector m_vecWarpMin; // 0x01D8
	Vector m_vecWarpMax; // 0x01E4
	CPerParticleFloatInput m_InputValue; // 0x01F0
	float32 m_flPrevPosScale; // 0x0360
	int32 m_nScaleControlPointNumber; // 0x0364
	int32 m_nControlPointNumber; // 0x0368
};
class C_OP_ForceControlPointStub : public CParticleFunctionPreEmission // particles
{
	int32 m_ControlPoint; // 0x01D8
};
class RenderProjectedMaterial_t // particles
{
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x0000
};
class AimMatrixOpFixedSettings_t // animgraphlib
{
	CAnimAttachment m_attachment; // 0x0000
	CAnimInputDamping m_damping; // 0x0080
	CPoseHandle[10] m_poseCacheHandles; // 0x0098
	AimMatrixBlendMode m_eBlendMode; // 0x00C0
	float32 m_flMaxYawAngle; // 0x00C4
	float32 m_flMaxPitchAngle; // 0x00C8
	int32 m_nSequenceMaxFrame; // 0x00CC
	int32 m_nBoneMaskIndex; // 0x00D0
	bool m_bTargetIsPosition; // 0x00D4
	bool m_bUseBiasAndClamp; // 0x00D5
	float32 m_flBiasAndClampYawOffset; // 0x00D8
	float32 m_flBiasAndClampPitchOffset; // 0x00DC
	CBlendCurve m_biasAndClampBlendCurve; // 0x00E0
};
class InfoForResourceTypeCVoxelVisibility // resourcesystem
{
};
class WrappedPhysicsJoint_t // server
{
};
class CTakeDamageResult // server
{
	CTakeDamageInfo* m_pOriginatingInfo; // 0x0000
	int32 m_nHealthLost; // 0x0008
	int32 m_nHealthBefore; // 0x000C
	int32 m_nDamageDealt; // 0x0010
	float32 m_flPreModifiedDamage; // 0x0014
	int32 m_nTotalledHealthLost; // 0x0018
	int32 m_nTotalledDamageDealt; // 0x001C
	float32 m_flTotalledPreModifiedDamage; // 0x0020
	bool m_bWasDamageSuppressed; // 0x0024
	bool m_bSuppressFlinch; // 0x0025
	HitGroup_t m_nOverrideFlinchHitGroup; // 0x0028
};
class C_OP_RenderMaterialProxy : public CParticleFunctionRenderer // particles
{
	int32 m_nMaterialControlPoint; // 0x0220
	MaterialProxyType_t m_nProxyType; // 0x0224
	CUtlVector< MaterialVariable_t > m_MaterialVars; // 0x0228
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hOverrideMaterial; // 0x0240
	CParticleCollectionFloatInput m_flMaterialOverrideEnabled; // 0x0248
	CParticleCollectionVecInput m_vecColorScale; // 0x03B8
	CPerParticleFloatInput m_flAlpha; // 0x0A70
	ParticleColorBlendType_t m_nColorBlendType; // 0x0BE0
};
class CNmFloatEaseNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	float32 m_flEaseTime; // 0x0010
	float32 m_flStartValue; // 0x0014
	int16 m_nInputValueNodeIdx; // 0x0018
	NmEasingOperation_t m_easingOp; // 0x001A
	bool m_bUseStartValue; // 0x001B
};
class CAimMatrixUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	AimMatrixOpFixedSettings_t m_opFixedSettings; // 0x0070
	AnimVectorSource m_target; // 0x0168
	CAnimParamHandle m_paramIndex; // 0x016C
	HSequence m_hSequence; // 0x0170
	bool m_bResetChild; // 0x0174
	bool m_bLockWhenWaning; // 0x0175
};
class CAnimFrameBlockAnim // animationsystem
{
	int32 m_nStartFrame; // 0x0000
	int32 m_nEndFrame; // 0x0004
	CUtlVector< int32 > m_segmentIndexArray; // 0x0008
};
class CSeqPoseSetting // animationsystem
{
	CBufferString m_sPoseParameter; // 0x0000
	CBufferString m_sAttachment; // 0x0010
	CBufferString m_sReferenceSequence; // 0x0020
	float32 m_flValue; // 0x0030
	bool m_bX; // 0x0034
	bool m_bY; // 0x0035
	bool m_bZ; // 0x0036
	int32 m_eType; // 0x0038
};
class CNmCachedFloatNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	NmCachedValueMode_t m_mode; // 0x0014
};
class CRagdollComponentUpdater : public CAnimComponentUpdater // animgraphlib
{
	CUtlVector< CAnimNodePath > m_ragdollNodePaths; // 0x0030
	CUtlVector< CAnimNodePath > m_followAttachmentNodePaths; // 0x0048
	CUtlVector< int32 > m_boneIndices; // 0x0060
	CUtlVector< CUtlString > m_boneNames; // 0x0078
	CUtlVector< WeightList > m_weightLists; // 0x0090
	CUtlVector< int32 > m_boneToWeightIndices; // 0x00A8
	float32 m_flSpringFrequencyMin; // 0x00C0
	float32 m_flSpringFrequencyMax; // 0x00C4
	float32 m_flMaxStretch; // 0x00C8
	bool m_bSolidCollisionAtZeroWeight; // 0x00CC
};
class CNmRootMotionEvent : public CNmEvent // animlib
{
	float32 m_flBlendTimeSeconds; // 0x0020
};
class CTwistConstraint : public CBaseConstraint // modellib
{
	bool m_bInverse; // 0x0060
	Quaternion m_qParentBindRotation; // 0x0070
	Quaternion m_qChildBindRotation; // 0x0080
};
class MotionBlendItem // animgraphlib
{
	CSmartPtr< CMotionNode > m_pChild; // 0x0000
	float32 m_flKeyValue; // 0x0008
};
class CAnimEventListenerBase // server
{
};
class C_OP_EndCapDecay : public CParticleFunctionOperator // particles
{
};
class VMixPresetDSPDesc_t // soundsystem_lowlevel
{
	CUtlString m_effectName; // 0x0000
};
class CTurnHelperUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	AnimValueSource m_facingTarget; // 0x0074
	float32 m_turnStartTimeOffset; // 0x0078
	float32 m_turnDuration; // 0x007C
	bool m_bMatchChildDuration; // 0x0080
	float32 m_manualTurnOffset; // 0x0084
	bool m_bUseManualTurnOffset; // 0x0088
};
class CNmParameterizedBlendNode::BlendRange_t // animlib
{
	int16 m_nInputIdx0; // 0x0000
	int16 m_nInputIdx1; // 0x0002
	Range_t m_parameterValueRange; // 0x0004
};
class CDecalInstance // server
{
	CGlobalSymbol m_sDecalGroup; // 0x0000
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x0008
	CUtlStringToken m_sSequenceName; // 0x0010
	CHandle< CBaseEntity > m_hEntity; // 0x0014
	int32 m_nBoneIndex; // 0x0018
	int32 m_nTriangleIndex; // 0x001C
	Vector m_vPositionLS; // 0x0020
	Vector m_vNormalLS; // 0x002C
	Vector m_vSAxisLS; // 0x0038
	DecalFlags_t m_nFlags; // 0x0044
	Color m_Color; // 0x0048
	float32 m_flWidth; // 0x004C
	float32 m_flHeight; // 0x0050
	float32 m_flDepth; // 0x0054
	CTransformWS m_transform; // 0x0060
	float32 m_flAnimationScale; // 0x0080
	float32 m_flAnimationStartTime; // 0x0084
	GameTime_t m_flPlaceTime; // 0x0088
	float32 m_flFadeStartTime; // 0x008C
	float32 m_flFadeDuration; // 0x0090
	float32 m_flLightingOriginOffset; // 0x0094
	float32 m_flBoundingRadiusSqr; // 0x00A0
	int16 m_nSequenceIndex; // 0x00A4
	bool m_bIsAdjacent; // 0x00A6
	bool m_bDoDecalLightmapping; // 0x00A7
	DecalRtEncoding_t m_nDecalRtEncoding; // 0x00A8
	bool m_bProjectToBackfaces; // 0x00A9
};
class CBaseAnimGraphDestructibleParts_GraphController : public CAnimGraphControllerBase // server
{
};
class C_INIT_RandomColor : public CParticleFunctionInitializer // particles
{
	Color m_ColorMin; // 0x01F4
	Color m_ColorMax; // 0x01F8
	Color m_TintMin; // 0x01FC
	Color m_TintMax; // 0x0200
	float32 m_flTintPerc; // 0x0204
	float32 m_flUpdateThreshold; // 0x0208
	int32 m_nTintCP; // 0x020C
	ParticleAttributeIndex_t m_nFieldOutput; // 0x0210
	ParticleColorBlendMode_t m_nTintBlendMode; // 0x0214
	float32 m_flLightAmplification; // 0x0218
};
class SteamAudioPathSettings_t // steamaudio
{
	int32 m_nNumVisSamples; // 0x0000
	float32 m_flProbeVisRadius; // 0x0004
	float32 m_flProbeVisThreshold; // 0x0008
	float32 m_flProbePathRange; // 0x000C
};
class CNmVirtualParameterFloatNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	int16 m_nChildNodeIdx; // 0x0010
};
class CNmTargetInfoNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	CNmTargetInfoNode::Info_t m_infoType; // 0x0014
	bool m_bIsWorldSpaceTarget; // 0x0018
};
class CSpinUpdateBase : public CParticleFunctionOperator // particles
{
};
class C_OP_PositionLock : public CParticleFunctionOperator // particles
{
	CParticleTransformInput m_TransformInput; // 0x01D0
	float32 m_flStartTime_min; // 0x0238
	float32 m_flStartTime_max; // 0x023C
	float32 m_flStartTime_exp; // 0x0240
	float32 m_flEndTime_min; // 0x0244
	float32 m_flEndTime_max; // 0x0248
	float32 m_flEndTime_exp; // 0x024C
	float32 m_flRange; // 0x0250
	CParticleCollectionFloatInput m_flRangeBias; // 0x0258
	float32 m_flJumpThreshold; // 0x03C8
	float32 m_flPrevPosScale; // 0x03CC
	bool m_bLockRot; // 0x03D0
	CParticleCollectionVecInput m_vecScale; // 0x03D8
	ParticleAttributeIndex_t m_nFieldOutput; // 0x0A90
	ParticleAttributeIndex_t m_nFieldOutputPrev; // 0x0A94
};
class CAnimParameterBase // animgraphlib
{
	CGlobalSymbol m_name; // 0x0018
	CUtlString m_sComment; // 0x0020
	CUtlString m_group; // 0x0028
	AnimParamID m_id; // 0x0030
	CUtlString m_componentName; // 0x0048
	bool m_bNetworkingRequested; // 0x0068
	bool m_bIsReferenced; // 0x0069
};
class CTimeRemainingMetricEvaluator : public CMotionMetricEvaluator // animgraphlib
{
	bool m_bMatchByTimeRemaining; // 0x0050
	float32 m_flMaxTimeRemaining; // 0x0054
	bool m_bFilterByTimeRemaining; // 0x0058
	float32 m_flMinTimeRemaining; // 0x005C
};
class CGameScriptedMoveDef_t // server
{
	Vector m_vDestOffset; // 0x0000
	CHandle< CBaseEntity > m_hDestEntity; // 0x000C
	QAngle m_angDest; // 0x0010
	float32 m_flDuration; // 0x001C
	float32 m_flAngRate; // 0x0020
	float32 m_flMoveSpeed; // 0x0024
	bool m_bAimDisabled; // 0x0028
	bool m_bIgnoreRotation; // 0x0029
	ForcedCrouchState_t m_nForcedCrouchState; // 0x002C
};
class CBtNodeDecorator : public CBtNode // server
{
};
class dynpitchvol_t : public dynpitchvol_base_t // server
{
};
class C_INIT_PositionWarp : public CParticleFunctionInitializer // particles
{
	CParticleCollectionVecInput m_vecWarpMin; // 0x01D8
	CParticleCollectionVecInput m_vecWarpMax; // 0x0890
	int32 m_nScaleControlPointNumber; // 0x0F48
	int32 m_nControlPointNumber; // 0x0F4C
	int32 m_nRadiusComponent; // 0x0F50
	float32 m_flWarpTime; // 0x0F54
	float32 m_flWarpStartTime; // 0x0F58
	float32 m_flPrevPosScale; // 0x0F5C
	bool m_bInvertWarp; // 0x0F60
	bool m_bUseCount; // 0x0F61
};
class CTargetSelectorUpdateNode : public CAnimUpdateNodeBase // animgraphlib
{
	TargetSelectorAngleMode_t m_eAngleMode; // 0x0060
	CUtlVector< CAnimUpdateNodeRef > m_children; // 0x0068
	CAnimParamHandle m_hTargetPosition; // 0x0084
	CAnimParamHandle m_hTargetFacePositionParameter; // 0x0086
	CAnimParamHandle m_hMoveHeadingParameter; // 0x0088
	CAnimParamHandle m_hDesiredMoveHeadingParameter; // 0x008A
	bool m_bTargetPositionIsWorldSpace; // 0x008C
	bool m_bTargetFacePositionIsWorldSpace; // 0x008D
	bool m_bEnablePhaseMatching; // 0x008E
	float32 m_flPhaseMatchingMaxRootMotionSkip; // 0x0090
};
class InfoForResourceTypeCModel // resourcesystem
{
};
class C_OP_RemapAverageScalarValuetoCP : public CParticleFunctionPreEmission // particles
{
	SetStatisticExpressionType_t m_nExpression; // 0x01D8
	CParticleCollectionFloatInput m_flDecimalPlaces; // 0x01E0
	int32 m_nOutControlPointNumber; // 0x0350
	int32 m_nOutVectorField; // 0x0354
	ParticleAttributeIndex_t m_nField; // 0x0358
	CParticleRemapFloatInput m_flOutputRemap; // 0x0360
};
class C_OP_SetPerChildControlPoint : public CParticleFunctionOperator // particles
{
	int32 m_nChildGroupID; // 0x01D0
	int32 m_nFirstControlPoint; // 0x01D4
	int32 m_nNumControlPoints; // 0x01D8
	CParticleCollectionFloatInput m_nParticleIncrement; // 0x01E0
	CParticleCollectionFloatInput m_nFirstSourcePoint; // 0x0350
	bool m_bSetOrientation; // 0x04C0
	ParticleAttributeIndex_t m_nOrientationField; // 0x04C4
	bool m_bNumBasedOnParticleCount; // 0x04C8
};
class CSosSoundEventGroupSchema // soundsystem
{
	SosGroupType_t m_nGroupType; // 0x0008
	bool m_bBlocksEvents; // 0x000C
	int32 m_nBlockMaxCount; // 0x0010
	float32 m_flMemberLifespanTime; // 0x0014
	bool m_bInvertMatch; // 0x0018
	SosGroupFieldBehavior_t m_Behavior_EventName; // 0x001C
	CUtlString m_matchSoundEventName; // 0x0020
	bool m_bMatchEventSubString; // 0x0028
	CUtlString m_matchSoundEventSubString; // 0x0030
	SosGroupFieldBehavior_t m_Behavior_EntIndex; // 0x0038
	float32 m_flEntIndex; // 0x003C
	SosGroupFieldBehavior_t m_Behavior_Opvar; // 0x0040
	float32 m_flOpvar; // 0x0044
	SosGroupFieldBehavior_t m_Behavior_String; // 0x0048
	CUtlString m_opvarString; // 0x0050
	CUtlVector< CSosGroupActionSchema* > m_vActions; // 0x0058
};
class FeTwistConstraint_t // physicslib
{
	uint16 nNodeOrient; // 0x0000
	uint16 nNodeEnd; // 0x0002
	float32 flTwistRelax; // 0x0004
	float32 flSwingRelax; // 0x0008
};
class CNmSyncTrack::EventMarker_t // animlib
{
	NmPercent_t m_startTime; // 0x0000
	CGlobalSymbol m_ID; // 0x0008
};
class CNmConstVectorNode::CDefinition : public CNmVectorValueNode::CDefinition // animlib
{
	Vector m_value; // 0x0010
};
class CAnimationGraphVisualizerSphere : public CAnimationGraphVisualizerPrimitiveBase // animgraphlib
{
	VectorAligned m_vWsPosition; // 0x0040
	float32 m_flRadius; // 0x0050
	Color m_Color; // 0x0054
};
class CBoneConstraintRbf : public CBoneConstraintBase // modellib
{
	CUtlVector< std::pair< CUtlString, uint32 > > m_inputBones; // 0x0020
	CUtlVector< std::pair< CUtlString, uint32 > > m_outputBones; // 0x0038
};
class VelocitySampler // server
{
	Vector m_prevSample; // 0x0000
	GameTime_t m_fPrevSampleTime; // 0x000C
	float32 m_fIdealSampleRate; // 0x0010
};
class C_OP_RenderScreenShake : public CParticleFunctionRenderer // particles
{
	float32 m_flDurationScale; // 0x0220
	float32 m_flRadiusScale; // 0x0224
	float32 m_flFrequencyScale; // 0x0228
	float32 m_flAmplitudeScale; // 0x022C
	ParticleAttributeIndex_t m_nRadiusField; // 0x0230
	ParticleAttributeIndex_t m_nDurationField; // 0x0234
	ParticleAttributeIndex_t m_nFrequencyField; // 0x0238
	ParticleAttributeIndex_t m_nAmplitudeField; // 0x023C
	int32 m_nFilterCP; // 0x0240
};
class CAnimNodePath // animgraphlib
{
	AnimNodeID[11] m_path; // 0x0000
	int32 m_nCount; // 0x002C
};
class CNmSkeleton // animlib
{
	CGlobalSymbol m_ID; // 0x0000
	CUtlLeanVector< CGlobalSymbol > m_boneIDs; // 0x0008
	CUtlVector< int32 > m_parentIndices; // 0x0018
	CUtlVector< CTransform > m_parentSpaceReferencePose; // 0x0030
	CUtlVector< CTransform > m_modelSpaceReferencePose; // 0x0048
	int32 m_numBonesToSampleAtLowLOD; // 0x0060
	CUtlLeanVector< NmBoneMaskSetDefinition_t > m_maskDefinitions; // 0x0088
	CUtlLeanVector< CNmSkeleton::SecondarySkeleton_t > m_secondarySkeletons; // 0x00A8
	bool m_bIsPropSkeleton; // 0x00B8
};
class CModelConfigElement_SetMaterialGroup : public CModelConfigElement // modellib
{
	CUtlString m_MaterialGroupName; // 0x0048
};
class CPhysicsBodyGameMarkup // server
{
	CUtlString m_TargetBody; // 0x0000
	CGlobalSymbol m_Tag; // 0x0008
};
class C_OP_ContinuousEmitter : public CParticleFunctionEmitter // particles
{
	CParticleCollectionFloatInput m_flEmissionDuration; // 0x01D8
	CParticleCollectionFloatInput m_flStartTime; // 0x0348
	CParticleCollectionFloatInput m_flEmitRate; // 0x04B8
	float32 m_flEmissionScale; // 0x0628
	float32 m_flScalePerParentParticle; // 0x062C
	bool m_bInitFromKilledParentParticles; // 0x0630
	EventTypeSelection_t m_nEventType; // 0x0634
	int32 m_nSnapshotControlPoint; // 0x0638
	CUtlString m_strSnapshotSubset; // 0x0640
	int32 m_nLimitPerUpdate; // 0x0648
	bool m_bForceEmitOnFirstUpdate; // 0x064C
	bool m_bForceEmitOnLastUpdate; // 0x064D
};
class constraint_breakableparams_t // vphysics2
{
	float32 strength; // 0x0000
	float32 forceLimit; // 0x0004
	float32 torqueLimit; // 0x0008
	float32[2] bodyMassScale; // 0x000C
	bool isActive; // 0x0014
};
class CModelConfigElement_RandomColor : public CModelConfigElement // modellib
{
	CColorGradient m_Gradient; // 0x0048
};
class CNmCachedPoseWriteTask : public CNmPoseTask // animlib
{
};
class InfoForResourceTypeCPostProcessingResource // resourcesystem
{
};
class RelationshipOverride_t : public Relationship_t // server
{
	CHandle< CBaseEntity > entity; // 0x0008
	Class_T classType; // 0x000C
};
class ParticleAttributeIndex_t // particles
{
	int32 m_Value; // 0x0000
};
class CVoiceContainerMultiBlender : public CVoiceContainerBase // soundsystem_voicecontainers
{
	CSoundContainerReferenceArray m_soundsToPlay; // 0x00A8
	float32 m_flBlendFactor; // 0x00E0
	float32 m_flCrossover; // 0x00E4
};
class FeBuildSDFRigid_t : public FeSDFRigid_t // physicslib
{
	int32 m_nPriority; // 0x0050
	uint32 m_nVertexMapHash; // 0x0054
	uint32 m_nAntitunnelGroupBits; // 0x0058
};
class IAnimationGraphInstance // animgraphlib
{
};
class CSoundContainerReferenceArray // soundsystem_voicecontainers
{
	bool m_bUseReference; // 0x0000
	CUtlVector< CStrongHandle< InfoForResourceTypeCVoiceContainerBase > > m_sounds; // 0x0008
	CUtlVector< CVoiceContainerBase* > m_pSounds; // 0x0020
};
class VPhysXAggregateData_t // modellib
{
	uint16 m_nFlags; // 0x0000
	uint16 m_nRefCounter; // 0x0002
	CUtlVector< uint32 > m_bonesHash; // 0x0008
	CUtlVector< CUtlString > m_boneNames; // 0x0020
	CUtlVector< uint16 > m_indexNames; // 0x0038
	CUtlVector< uint16 > m_indexHash; // 0x0050
	CUtlVector< matrix3x4a_t > m_bindPose; // 0x0068
	CUtlVector< VPhysXBodyPart_t > m_parts; // 0x0080
	CUtlVector< PhysShapeMarkup_t > m_shapeMarkups; // 0x0098
	CUtlVector< VPhysXConstraint2_t > m_constraints2; // 0x00B0
	CUtlVector< VPhysXJoint_t > m_joints; // 0x00C8
	PhysFeModelDesc_t* m_pFeModel; // 0x00E0
	CUtlVector< uint16 > m_boneParents; // 0x00E8
	CUtlVector< uint32 > m_surfacePropertyHashes; // 0x0100
	CUtlVector< VPhysXCollisionAttributes_t > m_collisionAttributes; // 0x0118
	CUtlVector< CUtlString > m_debugPartNames; // 0x0130
	CUtlString m_embeddedKeyvalues; // 0x0148
};
class CSolveIKChainUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	CUtlVector< CSolveIKTargetHandle_t > m_targetHandles; // 0x0070
	SolveIKChainPoseOpFixedSettings_t m_opFixedData; // 0x0088
};
class CNavVolumeCalculatedVector : public CNavVolume // server
{
};
class C_INIT_InitialSequenceFromModel : public CParticleFunctionInitializer // particles
{
	int32 m_nControlPointNumber; // 0x01D8
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01DC
	ParticleAttributeIndex_t m_nFieldOutputAnim; // 0x01E0
	float32 m_flInputMin; // 0x01E4
	float32 m_flInputMax; // 0x01E8
	float32 m_flOutputMin; // 0x01EC
	float32 m_flOutputMax; // 0x01F0
	ParticleSetMethod_t m_nSetMethod; // 0x01F4
};
class C_OP_FadeInSimple : public CParticleFunctionOperator // particles
{
	float32 m_flFadeInTime; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
};
class C_INIT_OffsetVectorToVector : public CParticleFunctionInitializer // particles
{
	ParticleAttributeIndex_t m_nFieldInput; // 0x01D8
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01DC
	Vector m_vecOutputMin; // 0x01E0
	Vector m_vecOutputMax; // 0x01EC
	CRandomNumberGeneratorParameters m_randomnessParameters; // 0x01F8
};
class C_OP_ModelCull : public CParticleFunctionOperator // particles
{
	int32 m_nControlPointNumber; // 0x01D0
	bool m_bBoundBox; // 0x01D4
	bool m_bCullOutside; // 0x01D5
	bool m_bUseBones; // 0x01D6
	char[128] m_HitboxSetName; // 0x01D7
};
class C_OP_FadeAndKillForTracers : public CParticleFunctionOperator // particles
{
	float32 m_flStartFadeInTime; // 0x01D0
	float32 m_flEndFadeInTime; // 0x01D4
	float32 m_flStartFadeOutTime; // 0x01D8
	float32 m_flEndFadeOutTime; // 0x01DC
	float32 m_flStartAlpha; // 0x01E0
	float32 m_flEndAlpha; // 0x01E4
};
class RnSoftbodyCapsule_t // physicslib
{
	Vector[2] m_vCenter; // 0x0000
	float32 m_flRadius; // 0x0018
	uint16[2] m_nParticle; // 0x001C
};
class EventClientProcessGameInput_t // engine2
{
	EngineLoopState_t m_LoopState; // 0x0000
	float32 m_flRealTime; // 0x0028
	float32 m_flFrameTime; // 0x002C
};
class InfoForResourceTypeManifestTestResource_t // resourcesystem
{
};
class C_OP_CollideWithParentParticles : public CParticleFunctionConstraint // particles
{
	CPerParticleFloatInput m_flParentRadiusScale; // 0x01D0
	CPerParticleFloatInput m_flRadiusScale; // 0x0340
};
class C_OP_LerpToInitialPosition : public CParticleFunctionOperator // particles
{
	int32 m_nControlPointNumber; // 0x01D0
	CPerParticleFloatInput m_flInterpolation; // 0x01D8
	ParticleAttributeIndex_t m_nCacheField; // 0x0348
	CParticleCollectionFloatInput m_flScale; // 0x0350
	CParticleCollectionVecInput m_vecScale; // 0x04C0
};
class VMixConvolutionDesc_t // soundsystem_lowlevel
{
	float32 m_fldbGain; // 0x0000
	float32 m_flPreDelayMS; // 0x0004
	float32 m_flWetMix; // 0x0008
	float32 m_fldbLow; // 0x000C
	float32 m_fldbMid; // 0x0010
	float32 m_fldbHigh; // 0x0014
	float32 m_flLowCutoffFreq; // 0x0018
	float32 m_flHighCutoffFreq; // 0x001C
};
class CVMixSubgraphSwitchProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixSubgraphSwitchDesc_t m_desc; // 0x0020
};
class CVoiceContainerEnvelope : public CVoiceContainerDefault // soundsystem_voicecontainers
{
	CStrongHandle< InfoForResourceTypeCVoiceContainerBase > m_sound; // 0x00A8
	CVoiceContainerAnalysisBase* m_analysisContainer; // 0x00B0
};
class CFeJiggleBone // physicslib
{
	uint32 m_nFlags; // 0x0000
	float32 m_flLength; // 0x0004
	float32 m_flTipMass; // 0x0008
	float32 m_flYawStiffness; // 0x000C
	float32 m_flYawDamping; // 0x0010
	float32 m_flPitchStiffness; // 0x0014
	float32 m_flPitchDamping; // 0x0018
	float32 m_flAlongStiffness; // 0x001C
	float32 m_flAlongDamping; // 0x0020
	float32 m_flAngleLimit; // 0x0024
	float32 m_flMinYaw; // 0x0028
	float32 m_flMaxYaw; // 0x002C
	float32 m_flYawFriction; // 0x0030
	float32 m_flYawBounce; // 0x0034
	float32 m_flMinPitch; // 0x0038
	float32 m_flMaxPitch; // 0x003C
	float32 m_flPitchFriction; // 0x0040
	float32 m_flPitchBounce; // 0x0044
	float32 m_flBaseMass; // 0x0048
	float32 m_flBaseStiffness; // 0x004C
	float32 m_flBaseDamping; // 0x0050
	float32 m_flBaseMinLeft; // 0x0054
	float32 m_flBaseMaxLeft; // 0x0058
	float32 m_flBaseLeftFriction; // 0x005C
	float32 m_flBaseMinUp; // 0x0060
	float32 m_flBaseMaxUp; // 0x0064
	float32 m_flBaseUpFriction; // 0x0068
	float32 m_flBaseMinForward; // 0x006C
	float32 m_flBaseMaxForward; // 0x0070
	float32 m_flBaseForwardFriction; // 0x0074
	float32 m_flRadius0; // 0x0078
	float32 m_flRadius1; // 0x007C
	Vector m_vPoint0; // 0x0080
	Vector m_vPoint1; // 0x008C
	uint16 m_nCollisionMask; // 0x0098
};
class AnimComponentID // modellib
{
	uint32 m_id; // 0x0000
};
class CFootDefinition // modellib
{
	CUtlString m_name; // 0x0000
	CUtlString m_ankleBoneName; // 0x0008
	CUtlString m_toeBoneName; // 0x0010
	Vector m_vBallOffset; // 0x0018
	Vector m_vHeelOffset; // 0x0024
	float32 m_flFootLength; // 0x0030
	float32 m_flBindPoseDirectionMS; // 0x0034
	float32 m_flTraceHeight; // 0x0038
	float32 m_flTraceRadius; // 0x003C
};
class CSubtractUpdateNode : public CBinaryUpdateNode // animgraphlib
{
	BinaryNodeChildOption m_footMotionTiming; // 0x0094
	bool m_bApplyToFootMotion; // 0x0098
	bool m_bApplyChannelsSeparately; // 0x0099
	bool m_bUseModelSpace; // 0x009A
};
class CMotionNodeBlend1D : public CMotionNode // animgraphlib
{
	CUtlVector< MotionBlendItem > m_blendItems; // 0x0028
	int32 m_nParamIndex; // 0x0040
};
class CNavVolumeSphericalShell : public CNavVolumeSphere // navlib
{
	float32 m_flRadiusInner; // 0x0088
};
class PulseScriptedSequenceData_t // server
{
	int32 m_nActorID; // 0x0000
	CUtlString m_szPreIdleSequence; // 0x0008
	CUtlString m_szEntrySequence; // 0x0010
	CUtlString m_szSequence; // 0x0018
	CUtlString m_szExitSequence; // 0x0020
	ScriptedMoveTo_t m_nMoveTo; // 0x0028
	SharedMovementGait_t m_nMoveToGait; // 0x002C
	ScriptedHeldWeaponBehavior_t m_nHeldWeaponBehavior; // 0x0030
	bool m_bLoopPreIdleSequence; // 0x0034
	bool m_bLoopActionSequence; // 0x0035
	bool m_bLoopPostIdleSequence; // 0x0036
	bool m_bIgnoreLookAt; // 0x0037
};
class C_OP_NormalizeVector : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	float32 m_flScale; // 0x01D4
};
class C_OP_RenderClothForce : public CParticleFunctionRenderer // particles
{
};
class SteamAudioCustomDataOcclusionSettings_t // steamaudio
{
	bool m_bEnablePathing; // 0x0000
	bool m_bEnableReflections; // 0x0001
	int32 m_nReflectionRays; // 0x0004
	int32 m_nReflectionBounces; // 0x0008
};
class VMixBoxverbDesc_t // soundsystem_lowlevel
{
	float32 m_flSizeMax; // 0x0000
	float32 m_flSizeMin; // 0x0004
	float32 m_flComplexity; // 0x0008
	float32 m_flDiffusion; // 0x000C
	float32 m_flModDepth; // 0x0010
	float32 m_flModRate; // 0x0014
	bool m_bParallel; // 0x0018
	VMixFilterDesc_t m_filterType; // 0x001C
	float32 m_flWidth; // 0x002C
	float32 m_flHeight; // 0x0030
	float32 m_flDepth; // 0x0034
	float32 m_flFeedbackScale; // 0x0038
	float32 m_flFeedbackWidth; // 0x003C
	float32 m_flFeedbackHeight; // 0x0040
	float32 m_flFeedbackDepth; // 0x0044
	float32 m_flOutputGain; // 0x0048
	float32 m_flTaps; // 0x004C
};
class FeCtrlOffset_t // physicslib
{
	Vector vOffset; // 0x0000
	uint16 nCtrlParent; // 0x000C
	uint16 nCtrlChild; // 0x000E
};
class InfoForResourceTypeCAnimData // resourcesystem
{
};
class CNavHullPresetVData // navlib
{
	CUtlVector< CUtlString > m_vecNavHulls; // 0x0000
};
class CNavVolume // navlib
{
};
class CAnimGraphControllerBase // server
{
	ExternalAnimGraphHandle_t m_hExternalGraph; // 0x0018
};
class C_OP_RemapScalarEndCap : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldInput; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	float32 m_flInputMin; // 0x01D8
	float32 m_flInputMax; // 0x01DC
	float32 m_flOutputMin; // 0x01E0
	float32 m_flOutputMax; // 0x01E4
};
class CSoundContainerReference // soundsystem_voicecontainers
{
	bool m_bUseReference; // 0x0000
	CStrongHandle< InfoForResourceTypeCVoiceContainerBase > m_sound; // 0x0008
	CVoiceContainerBase* m_pSound; // 0x0010
};
class CNmReferencePoseNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
};
class CAnimKeyData // animationsystem
{
	CBufferString m_name; // 0x0000
	CUtlVector< CAnimBone > m_boneArray; // 0x0010
	CUtlVector< CAnimUser > m_userArray; // 0x0028
	CUtlVector< CBufferString > m_morphArray; // 0x0040
	int32 m_nChannelElements; // 0x0058
	CUtlVector< CAnimDataChannelDesc > m_dataChannelArray; // 0x0060
};
class MaterialParam_t // materialsystem2
{
	CUtlString m_name; // 0x0000
};
class CDestructiblePart // server
{
	CGlobalSymbol m_DebugName; // 0x0000
	HitGroup_t m_nHitGroup; // 0x0008
	bool m_bDisableHitGroupWhenDestroyed; // 0x000C
	CUtlVector< HitGroup_t > m_nOtherHitgroupsToDestroyWhenFullyDestructed; // 0x0010
	bool m_bOnlyDestroyWhenGibbing; // 0x0028
	CGlobalSymbol m_sBodyGroupName; // 0x0030
	CUtlVector< CDestructiblePart_DamageLevel > m_DamageLevels; // 0x0038
};
class CNmEventConsumer // server
{
};
class C_OP_RepeatedTriggerChildGroup : public CParticleFunctionPreEmission // particles
{
	int32 m_nChildGroupID; // 0x01D8
	CParticleCollectionFloatInput m_flClusterRefireTime; // 0x01E0
	CParticleCollectionFloatInput m_flClusterSize; // 0x0350
	CParticleCollectionFloatInput m_flClusterCooldown; // 0x04C0
	bool m_bLimitChildCount; // 0x0630
};
class C_OP_TurbulenceForce : public CParticleFunctionForce // particles
{
	float32 m_flNoiseCoordScale0; // 0x01E0
	float32 m_flNoiseCoordScale1; // 0x01E4
	float32 m_flNoiseCoordScale2; // 0x01E8
	float32 m_flNoiseCoordScale3; // 0x01EC
	Vector m_vecNoiseAmount0; // 0x01F0
	Vector m_vecNoiseAmount1; // 0x01FC
	Vector m_vecNoiseAmount2; // 0x0208
	Vector m_vecNoiseAmount3; // 0x0214
};
class SequenceWeightedList_t // particles
{
	int32 m_nSequence; // 0x0000
	float32 m_flRelativeWeight; // 0x0004
};
class C_OP_RemapParticleCountToScalar : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	CParticleCollectionFloatInput m_nInputMin; // 0x01D8
	CParticleCollectionFloatInput m_nInputMax; // 0x0348
	CParticleCollectionFloatInput m_flOutputMin; // 0x04B8
	CParticleCollectionFloatInput m_flOutputMax; // 0x0628
	bool m_bActiveRange; // 0x0798
	ParticleSetMethod_t m_nSetMethod; // 0x079C
};
class constraint_hingeparams_t // vphysics2
{
	Vector worldPosition; // 0x0000
	Vector worldAxisDirection; // 0x000C
	constraint_axislimit_t hingeAxis; // 0x0018
	constraint_breakableparams_t constraint; // 0x0028
};
class CChoiceUpdateNode : public CAnimUpdateNodeBase // animgraphlib
{
	CUtlVector< CAnimUpdateNodeRef > m_children; // 0x0060
	CUtlVector< float32 > m_weights; // 0x0078
	CUtlVector< float32 > m_blendTimes; // 0x0090
	ChoiceMethod m_choiceMethod; // 0x00A8
	ChoiceChangeMethod m_choiceChangeMethod; // 0x00AC
	ChoiceBlendMethod m_blendMethod; // 0x00B0
	float32 m_blendTime; // 0x00B4
	bool m_bCrossFade; // 0x00B8
	bool m_bResetChosen; // 0x00B9
	bool m_bDontResetSameSelection; // 0x00BA
};
class CBoneConstraintPoseSpaceBone : public CBaseConstraint // modellib
{
	CUtlVector< CBoneConstraintPoseSpaceBone::Input_t > m_inputList; // 0x0060
};
class inv_image_light_fill_t // client
{
	Vector color; // 0x0000
	QAngle angle; // 0x000C
	float32 brightness; // 0x0018
};
class C_INIT_RingWave : public CParticleFunctionInitializer // particles
{
	CParticleTransformInput m_TransformInput; // 0x01D8
	CParticleCollectionFloatInput m_flParticlesPerOrbit; // 0x0240
	CPerParticleFloatInput m_flInitialRadius; // 0x03B0
	CPerParticleFloatInput m_flThickness; // 0x0520
	CPerParticleFloatInput m_flInitialSpeedMin; // 0x0690
	CPerParticleFloatInput m_flInitialSpeedMax; // 0x0800
	CPerParticleFloatInput m_flRoll; // 0x0970
	CPerParticleFloatInput m_flPitch; // 0x0AE0
	CPerParticleFloatInput m_flYaw; // 0x0C50
	bool m_bEvenDistribution; // 0x0DC0
	bool m_bXYVelocityOnly; // 0x0DC1
};
class C_OP_BoxConstraint : public CParticleFunctionConstraint // particles
{
	CParticleCollectionVecInput m_vecMin; // 0x01D0
	CParticleCollectionVecInput m_vecMax; // 0x0888
	int32 m_nCP; // 0x0F40
	bool m_bLocalSpace; // 0x0F44
	bool m_bAccountForRadius; // 0x0F45
};
class CSSDSMsg_ViewTargetList // scenesystem
{
	SceneViewId_t m_viewId; // 0x0000
	CUtlString m_ViewName; // 0x0010
	CUtlVector< CSSDSMsg_ViewTarget > m_Targets; // 0x0018
};
class MaterialParamBuffer_t : public MaterialParam_t // materialsystem2
{
	CUtlBinaryBlock m_value; // 0x0008
};
class InfoForResourceTypeCAnimationGroup // resourcesystem
{
};
class C_OP_LockToSavedSequentialPathV2 : public CParticleFunctionOperator // particles
{
	float32 m_flFadeStart; // 0x01D0
	float32 m_flFadeEnd; // 0x01D4
	bool m_bCPPairs; // 0x01D8
	CPathParameters m_PathParams; // 0x01E0
};
class C_OP_DistanceBetweenVecs : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	CPerParticleVecInput m_vecPoint1; // 0x01D8
	CPerParticleVecInput m_vecPoint2; // 0x0890
	CPerParticleFloatInput m_flInputMin; // 0x0F48
	CPerParticleFloatInput m_flInputMax; // 0x10B8
	CPerParticleFloatInput m_flOutputMin; // 0x1228
	CPerParticleFloatInput m_flOutputMax; // 0x1398
	ParticleSetMethod_t m_nSetMethod; // 0x1508
	bool m_bDeltaTime; // 0x150C
};
class CMaterialDrawDescriptor // modellib
{
	float32 m_flUvDensity; // 0x0000
	Vector m_vTintColor; // 0x0004
	float32 m_flAlpha; // 0x0010
	uint16 m_nNumMeshlets; // 0x0016
	uint32 m_nFirstMeshlet; // 0x001C
	uint32 m_nAppliedIndexOffset; // 0x0020
	uint8 m_nDepthVertexBufferIndex; // 0x0024
	uint8 m_nMeshletPackedIVBIndex; // 0x0025
	CUtlLeanVector< CMaterialDrawDescriptor::RigidMeshPart_t > m_rigidMeshParts; // 0x0028
	RenderPrimitiveType_t m_nPrimitiveType; // 0x0038
	int32 m_nBaseVertex; // 0x003C
	int32 m_nVertexCount; // 0x0040
	int32 m_nStartIndex; // 0x0044
	int32 m_nIndexCount; // 0x0048
	CRenderBufferBinding m_indexBuffer; // 0x00B0
	CRenderBufferBinding m_meshletPackedIVB; // 0x00D0
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_material; // 0x0100
};
class CDecalGroupVData // server
{
	CUtlVector< DecalGroupOption_t > m_vecOptions; // 0x0000
	float32 m_flTotalProbability; // 0x0018
};
class CNmEventConsumerParticle : public CNmEventConsumer // server
{
};
class PostProcessingTonemapParameters_t // materialsystem2
{
	float32 m_flExposureBias; // 0x0000
	float32 m_flShoulderStrength; // 0x0004
	float32 m_flLinearStrength; // 0x0008
	float32 m_flLinearAngle; // 0x000C
	float32 m_flToeStrength; // 0x0010
	float32 m_flToeNum; // 0x0014
	float32 m_flToeDenom; // 0x0018
	float32 m_flWhitePoint; // 0x001C
	float32 m_flLuminanceSource; // 0x0020
	float32 m_flExposureBiasShadows; // 0x0024
	float32 m_flExposureBiasHighlights; // 0x0028
	float32 m_flMinShadowLum; // 0x002C
	float32 m_flMaxShadowLum; // 0x0030
	float32 m_flMinHighlightLum; // 0x0034
	float32 m_flMaxHighlightLum; // 0x0038
};
class DestructibleHitGroupToDestroy_t // server
{
	HitGroup_t m_nHitGroup; // 0x0000
	int32 m_nMaxDamageLevel; // 0x0004
};
class CSAdditionalPerRoundStats_t // server
{
	int32 m_numChickensKilled; // 0x0000
	int32 m_killsWhileBlind; // 0x0004
	int32 m_bombCarrierkills; // 0x0008
	float32 m_flBurnDamageInflicted; // 0x000C
	float32 m_flBlastDamageInflicted; // 0x0010
	int32 m_iDinks; // 0x0014
	bool m_bFreshStartThisRound; // 0x0018
	bool m_bBombPlantedAndAlive; // 0x0019
	int32 m_nDefuseStarts; // 0x001C
	int32 m_nHostagePickUps; // 0x0020
	int32 m_numTeammatesFlashed; // 0x0024
	CUtlString m_strAnnotationsWorkshopId; // 0x0028
};
class FeAxialEdgeBend_t // physicslib
{
	float32 te; // 0x0000
	float32 tv; // 0x0004
	float32 flDist; // 0x0008
	float32[4] flWeight; // 0x000C
	uint16[6] nNode; // 0x001C
};
class CAnimBoneDifference // animationsystem
{
	CBufferString m_name; // 0x0000
	CBufferString m_parent; // 0x0010
	Vector m_posError; // 0x0020
	bool m_bHasRotation; // 0x002C
	bool m_bHasMovement; // 0x002D
};
class CJiggleBoneUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	JiggleBoneSettingsList_t m_opFixedData; // 0x0070
};
class CNmSampleTask : public CNmPoseTask // animlib
{
};
class IParticleEffect // particleslib
{
};
class CPerParticleFloatInput : public CParticleFloatInput // particleslib
{
};
class CAnimData // animationsystem
{
	CBufferString m_name; // 0x0010
	CUtlVector< CAnimDesc > m_animArray; // 0x0020
	CUtlVector< CAnimDecoder > m_decoderArray; // 0x0038
	int32 m_nMaxUniqueFrameIndex; // 0x0050
	CUtlVector< CAnimFrameSegment > m_segmentArray; // 0x0058
};
class C_OP_RenderSound : public CParticleFunctionRenderer // particles
{
	float32 m_flDurationScale; // 0x0220
	float32 m_flSndLvlScale; // 0x0224
	float32 m_flPitchScale; // 0x0228
	float32 m_flVolumeScale; // 0x022C
	ParticleAttributeIndex_t m_nSndLvlField; // 0x0230
	ParticleAttributeIndex_t m_nDurationField; // 0x0234
	ParticleAttributeIndex_t m_nPitchField; // 0x0238
	ParticleAttributeIndex_t m_nVolumeField; // 0x023C
	int32 m_nChannel; // 0x0240
	int32 m_nCPReference; // 0x0244
	char[256] m_pszSoundName; // 0x0248
	bool m_bSuppressStopSoundEvent; // 0x0348
};
class VMixDynamics3BandDesc_t // soundsystem_lowlevel
{
	float32 m_fldbGainOutput; // 0x0000
	float32 m_flRMSTimeMS; // 0x0004
	float32 m_fldbKneeWidth; // 0x0008
	float32 m_flDepth; // 0x000C
	float32 m_flWetMix; // 0x0010
	float32 m_flTimeScale; // 0x0014
	float32 m_flLowCutoffFreq; // 0x0018
	float32 m_flHighCutoffFreq; // 0x001C
	bool m_bPeakMode; // 0x0020
	VMixDynamicsBand_t[3] m_bandDesc; // 0x0024
};
class FeStiffHingeBuild_t // physicslib
{
	float32 flMaxAngle; // 0x0000
	float32 flStrength; // 0x0004
	float32[3] flMotionBias; // 0x0008
	uint16[3] nNode; // 0x0014
};
class CFootLockUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	FootLockPoseOpFixedSettings m_opFixedSettings; // 0x0070
	CUtlVector< FootFixedSettings > m_footSettings; // 0x00E0
	CAnimInputDamping m_hipShiftDamping; // 0x00F8
	CAnimInputDamping m_rootHeightDamping; // 0x0110
	float32 m_flStrideCurveScale; // 0x0128
	float32 m_flStrideCurveLimitScale; // 0x012C
	float32 m_flStepHeightIncreaseScale; // 0x0130
	float32 m_flStepHeightDecreaseScale; // 0x0134
	float32 m_flHipShiftScale; // 0x0138
	float32 m_flBlendTime; // 0x013C
	float32 m_flMaxRootHeightOffset; // 0x0140
	float32 m_flMinRootHeightOffset; // 0x0144
	float32 m_flTiltPlanePitchSpringStrength; // 0x0148
	float32 m_flTiltPlaneRollSpringStrength; // 0x014C
	bool m_bApplyFootRotationLimits; // 0x0150
	bool m_bApplyHipShift; // 0x0151
	bool m_bModulateStepHeight; // 0x0152
	bool m_bResetChild; // 0x0153
	bool m_bEnableVerticalCurvedPaths; // 0x0154
	bool m_bEnableRootHeightDamping; // 0x0155
};
class CAnimUpdateNodeBase // animgraphlib
{
	CAnimNodePath m_nodePath; // 0x0018
	AnimNodeNetworkMode m_networkMode; // 0x0048
	CUtlString m_name; // 0x0050
};
class CAnimationGroup // animationsystem
{
	uint32 m_nFlags; // 0x0010
	CBufferString m_name; // 0x0018
	CUtlVector< CStrongHandle< InfoForResourceTypeCAnimData > > m_localHAnimArray_Handle; // 0x0060
	CUtlVector< CStrongHandle< InfoForResourceTypeCAnimationGroup > > m_includedGroupArray_Handle; // 0x0078
	CStrongHandle< InfoForResourceTypeCSequenceGroupData > m_directHSeqGroup_Handle; // 0x0090
	CAnimKeyData m_decodeKey; // 0x0098
	CUtlVector< CBufferString > m_szScripts; // 0x0110
	CUtlVector< CStrongHandleVoid > m_AdditionalExtRefs; // 0x0128
};
class ResponseParams // server
{
	int16 odds; // 0x0010
	int16 flags; // 0x0012
	ResponseFollowup* m_pFollowup; // 0x0018
};
class IHasAttributes // server
{
};
class C_OP_SetControlPointFieldToWater : public CParticleFunctionPreEmission // particles
{
	int32 m_nSourceCP; // 0x01D8
	int32 m_nDestCP; // 0x01DC
	int32 m_nCPField; // 0x01E0
};
class CVoiceContainerStaticAdditiveSynth : public CVoiceContainerAsyncGenerator // soundsystem_voicecontainers
{
	CUtlVector< CVoiceContainerStaticAdditiveSynth::CTone > m_tones; // 0x00B8
};
class CVoiceContainerDecayingSineWave : public CVoiceContainerGenerator // soundsystem_voicecontainers
{
	float32 m_flFrequency; // 0x00A8
	float32 m_flDecayTime; // 0x00AC
};
class CConcreteAnimParameter : public CAnimParameterBase // animgraphlib
{
	AnimParamButton_t m_previewButton; // 0x0070
	AnimParamNetworkSetting m_eNetworkSetting; // 0x0074
	bool m_bUseMostRecentValue; // 0x0078
	bool m_bAutoReset; // 0x0079
	bool m_bGameWritable; // 0x007A
	bool m_bGraphWritable; // 0x007B
};
class CSelectorUpdateNode : public CAnimUpdateNodeBase // animgraphlib
{
	CUtlVector< CAnimUpdateNodeRef > m_children; // 0x0060
	CUtlVector< int8 > m_tags; // 0x0078
	CBlendCurve m_blendCurve; // 0x0094
	CAnimValue< float32 > m_flBlendTime; // 0x009C
	CAnimParamHandle m_hParameter; // 0x00A4
	int32 m_nTagIndex; // 0x00A8
	SelectorTagBehavior_t m_eTagBehavior; // 0x00AC
	bool m_bResetOnChange; // 0x00B0
	bool m_bLockWhenWaning; // 0x00B1
	bool m_bSyncCyclesOnChange; // 0x00B2
};
class InfoForResourceTypeCDOTANovelsList // resourcesystem
{
};
class CDestructiblePartsSystemData // server
{
	CUtlOrderedMap< HitGroup_t, CDestructiblePart > m_PartsDataByHitGroup; // 0x0000
	CRangeInt m_nMinMaxNumberHitGroupsToDestroyWhenGibbing; // 0x0028
};
class C_OP_SetControlPointFieldToScalarExpression : public CParticleFunctionPreEmission // particles
{
	ScalarExpressionType_t m_nExpression; // 0x01D8
	CParticleCollectionFloatInput m_flInput1; // 0x01E0
	CParticleCollectionFloatInput m_flInput2; // 0x0350
	CParticleRemapFloatInput m_flOutputRemap; // 0x04C0
	int32 m_nOutputCP; // 0x0630
	int32 m_nOutVectorField; // 0x0634
	CParticleCollectionFloatInput m_flInterpolation; // 0x0638
};
class C_OP_ControlPointToRadialScreenSpace : public CParticleFunctionPreEmission // particles
{
	int32 m_nCPIn; // 0x01D8
	Vector m_vecCP1Pos; // 0x01DC
	int32 m_nCPOut; // 0x01E8
	int32 m_nCPOutField; // 0x01EC
	int32 m_nCPSSPosOut; // 0x01F0
};
class C_OP_RenderStatusEffectCitadel : public CParticleFunctionRenderer // particles
{
	CStrongHandle< InfoForResourceTypeCTextureBase > m_pTextureColorWarp; // 0x0220
	CStrongHandle< InfoForResourceTypeCTextureBase > m_pTextureNormal; // 0x0228
	CStrongHandle< InfoForResourceTypeCTextureBase > m_pTextureMetalness; // 0x0230
	CStrongHandle< InfoForResourceTypeCTextureBase > m_pTextureRoughness; // 0x0238
	CStrongHandle< InfoForResourceTypeCTextureBase > m_pTextureSelfIllum; // 0x0240
	CStrongHandle< InfoForResourceTypeCTextureBase > m_pTextureDetail; // 0x0248
};
class CStaticPoseCacheBuilder : public CStaticPoseCache // animgraphlib
{
};
class CTargetWarpUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	TargetWarpAngleMode_t m_eAngleMode; // 0x0074
	CAnimParamHandle m_hTargetPositionParameter; // 0x0078
	CAnimParamHandle m_hTargetUpVectorParameter; // 0x007A
	CAnimParamHandle m_hTargetFacePositionParameter; // 0x007C
	CAnimParamHandle m_hMoveHeadingParameter; // 0x007E
	CAnimParamHandle m_hDesiredMoveHeadingParameter; // 0x0080
	TargetWarpCorrectionMethod m_eCorrectionMethod; // 0x0084
	TargetWarpTimingMethod m_eTargetWarpTimingMethod; // 0x0088
	bool m_bTargetFacePositionIsWorldSpace; // 0x008C
	bool m_bTargetPositionIsWorldSpace; // 0x008D
	bool m_bOnlyWarpWhenTagIsFound; // 0x008E
	bool m_bWarpOrientationDuringTranslation; // 0x008F
	bool m_bWarpAroundCenter; // 0x0090
	float32 m_flMaxAngle; // 0x0094
};
class ResourceId_t // resourcefile
{
	uint64 m_Value; // 0x0000
};
class ResponseContext_t // server
{
	CUtlSymbolLarge m_iszName; // 0x0000
	CUtlSymbolLarge m_iszValue; // 0x0008
	GameTime_t m_fExpirationTime; // 0x0010
};
class C_OP_PointVectorAtNextParticle : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	CPerParticleFloatInput m_flInterpolation; // 0x01D8
};
class C_INIT_LifespanFromVelocity : public CParticleFunctionInitializer // particles
{
	Vector m_vecComponentScale; // 0x01D8
	float32 m_flTraceOffset; // 0x01E4
	float32 m_flMaxTraceLength; // 0x01E8
	float32 m_flTraceTolerance; // 0x01EC
	int32 m_nMaxPlanes; // 0x01F0
	char[128] m_CollisionGroupName; // 0x01F8
	ParticleTraceSet_t m_nTraceSet; // 0x0278
	bool m_bIncludeWater; // 0x0288
};
class VecInputMaterialVariable_t // particles
{
	CUtlString m_strVariable; // 0x0000
	CParticleCollectionVecInput m_vecInput; // 0x0008
};
class CVMixDynamics3BandProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixDynamics3BandDesc_t m_desc; // 0x0020
};
class CVoiceContainerGenerator : public CVoiceContainerBase // soundsystem_voicecontainers
{
};
class VMixEnvelopeDesc_t // soundsystem_lowlevel
{
	float32 m_flAttackTimeMS; // 0x0000
	float32 m_flHoldTimeMS; // 0x0004
	float32 m_flReleaseTimeMS; // 0x0008
};
class CBodyGroupSetting // animgraphlib
{
	CUtlString m_BodyGroupName; // 0x0000
	int32 m_nBodyGroupOption; // 0x0008
};
class CNmTransitionEvent : public CNmEvent // animlib
{
	NmTransitionRule_t m_rule; // 0x0020
	CGlobalSymbol m_ID; // 0x0028
};
class CNmFloatCurveEvent : public CNmEvent // animlib
{
	CGlobalSymbol m_ID; // 0x0020
	CPiecewiseCurve m_curve; // 0x0028
};
class NmFloatCurveCompressionSettings_t // animlib
{
	NmCompressionSettings_t::QuantizationRange_t m_range; // 0x0000
	bool m_bIsStatic; // 0x0008
};
class ExternalAnimGraphHandle_t // server
{
	uint32 m_Value; // 0x0000
};
class CVMixBoxverbProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixBoxverbDesc_t m_desc; // 0x0020
};
class VMixPannerDesc_t // soundsystem_lowlevel
{
	VMixPannerType_t m_type; // 0x0000
	float32 m_flStrength; // 0x0004
};
class CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	CUtlString m_name; // 0x0008
	int32 m_nChannels; // 0x0014
	float32 m_flxfade; // 0x0018
};
class FeTreeChildren_t // physicslib
{
	uint16[2] nChild; // 0x0000
};
class FollowAttachmentData // animationsystem
{
	int32 m_boneIndex; // 0x0000
	AttachmentHandle_t m_attachmentHandle; // 0x0004
};
class CDirectPlaybackUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	bool m_bFinishEarly; // 0x0074
	bool m_bResetOnFinish; // 0x0075
	CUtlVector< CDirectPlaybackTagData > m_allTags; // 0x0078
};
class CSkillFloat // server
{
	float32[4] m_pValue; // 0x0000
};
class FeAntiTunnelProbeBuild_t // physicslib
{
	float32 flWeight; // 0x0000
	float32 flActivationDistance; // 0x0004
	float32 flBias; // 0x0008
	float32 flCurvature; // 0x000C
	uint32 nFlags; // 0x0010
	uint16 nProbeNode; // 0x0014
	CUtlVector< uint16 > targetNodes; // 0x0018
};
class PulseRuntimeVarIndex_t // pulse_runtime_lib
{
	int32 m_Value; // 0x0000
};
class CNmBitFlags // animlib
{
	uint32 m_flags; // 0x0000
};
class CNmTargetPointNode::CDefinition : public CNmVectorValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	bool m_bIsWorldSpaceTarget; // 0x0012
};
class VsInputSignature_t // rendersystemdx11
{
	CUtlVector< VsInputSignatureElement_t > m_elems; // 0x0000
	CUtlVector< VsInputSignatureElement_t > m_depth_elems; // 0x0018
};
class CInventoryImageData // client
{
	InventoryNodeType_t m_nNodeType; // 0x0000
	CUtlString name; // 0x0008
	inv_image_data_t inventory_image_data; // 0x0010
};
class locksound_t // server
{
	CUtlSymbolLarge sLockedSound; // 0x0008
	CUtlSymbolLarge sUnlockedSound; // 0x0010
	GameTime_t flwaitSound; // 0x0018
};
class C_OP_QuantizeFloat : public CParticleFunctionOperator // particles
{
	CPerParticleFloatInput m_InputValue; // 0x01D0
	ParticleAttributeIndex_t m_nOutputField; // 0x0340
};
class C_OP_BasicMovement : public CParticleFunctionOperator // particles
{
	CParticleCollectionVecInput m_Gravity; // 0x01D0
	CParticleCollectionFloatInput m_fDrag; // 0x0888
	CParticleMassCalculationParameters m_massControls; // 0x09F8
	int32 m_nMaxConstraintPasses; // 0x0E50
	bool m_bUseNewCode; // 0x0E54
};
class CAudioMorphData // soundsystem_voicecontainers
{
	CUtlVector< float32 > m_times; // 0x0000
	CUtlVector< uint32 > m_nameHashCodes; // 0x0018
	CUtlVector< CUtlString > m_nameStrings; // 0x0030
	CUtlVector< CUtlVector< float32 > > m_samples; // 0x0048
	float32 m_flEaseIn; // 0x0060
	float32 m_flEaseOut; // 0x0064
};
class CVMixUtilityProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixUtilityDesc_t m_desc; // 0x0020
};
class CVMixAdditionalOutput // soundsystem_lowlevel
{
	CUtlString m_name; // 0x0000
};
class CSosGroupActionLimitSchema : public CSosGroupActionSchema // soundsystem
{
	int32 m_nMaxCount; // 0x0008
	SosActionStopType_t m_nStopType; // 0x000C
	SosActionLimitSortType_t m_nSortType; // 0x0010
	bool m_bStopImmediate; // 0x0014
	bool m_bCountStopped; // 0x0015
};
class CPulse_Constant // pulse_runtime_lib
{
	CPulseValueFullType m_Type; // 0x0000
	KeyValues3 m_Value; // 0x0018
};
class EventServerBeginSimulate_t : public EventSimulate_t // engine2
{
};
class C_INIT_CreationNoise : public CParticleFunctionInitializer // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D8
	bool m_bAbsVal; // 0x01DC
	bool m_bAbsValInv; // 0x01DD
	float32 m_flOffset; // 0x01E0
	float32 m_flOutputMin; // 0x01E4
	float32 m_flOutputMax; // 0x01E8
	float32 m_flNoiseScale; // 0x01EC
	float32 m_flNoiseScaleLoc; // 0x01F0
	Vector m_vecOffsetLoc; // 0x01F4
	float32 m_flWorldTimeScale; // 0x0200
};
class C_INIT_CreateWithinBox : public CParticleFunctionInitializer // particles
{
	CPerParticleVecInput m_vecMin; // 0x01D8
	CPerParticleVecInput m_vecMax; // 0x0890
	int32 m_nControlPointNumber; // 0x0F48
	bool m_bLocalSpace; // 0x0F4C
	CRandomNumberGeneratorParameters m_randomnessParameters; // 0x0F50
	bool m_bUseNewCode; // 0x0F58
};
class CVMixPresetDSPProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixPresetDSPDesc_t m_desc; // 0x0020
};
class CSosGroupActionMemberCountEnvelopeSchema : public CSosGroupActionSchema // soundsystem
{
	int32 m_nBaseCount; // 0x0008
	int32 m_nTargetCount; // 0x000C
	float32 m_flBaseValue; // 0x0010
	float32 m_flTargetValue; // 0x0014
	float32 m_flAttack; // 0x0018
	float32 m_flDecay; // 0x001C
	CUtlString m_resultVarName; // 0x0020
	bool m_bSaveToGroup; // 0x0028
};
class CNmTransitionEventConditionNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	CGlobalSymbol m_requireRuleID; // 0x0010
	CNmBitFlags m_eventConditionRules; // 0x0018
	int16 m_nSourceStateNodeIdx; // 0x001C
	NmTransitionRuleCondition_t m_ruleCondition; // 0x001E
};
class ModelSkeletonData_t // modellib
{
	CUtlVector< CUtlString > m_boneName; // 0x0000
	CUtlVector< int16 > m_nParent; // 0x0018
	CUtlVector< float32 > m_boneSphere; // 0x0030
	CUtlVector< uint32 > m_nFlag; // 0x0048
	CUtlVector< Vector > m_bonePosParent; // 0x0060
	CUtlVector< QuaternionStorage > m_boneRotParent; // 0x0078
	CUtlVector< float32 > m_boneScaleParent; // 0x0090
};
class CNmConstBoolNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	bool m_bValue; // 0x0010
};
class CNmZeroPoseNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
};
class EventSimpleLoopFrameUpdate_t // engine2
{
	EngineLoopState_t m_LoopState; // 0x0000
	float32 m_flRealTime; // 0x0028
	float32 m_flFrameTime; // 0x002C
};
class CRR_Response // server
{
	uint8 m_Type; // 0x0000
	char[192] m_szResponseName; // 0x0001
	char[128] m_szMatchingRule; // 0x00C1
	ResponseParams m_Params; // 0x0160
	float32 m_fMatchScore; // 0x0180
	bool m_bAnyMatchingRulesInCooldown; // 0x0184
	char* m_szSpeakerContext; // 0x0188
	char* m_szWorldContext; // 0x0190
	ResponseFollowup m_Followup; // 0x0198
	CUtlSymbol m_recipientFilter; // 0x01CA
};
class C_OP_RemapScalarOnceTimed : public CParticleFunctionOperator // particles
{
	bool m_bProportional; // 0x01D0
	ParticleAttributeIndex_t m_nFieldInput; // 0x01D4
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D8
	float32 m_flInputMin; // 0x01DC
	float32 m_flInputMax; // 0x01E0
	float32 m_flOutputMin; // 0x01E4
	float32 m_flOutputMax; // 0x01E8
	float32 m_flRemapTime; // 0x01EC
};
class CNmEvent // animlib
{
	NmPercent_t m_flStartTime; // 0x0008
	NmPercent_t m_flDuration; // 0x000C
	CGlobalSymbol m_syncID; // 0x0010
	bool m_bClientOnly; // 0x0018
};
class ModelBoneFlexDriverControl_t // modellib
{
	ModelBoneFlexComponent_t m_nBoneComponent; // 0x0000
	CUtlString m_flexController; // 0x0008
	uint32 m_flexControllerToken; // 0x0010
	float32 m_flMin; // 0x0014
	float32 m_flMax; // 0x0018
};
class C_OP_OrientTo2dDirection : public CParticleFunctionOperator // particles
{
	float32 m_flRotOffset; // 0x01D0
	float32 m_flSpinStrength; // 0x01D4
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D8
};
class C_OP_VelocityMatchingForce : public CParticleFunctionOperator // particles
{
	float32 m_flDirScale; // 0x01D0
	float32 m_flSpdScale; // 0x01D4
	float32 m_flNeighborDistance; // 0x01D8
	float32 m_flFacingStrength; // 0x01DC
	bool m_bUseAABB; // 0x01E0
	int32 m_nCPBroadcast; // 0x01E4
};
class C_OP_LockPoints : public CParticleFunctionOperator // particles
{
	int32 m_nMinCol; // 0x01D0
	int32 m_nMaxCol; // 0x01D4
	int32 m_nMinRow; // 0x01D8
	int32 m_nMaxRow; // 0x01DC
	int32 m_nControlPoint; // 0x01E0
	float32 m_flBlendValue; // 0x01E4
};
class CPathAnimMotorUpdater : public CPathAnimMotorUpdaterBase // animgraphlib
{
};
class SummaryTakeDamageInfo_t // server
{
	int32 nSummarisedCount; // 0x0000
	CTakeDamageInfo info; // 0x0008
	CTakeDamageResult result; // 0x0128
	CHandle< CBaseEntity > hTarget; // 0x0158
};
class C_INIT_CreateOnModel : public CParticleFunctionInitializer // particles
{
	CParticleModelInput m_modelInput; // 0x01D8
	CParticleTransformInput m_transformInput; // 0x0238
	int32 m_nForceInModel; // 0x02A0
	bool m_bScaleToVolume; // 0x02A4
	bool m_bEvenDistribution; // 0x02A5
	CParticleCollectionFloatInput m_nDesiredHitbox; // 0x02A8
	int32 m_nHitboxValueFromControlPointIndex; // 0x0418
	CParticleCollectionVecInput m_vecHitBoxScale; // 0x0420
	float32 m_flBoneVelocity; // 0x0AD8
	float32 m_flMaxBoneVelocity; // 0x0ADC
	CParticleCollectionVecInput m_vecDirectionBias; // 0x0AE0
	char[128] m_HitboxSetName; // 0x1198
	bool m_bLocalCoords; // 0x1218
	bool m_bUseBones; // 0x1219
	bool m_bUseMesh; // 0x121A
	CParticleCollectionFloatInput m_flShellSize; // 0x1220
};
class C_OP_SetControlPointOrientationToCPVelocity : public CParticleFunctionPreEmission // particles
{
	int32 m_nCPInput; // 0x01D8
	int32 m_nCPOutput; // 0x01DC
};
class SteamAudioCustomDataDimensionsSettings_t // steamaudio
{
	int32 m_nAmbisonicsOrderOutsideField; // 0x0000
	int32 m_nAmbisonicsOrderInsideSizeField; // 0x0004
	float32 m_flOutsideThreshold; // 0x0008
	float32 m_flSizeThreshold; // 0x000C
	float32 m_flInsideThreshold; // 0x0010
};
class CSteamAudioBakedOcclusionData // steamaudio
{
	SteamAudioCustomDataOcclusionSettings_t m_settings; // 0x0000
	CSteamAudioProbeData m_probes; // 0x0010
	CUtlVector< float32 > m_vecPathingRatio; // 0x0018
	CUtlVector< float32 > m_vecPathingDeviation; // 0x0030
	CUtlVector< float32 > m_vecReflectionRatio; // 0x0048
};
class CTwoBoneIKUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	TwoBoneIKSettings_t m_opFixedData; // 0x0070
};
class CNmTarget // animlib
{
	CTransform m_transform; // 0x0000
	CGlobalSymbol m_boneID; // 0x0020
	bool m_bIsBoneTarget; // 0x0028
	bool m_bIsUsingBoneSpaceOffsets; // 0x0029
	bool m_bHasOffsets; // 0x002A
	bool m_bIsSet; // 0x002B
};
class CScriptUniformRandomStream // server
{
	HSCRIPT m_hScriptScope; // 0x0008
	int32 m_nInitialSeed; // 0x009C
};
class C_OP_SelectivelyEnableChildren : public CParticleFunctionPreEmission // particles
{
	CParticleCollectionFloatInput m_nChildGroupID; // 0x01D8
	CParticleCollectionFloatInput m_nFirstChild; // 0x0348
	CParticleCollectionFloatInput m_nNumChildrenToEnable; // 0x04B8
	bool m_bPlayEndcapOnStop; // 0x0628
	bool m_bDestroyImmediately; // 0x0629
};
class RnHalfEdge_t // physicslib
{
	uint8 m_nNext; // 0x0000
	uint8 m_nTwin; // 0x0001
	uint8 m_nOrigin; // 0x0002
	uint8 m_nFace; // 0x0003
};
class PulseGraphExecutionHistoryCursorDesc_t // pulse_runtime_lib
{
	CUtlVector< PulseCursorID_t > vecAncestorCursorIDs; // 0x0000
	PulseDocNodeID_t nSpawnNodeID; // 0x0018
	PulseDocNodeID_t nRetiredAtNodeID; // 0x001C
	float32 flLastReferenced; // 0x0020
	int32 nLastValidEntryIdx; // 0x0024
};
class CCompositeMaterialEditorDoc // compositematerialslib
{
	int32 m_nVersion; // 0x0008
	CUtlVector< CompositeMaterialEditorPoint_t > m_Points; // 0x0010
	KeyValues3 m_KVthumbnail; // 0x0028
};
class SoundOpvarTraceResult_t // server
{
	Vector vPos; // 0x0000
	bool bDidHit; // 0x000C
	float32 flDistSqrToCenter; // 0x0010
};
class C_OP_SetFromCPSnapshot : public CParticleFunctionOperator // particles
{
	int32 m_nControlPointNumber; // 0x01D0
	CUtlString m_strSnapshotSubset; // 0x01D8
	ParticleAttributeIndex_t m_nAttributeToRead; // 0x01E0
	ParticleAttributeIndex_t m_nAttributeToWrite; // 0x01E4
	int32 m_nLocalSpaceCP; // 0x01E8
	bool m_bRandom; // 0x01EC
	bool m_bReverse; // 0x01ED
	int32 m_nRandomSeed; // 0x01F0
	CParticleCollectionFloatInput m_nSnapShotStartPoint; // 0x01F8
	CParticleCollectionFloatInput m_nSnapShotIncrement; // 0x0368
	CPerParticleFloatInput m_flInterpolation; // 0x04D8
	bool m_bSubSample; // 0x0648
	bool m_bPrev; // 0x0649
};
class C_OP_ClampVector : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	CPerParticleVecInput m_vecOutputMin; // 0x01D8
	CPerParticleVecInput m_vecOutputMax; // 0x0890
};
class C_OP_RemapDensityToVector : public CParticleFunctionOperator // particles
{
	float32 m_flRadiusScale; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	float32 m_flDensityMin; // 0x01D8
	float32 m_flDensityMax; // 0x01DC
	Vector m_vecOutputMin; // 0x01E0
	Vector m_vecOutputMax; // 0x01EC
	bool m_bUseParentDensity; // 0x01F8
	int32 m_nVoxelGridResolution; // 0x01FC
};
class CTakeDamageInfo // server
{
	Vector m_vecDamageForce; // 0x0008
	VectorWS m_vecDamagePosition; // 0x0014
	VectorWS m_vecReportedPosition; // 0x0020
	Vector m_vecDamageDirection; // 0x002C
	CHandle< CBaseEntity > m_hInflictor; // 0x0038
	CHandle< CBaseEntity > m_hAttacker; // 0x003C
	CHandle< CBaseEntity > m_hAbility; // 0x0040
	float32 m_flDamage; // 0x0044
	float32 m_flTotalledDamage; // 0x0048
	DamageTypes_t m_bitsDamageType; // 0x004C
	int32 m_iDamageCustom; // 0x0050
	AmmoIndex_t m_iAmmoType; // 0x0054
	float32 m_flOriginalDamage; // 0x0060
	bool m_bShouldBleed; // 0x0064
	bool m_bShouldSpark; // 0x0065
	TakeDamageFlags_t m_nDamageFlags; // 0x0070
	HitGroup_t m_iHitGroupId; // 0x0078
	int32 m_nNumObjectsPenetrated; // 0x007C
	float32 m_flFriendlyFireDamageReductionRatio; // 0x0080
	bool m_bStoppedBullet; // 0x0084
	CUtlVector< DestructibleHitGroupToDestroy_t > m_nDestructibleHitGroupsToForceDestroy; // 0x0100
	bool m_bInTakeDamageFlow; // 0x0118
};
class C_INIT_DistanceCull : public CParticleFunctionInitializer // particles
{
	int32 m_nControlPoint; // 0x01D8
	CParticleCollectionFloatInput m_flDistance; // 0x01E0
	bool m_bCullInside; // 0x0350
};
class C_INIT_RemapTransformOrientationToRotations : public CParticleFunctionInitializer // particles
{
	CParticleTransformInput m_TransformInput; // 0x01D8
	Vector m_vecRotation; // 0x0240
	bool m_bUseQuat; // 0x024C
	bool m_bWriteNormal; // 0x024D
};
class C_INIT_CreateInEpitrochoid : public CParticleFunctionInitializer // particles
{
	int32 m_nComponent1; // 0x01D8
	int32 m_nComponent2; // 0x01DC
	CParticleTransformInput m_TransformInput; // 0x01E0
	CPerParticleFloatInput m_flParticleDensity; // 0x0248
	CPerParticleFloatInput m_flOffset; // 0x03B8
	CPerParticleFloatInput m_flRadius1; // 0x0528
	CPerParticleFloatInput m_flRadius2; // 0x0698
	bool m_bUseCount; // 0x0808
	bool m_bUseLocalCoords; // 0x0809
	bool m_bOffsetExistingPos; // 0x080A
};
class C_OP_SetControlPointPositions : public CParticleFunctionPreEmission // particles
{
	bool m_bUseWorldLocation; // 0x01D8
	bool m_bOrient; // 0x01D9
	bool m_bSetOnce; // 0x01DA
	int32 m_nCP1; // 0x01DC
	int32 m_nCP2; // 0x01E0
	int32 m_nCP3; // 0x01E4
	int32 m_nCP4; // 0x01E8
	Vector m_vecCP1Pos; // 0x01EC
	Vector m_vecCP2Pos; // 0x01F8
	Vector m_vecCP3Pos; // 0x0204
	Vector m_vecCP4Pos; // 0x0210
	int32 m_nHeadLocation; // 0x021C
};
class CSosGroupActionSetSoundeventParameterSchema : public CSosGroupActionSchema // soundsystem
{
	int32 m_nMaxCount; // 0x0008
	float32 m_flMinValue; // 0x000C
	float32 m_flMaxValue; // 0x0010
	CUtlString m_opvarName; // 0x0018
	SosActionSetParamSortType_t m_nSortType; // 0x0020
};
class CVoiceContainerNull : public CVoiceContainerGenerator // soundsystem_voicecontainers
{
};
class AnimScriptHandle // modellib
{
	uint32 m_id; // 0x0000
};
class CNmOrNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	CUtlLeanVectorFixedGrowable< int16, 4 > m_conditionNodeIndices; // 0x0010
};
class InfoForResourceTypeCResourceManifestInternal // resourcefile
{
};
class CollisionDetailLayerInfo_t // physicslib
{
	CUtlString m_sDescription; // 0x0000
	CUtlString m_sFriendlyName; // 0x0008
	bool m_bIsQueryOnly; // 0x0010
	CUtlString m_sParentDetailLayer; // 0x0018
	CUtlVector< CollisionDetailLayerInfo_t::Name_t > m_vecSubtreeDetailLayers; // 0x0020
	bool m_bNotPickable; // 0x0038
};
class CAnimEncodedFrames // animationsystem
{
	CBufferString m_fileName; // 0x0000
	int32 m_nFrames; // 0x0010
	int32 m_nFramesPerBlock; // 0x0014
	CUtlVector< CAnimFrameBlockAnim > m_frameblockArray; // 0x0018
	CAnimEncodeDifference m_usageDifferences; // 0x0030
};
class VPhysXConstraint2_t // modellib
{
	uint32 m_nFlags; // 0x0000
	uint16 m_nParent; // 0x0004
	uint16 m_nChild; // 0x0006
	VPhysXConstraintParams_t m_params; // 0x0008
};
class CNmBlend2DNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
	CUtlVectorFixedGrowable< int16, 5 > m_sourceNodeIndices; // 0x0010
	int16 m_nInputParameterNodeIdx0; // 0x0038
	int16 m_nInputParameterNodeIdx1; // 0x003A
	CUtlVectorFixedGrowable< Vector2D, 10 > m_values; // 0x0040
	CUtlVectorFixedGrowable< uint8, 30 > m_indices; // 0x00A8
	CUtlVectorFixedGrowable< uint8, 10 > m_hullIndices; // 0x00E0
	bool m_bAllowLooping; // 0x0108
};
class CWarpSectionAnimTagBase : public CAnimTagBase // animgraphlib
{
};
class EventClientSceneSystemThreadStateChange_t // engine2
{
	bool m_bThreadsActive; // 0x0000
};
class CEmptyEntityInstance // entity2
{
};
class C_OP_RemapDotProductToCP : public CParticleFunctionPreEmission // particles
{
	int32 m_nInputCP1; // 0x01D8
	int32 m_nInputCP2; // 0x01DC
	int32 m_nOutputCP; // 0x01E0
	int32 m_nOutVectorField; // 0x01E4
	CParticleCollectionFloatInput m_flInputMin; // 0x01E8
	CParticleCollectionFloatInput m_flInputMax; // 0x0358
	CParticleCollectionFloatInput m_flOutputMin; // 0x04C8
	CParticleCollectionFloatInput m_flOutputMax; // 0x0638
};
class C_INIT_CreateFromParentParticles : public CParticleFunctionInitializer // particles
{
	float32 m_flVelocityScale; // 0x01D8
	float32 m_flIncrement; // 0x01DC
	bool m_bRandomDistribution; // 0x01E0
	int32 m_nRandomSeed; // 0x01E4
	bool m_bSubFrame; // 0x01E8
	bool m_bSetRopeSegmentID; // 0x01E9
};
class C_OP_IntraParticleForce : public CParticleFunctionForce // particles
{
	float32 m_flAttractionMinDistance; // 0x01E0
	float32 m_flAttractionMaxDistance; // 0x01E4
	float32 m_flAttractionMaxStrength; // 0x01E8
	float32 m_flRepulsionMinDistance; // 0x01EC
	float32 m_flRepulsionMaxDistance; // 0x01F0
	float32 m_flRepulsionMaxStrength; // 0x01F4
	bool m_bUseAABB; // 0x01F8
};
class CVMixFilterProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixFilterDesc_t m_desc; // 0x0020
};
class FeHingeLimitBuild_t // physicslib
{
	uint16[6] nNode; // 0x0000
	uint32 nFlags; // 0x000C
	float32 flLimitCW; // 0x0010
	float32 flLimitCCW; // 0x0014
};
class CNmIDEventPercentageThroughNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nSourceStateNodeIdx; // 0x0010
	CNmBitFlags m_eventConditionRules; // 0x0014
	CGlobalSymbol m_eventID; // 0x0018
};
class CNmControlParameterBoolNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
};
class EventPreDataUpdate_t // engine2
{
	int32 m_nCount; // 0x0000
};
class CDSPPresetMixgroupModifierTable // soundsystem
{
	CUtlVector< CDspPresetModifierList > m_table; // 0x0000
};
class VMixEffectChainDesc_t // soundsystem_lowlevel
{
	CUtlString m_effectName; // 0x0000
};
class HitReactFixedSettings_t // animgraphlib
{
	int32 m_nWeightListIndex; // 0x0000
	int32 m_nEffectedBoneCount; // 0x0004
	float32 m_flMaxImpactForce; // 0x0008
	float32 m_flMinImpactForce; // 0x000C
	float32 m_flWhipImpactScale; // 0x0010
	float32 m_flCounterRotationScale; // 0x0014
	float32 m_flDistanceFadeScale; // 0x0018
	float32 m_flPropagationScale; // 0x001C
	float32 m_flWhipDelay; // 0x0020
	float32 m_flSpringStrength; // 0x0024
	float32 m_flWhipSpringStrength; // 0x0028
	float32 m_flMaxAngleRadians; // 0x002C
	int32 m_nHipBoneIndex; // 0x0030
	float32 m_flHipBoneTranslationScale; // 0x0034
	float32 m_flHipDipSpringStrength; // 0x0038
	float32 m_flHipDipImpactScale; // 0x003C
	float32 m_flHipDipDelay; // 0x0040
};
class CNmParameterizedBlendNode::Parameterization_t // animlib
{
	CUtlLeanVectorFixedGrowable< CNmParameterizedBlendNode::BlendRange_t, 5 > m_blendRanges; // 0x0000
	Range_t m_parameterRange; // 0x0048
};
class CPhysSurfacePropertiesAudio // modellib
{
	float32 m_reflectivity; // 0x0000
	float32 m_hardnessFactor; // 0x0004
	float32 m_roughnessFactor; // 0x0008
	float32 m_roughThreshold; // 0x000C
	float32 m_hardThreshold; // 0x0010
	float32 m_hardVelocityThreshold; // 0x0014
	float32 m_flStaticImpactVolume; // 0x0018
	float32 m_flOcclusionFactor; // 0x001C
};
class ParticlePreviewBodyGroup_t // particles
{
	CUtlString m_bodyGroupName; // 0x0000
	int32 m_nValue; // 0x0008
};
class C_OP_GlobalLight : public CParticleFunctionOperator // particles
{
	float32 m_flScale; // 0x01D0
	bool m_bClampLowerRange; // 0x01D4
	bool m_bClampUpperRange; // 0x01D5
};
class C_INIT_RandomSequence : public CParticleFunctionInitializer // particles
{
	int32 m_nSequenceMin; // 0x01D8
	int32 m_nSequenceMax; // 0x01DC
	bool m_bShuffle; // 0x01E0
	bool m_bLinear; // 0x01E1
	CUtlVector< SequenceWeightedList_t > m_WeightedList; // 0x01E8
};
class C_INIT_CreateFromCPs : public CParticleFunctionInitializer // particles
{
	int32 m_nIncrement; // 0x01D8
	int32 m_nMinCP; // 0x01DC
	int32 m_nMaxCP; // 0x01E0
	CParticleCollectionFloatInput m_nDynamicCPCount; // 0x01E8
};
class CSosGroupActionSchema // soundsystem
{
};
class FeFollowNode_t // physicslib
{
	uint16 nParentNode; // 0x0000
	uint16 nChildNode; // 0x0002
	float32 flWeight; // 0x0004
};
class CAnimParamHandle // animgraphlib
{
	AnimParamType_t m_type; // 0x0000
	uint8 m_index; // 0x0001
};
class CSmoothFunc // server
{
	float32 m_flSmoothAmplitude; // 0x0008
	float32 m_flSmoothBias; // 0x000C
	float32 m_flSmoothDuration; // 0x0010
	float32 m_flSmoothRemainingTime; // 0x0014
	int32 m_nSmoothDir; // 0x0018
};
class C_OP_MovementMoveAlongSkinnedCPSnapshot : public CParticleFunctionOperator // particles
{
	int32 m_nControlPointNumber; // 0x01D0
	int32 m_nSnapshotControlPointNumber; // 0x01D4
	bool m_bSetNormal; // 0x01D8
	bool m_bSetRadius; // 0x01D9
	CPerParticleFloatInput m_flInterpolation; // 0x01E0
	CPerParticleFloatInput m_flTValue; // 0x0350
};
class SteamAudioReverbSettings_t // steamaudio
{
	int32 m_nNumRays; // 0x0000
	int32 m_nNumBounces; // 0x0004
	float32 m_flIRDuration; // 0x0008
	int32 m_nAmbisonicsOrder; // 0x000C
};
class CEntityAttributeTable // entity2
{
	CUtlOrderedMap< CUtlStringToken, Attribute_t > m_Attributes; // 0x0000
	CUtlOrderedMap< CUtlStringToken, CUtlString > m_Names; // 0x0028
};
class CFiringModeFloat // server
{
	float32[2] m_flValues; // 0x0000
};
class C_OP_RemapCPtoVector : public CParticleFunctionOperator // particles
{
	int32 m_nCPInput; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	int32 m_nLocalSpaceCP; // 0x01D8
	Vector m_vInputMin; // 0x01DC
	Vector m_vInputMax; // 0x01E8
	Vector m_vOutputMin; // 0x01F4
	Vector m_vOutputMax; // 0x0200
	float32 m_flStartTime; // 0x020C
	float32 m_flEndTime; // 0x0210
	float32 m_flInterpRate; // 0x0214
	ParticleSetMethod_t m_nSetMethod; // 0x0218
	bool m_bOffset; // 0x021C
	bool m_bAccelerate; // 0x021D
};
class CSeqMultiFetchFlag // animationsystem
{
	bool m_bRealtime; // 0x0000
	bool m_bCylepose; // 0x0001
	bool m_b0D; // 0x0002
	bool m_b1D; // 0x0003
	bool m_b2D; // 0x0004
	bool m_b2D_TRI; // 0x0005
};
class CNmParticleEvent : public CNmEvent // animlib
{
	CNmEventRelevance_t m_relevance; // 0x0020
	CNmParticleEvent::Type_t m_type; // 0x0024
	CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_hParticleSystem; // 0x0028
	CUtlString m_tags; // 0x0030
	bool m_bStopImmediately; // 0x0038
	bool m_bDetachFromOwner; // 0x0039
	bool m_bPlayEndCap; // 0x003A
	CUtlString m_attachmentPoint0; // 0x0040
	ParticleAttachment_t m_attachmentType0; // 0x0048
	CUtlString m_attachmentPoint1; // 0x0050
	ParticleAttachment_t m_attachmentType1; // 0x0058
	CUtlString m_config; // 0x0060
	CUtlString m_effectForConfig; // 0x0068
};
class CNmSyncTrack::Event_t // animlib
{
	CGlobalSymbol m_ID; // 0x0000
	NmPercent_t m_startTime; // 0x0008
	NmPercent_t m_duration; // 0x000C
};
class InfoForResourceTypeCVSoundEventScriptList // resourcesystem
{
};
class lerpdata_t // server
{
	CHandle< CBaseEntity > m_hEnt; // 0x0000
	MoveType_t m_MoveType; // 0x0004
	GameTime_t m_flStartTime; // 0x0008
	Vector m_vecStartOrigin; // 0x000C
	Quaternion m_qStartRot; // 0x0020
	ParticleIndex_t m_nFXIndex; // 0x0030
};
class C_OP_LerpScalar : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	CPerParticleFloatInput m_flOutput; // 0x01D8
	float32 m_flStartTime; // 0x0348
	float32 m_flEndTime; // 0x034C
};
class C_OP_RenderModels : public CParticleFunctionRenderer // particles
{
	bool m_bOnlyRenderInEffectsBloomPass; // 0x0220
	bool m_bOnlyRenderInEffectsWaterPass; // 0x0221
	bool m_bUseMixedResolutionRendering; // 0x0222
	bool m_bOnlyRenderInEffecsGameOverlay; // 0x0223
	CUtlVector< ModelReference_t > m_ModelList; // 0x0228
	ParticleAttributeIndex_t m_nBodyGroupField; // 0x0240
	ParticleAttributeIndex_t m_nSubModelField; // 0x0244
	bool m_bIgnoreNormal; // 0x0248
	bool m_bOrientZ; // 0x0249
	bool m_bCenterOffset; // 0x024A
	CPerParticleVecInput m_vecLocalOffset; // 0x0250
	CPerParticleVecInput m_vecLocalRotation; // 0x0908
	bool m_bIgnoreRadius; // 0x0FC0
	int32 m_nModelScaleCP; // 0x0FC4
	CPerParticleVecInput m_vecComponentScale; // 0x0FC8
	bool m_bLocalScale; // 0x1680
	int32 m_nSizeCullBloat; // 0x1684
	bool m_bAnimated; // 0x1688
	CPerParticleFloatInput m_flAnimationRate; // 0x1690
	bool m_bScaleAnimationRate; // 0x1800
	bool m_bForceLoopingAnimation; // 0x1801
	bool m_bResetAnimOnStop; // 0x1802
	bool m_bManualAnimFrame; // 0x1803
	ParticleAttributeIndex_t m_nAnimationScaleField; // 0x1804
	ParticleAttributeIndex_t m_nAnimationField; // 0x1808
	ParticleAttributeIndex_t m_nManualFrameField; // 0x180C
	char[256] m_ActivityName; // 0x1810
	char[256] m_SequenceName; // 0x1910
	bool m_bEnableClothSimulation; // 0x1A10
	char[64] m_ClothEffectName; // 0x1A11
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hOverrideMaterial; // 0x1A58
	bool m_bOverrideTranslucentMaterials; // 0x1A60
	CPerParticleFloatInput m_nSkin; // 0x1A68
	CUtlVector< MaterialVariable_t > m_MaterialVars; // 0x1BD8
	CPerParticleFloatInput m_flRenderFilter; // 0x1BF0
	CPerParticleFloatInput m_flManualModelSelection; // 0x1D60
	CParticleModelInput m_modelInput; // 0x1ED0
	int32 m_nLOD; // 0x1F30
	char[256] m_EconSlotName; // 0x1F34
	bool m_bOriginalModel; // 0x2034
	bool m_bSuppressTint; // 0x2035
	RenderModelSubModelFieldType_t m_nSubModelFieldType; // 0x2038
	bool m_bDisableShadows; // 0x203C
	bool m_bDisableDepthPrepass; // 0x203D
	bool m_bAcceptsDecals; // 0x203E
	bool m_bForceDrawInterlevedWithSiblings; // 0x203F
	bool m_bDoNotDrawInParticlePass; // 0x2040
	bool m_bAllowApproximateTransforms; // 0x2041
	char[260] m_szRenderAttribute; // 0x2042
	CParticleCollectionFloatInput m_flRadiusScale; // 0x2148
	CParticleCollectionFloatInput m_flAlphaScale; // 0x22B8
	CParticleCollectionFloatInput m_flRollScale; // 0x2428
	ParticleAttributeIndex_t m_nAlpha2Field; // 0x2598
	CParticleCollectionVecInput m_vecColorScale; // 0x25A0
	ParticleColorBlendType_t m_nColorBlendType; // 0x2C58
};
class FeSimdSpringIntegrator_t // physicslib
{
	uint16[4][2] nNode; // 0x0000
	fltx4 flSpringRestLength; // 0x0010
	fltx4 flSpringConstant; // 0x0020
	fltx4 flSpringDamping; // 0x0030
	fltx4 flNodeWeight0; // 0x0040
};
class CParticleModelInput : public CParticleInput // particleslib
{
	ParticleModelType_t m_nType; // 0x0010
	CParticleNamedValueRef m_NamedValue; // 0x0018
	int32 m_nControlPoint; // 0x0058
};
class CHitBoxSetList // modellib
{
	CUtlVector< CHitBoxSet > m_HitBoxSets; // 0x0000
};
class CNmIKEffector // animlib
{
	int32 m_nBodyIndex; // 0x0000
	bool m_bEnabled; // 0x0004
	Vector m_vTargetPosition; // 0x0008
	Quaternion m_qTargetOrientation; // 0x0020
	float32 m_flWeight; // 0x0030
};
class CNmExternalPoseNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
	bool m_bShouldSampleRootMotion; // 0x0010
};
class ModelEmbeddedMesh_t // modellib
{
	CUtlString m_Name; // 0x0000
	int32 m_nMeshIndex; // 0x0010
	int32 m_nDataBlock; // 0x0014
	int32 m_nMorphBlock; // 0x0018
	CUtlVector< ModelMeshBufferData_t > m_vertexBuffers; // 0x0020
	CUtlVector< ModelMeshBufferData_t > m_indexBuffers; // 0x0038
	CUtlVector< ModelMeshBufferData_t > m_toolsBuffers; // 0x0050
	int32 m_nVBIBBlock; // 0x0068
	int32 m_nToolsVBBlock; // 0x006C
};
class CNavVolumeSphere : public CNavVolume // navlib
{
	Vector m_vCenter; // 0x0078
	float32 m_flRadius; // 0x0084
};
class C_INIT_InitialRepulsionVelocity : public CParticleFunctionInitializer // particles
{
	char[128] m_CollisionGroupName; // 0x01D8
	ParticleTraceSet_t m_nTraceSet; // 0x0258
	Vector m_vecOutputMin; // 0x025C
	Vector m_vecOutputMax; // 0x0268
	int32 m_nControlPointNumber; // 0x0274
	bool m_bPerParticle; // 0x0278
	bool m_bTranslate; // 0x0279
	bool m_bProportional; // 0x027A
	float32 m_flTraceLength; // 0x027C
	bool m_bPerParticleTR; // 0x0280
	bool m_bInherit; // 0x0281
	int32 m_nChildCP; // 0x0284
	int32 m_nChildGroupID; // 0x0288
};
class C_INIT_InitialVelocityFromHitbox : public CParticleFunctionInitializer // particles
{
	float32 m_flVelocityMin; // 0x01D8
	float32 m_flVelocityMax; // 0x01DC
	int32 m_nControlPointNumber; // 0x01E0
	char[128] m_HitboxSetName; // 0x01E4
	bool m_bUseBones; // 0x0264
};
class C_INIT_RemapNamedModelBodyPartToScalar : public C_INIT_RemapNamedModelElementToScalar // particles
{
};
class CNmScaleTask : public CNmPoseTask // animlib
{
};
class CMotionGraphConfig // animgraphlib
{
	float32[4] m_paramValues; // 0x0000
	float32 m_flDuration; // 0x0010
	MotionIndex m_nMotionIndex; // 0x0014
	int32 m_nSampleStart; // 0x0018
	int32 m_nSampleCount; // 0x001C
};
class CAnimGraphSettingsManager // animgraphlib
{
	CUtlVector< CSmartPtr< CAnimGraphSettingsGroup > > m_settingsGroups; // 0x0018
};
class EngineLoopState_t // engine2
{
	int32 m_nPlatWindowWidth; // 0x0018
	int32 m_nPlatWindowHeight; // 0x001C
	int32 m_nRenderWidth; // 0x0020
	int32 m_nRenderHeight; // 0x0024
};
class C_INIT_StatusEffect : public CParticleFunctionInitializer // particles
{
	Detail2Combo_t m_nDetail2Combo; // 0x01D8
	float32 m_flDetail2Rotation; // 0x01DC
	float32 m_flDetail2Scale; // 0x01E0
	float32 m_flDetail2BlendFactor; // 0x01E4
	float32 m_flColorWarpIntensity; // 0x01E8
	float32 m_flDiffuseWarpBlendToFull; // 0x01EC
	float32 m_flEnvMapIntensity; // 0x01F0
	float32 m_flAmbientScale; // 0x01F4
	Color m_specularColor; // 0x01F8
	float32 m_flSpecularScale; // 0x01FC
	float32 m_flSpecularExponent; // 0x0200
	float32 m_flSpecularExponentBlendToFull; // 0x0204
	float32 m_flSpecularBlendToFull; // 0x0208
	Color m_rimLightColor; // 0x020C
	float32 m_flRimLightScale; // 0x0210
	float32 m_flReflectionsTintByBaseBlendToNone; // 0x0214
	float32 m_flMetalnessBlendToFull; // 0x0218
	float32 m_flSelfIllumBlendToFull; // 0x021C
};
class C_OP_ColorInterpolate : public CParticleFunctionOperator // particles
{
	Color m_ColorFade; // 0x01D0
	float32 m_flFadeStartTime; // 0x01E0
	float32 m_flFadeEndTime; // 0x01E4
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01E8
	bool m_bEaseInOut; // 0x01EC
};
class C_OP_WindForce : public CParticleFunctionForce // particles
{
	Vector m_vForce; // 0x01E0
};
class CVoiceContainerRandomSampler : public CVoiceContainerAsyncGenerator // soundsystem_voicecontainers
{
	float32 m_flAmplitude; // 0x00B8
	float32 m_flAmplitudeJitter; // 0x00BC
	float32 m_flTimeJitter; // 0x00C0
	float32 m_flMaxLength; // 0x00C4
	int32 m_nNumDelayVariations; // 0x00C8
	CUtlVector< CStrongHandle< InfoForResourceTypeCVoiceContainerBase > > m_grainResources; // 0x00D0
};
class CVoiceContainerRealtimeFMSineWave : public CVoiceContainerGenerator // soundsystem_voicecontainers
{
	float32 m_flCarrierFrequency; // 0x00A8
	float32 m_flModulatorFrequency; // 0x00AC
	float32 m_flModulatorAmount; // 0x00B0
};
class VPhysXConstraintParams_t // modellib
{
	int8 m_nType; // 0x0000
	int8 m_nTranslateMotion; // 0x0001
	int8 m_nRotateMotion; // 0x0002
	int8 m_nFlags; // 0x0003
	Vector[2] m_anchor; // 0x0004
	QuaternionStorage[2] m_axes; // 0x001C
	float32 m_maxForce; // 0x003C
	float32 m_maxTorque; // 0x0040
	float32 m_linearLimitValue; // 0x0044
	float32 m_linearLimitRestitution; // 0x0048
	float32 m_linearLimitSpring; // 0x004C
	float32 m_linearLimitDamping; // 0x0050
	float32 m_twistLowLimitValue; // 0x0054
	float32 m_twistLowLimitRestitution; // 0x0058
	float32 m_twistLowLimitSpring; // 0x005C
	float32 m_twistLowLimitDamping; // 0x0060
	float32 m_twistHighLimitValue; // 0x0064
	float32 m_twistHighLimitRestitution; // 0x0068
	float32 m_twistHighLimitSpring; // 0x006C
	float32 m_twistHighLimitDamping; // 0x0070
	float32 m_swing1LimitValue; // 0x0074
	float32 m_swing1LimitRestitution; // 0x0078
	float32 m_swing1LimitSpring; // 0x007C
	float32 m_swing1LimitDamping; // 0x0080
	float32 m_swing2LimitValue; // 0x0084
	float32 m_swing2LimitRestitution; // 0x0088
	float32 m_swing2LimitSpring; // 0x008C
	float32 m_swing2LimitDamping; // 0x0090
	Vector m_goalPosition; // 0x0094
	QuaternionStorage m_goalOrientation; // 0x00A0
	Vector m_goalAngularVelocity; // 0x00B0
	float32 m_driveSpringX; // 0x00BC
	float32 m_driveSpringY; // 0x00C0
	float32 m_driveSpringZ; // 0x00C4
	float32 m_driveDampingX; // 0x00C8
	float32 m_driveDampingY; // 0x00CC
	float32 m_driveDampingZ; // 0x00D0
	float32 m_driveSpringTwist; // 0x00D4
	float32 m_driveSpringSwing; // 0x00D8
	float32 m_driveSpringSlerp; // 0x00DC
	float32 m_driveDampingTwist; // 0x00E0
	float32 m_driveDampingSwing; // 0x00E4
	float32 m_driveDampingSlerp; // 0x00E8
	int32 m_solverIterationCount; // 0x00EC
	float32 m_projectionLinearTolerance; // 0x00F0
	float32 m_projectionAngularTolerance; // 0x00F4
};
class CPulseRuntimeMethodArg // pulse_runtime_lib
{
	CKV3MemberNameWithStorage m_Name; // 0x0000
	CUtlString m_Description; // 0x0038
	CPulseValueFullType m_Type; // 0x0040
};
class ManifestTestResource_t // resourcesystem
{
	CUtlString m_name; // 0x0000
	CStrongHandle< InfoForResourceTypeManifestTestResource_t > m_child; // 0x0008
};
class C_OP_DifferencePreviousParticle : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldInput; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	float32 m_flInputMin; // 0x01D8
	float32 m_flInputMax; // 0x01DC
	float32 m_flOutputMin; // 0x01E0
	float32 m_flOutputMax; // 0x01E4
	ParticleSetMethod_t m_nSetMethod; // 0x01E8
	bool m_bActiveRange; // 0x01EC
	bool m_bSetPreviousParticle; // 0x01ED
};
class C_OP_RemapDirectionToCPToVector : public CParticleFunctionOperator // particles
{
	int32 m_nCP; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	float32 m_flScale; // 0x01D8
	float32 m_flOffsetRot; // 0x01DC
	Vector m_vecOffsetAxis; // 0x01E0
	bool m_bNormalize; // 0x01EC
	ParticleAttributeIndex_t m_nFieldStrength; // 0x01F0
};
class C_INIT_DistanceToCPInit : public CParticleFunctionInitializer // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D8
	CPerParticleFloatInput m_flInputMin; // 0x01E0
	CPerParticleFloatInput m_flInputMax; // 0x0350
	CPerParticleFloatInput m_flOutputMin; // 0x04C0
	CPerParticleFloatInput m_flOutputMax; // 0x0630
	int32 m_nStartCP; // 0x07A0
	bool m_bLOS; // 0x07A4
	char[128] m_CollisionGroupName; // 0x07A5
	ParticleTraceSet_t m_nTraceSet; // 0x0828
	CPerParticleFloatInput m_flMaxTraceLength; // 0x0830
	float32 m_flLOSScale; // 0x09A0
	ParticleSetMethod_t m_nSetMethod; // 0x09A4
	bool m_bActiveRange; // 0x09A8
	Vector m_vecDistanceScale; // 0x09AC
	float32 m_flRemapBias; // 0x09B8
};
class CSteamAudioBakedDimensionsData // steamaudio
{
	SteamAudioCustomDataDimensionsSettings_t m_settings; // 0x0000
	CSteamAudioProbeData m_probes; // 0x0018
	CUtlVector< float32 > m_vecInOut; // 0x0020
	CUtlVector< float32 > m_vecSize; // 0x0038
	CUtlVector< CSteamAudioAmbisonicsField > m_vecOutsideField; // 0x0050
	CUtlVector< CSteamAudioAmbisonicsField > m_vecInsideSmallSizeField; // 0x0068
	CSteamAudioMovableBakedData< CSteamAudioBakedDimensionsData > m_movables; // 0x0080
};
class VMixPlateverbDesc_t // soundsystem_lowlevel
{
	float32 m_flPrefilter; // 0x0000
	float32 m_flInputDiffusion1; // 0x0004
	float32 m_flInputDiffusion2; // 0x0008
	float32 m_flDecay; // 0x000C
	float32 m_flDamp; // 0x0010
	float32 m_flFeedbackDiffusion1; // 0x0014
	float32 m_flFeedbackDiffusion2; // 0x0018
};
class RnBlendVertex_t // physicslib
{
	uint16 m_nWeight0; // 0x0000
	uint16 m_nIndex0; // 0x0002
	uint16 m_nWeight1; // 0x0004
	uint16 m_nIndex1; // 0x0006
	uint16 m_nWeight2; // 0x0008
	uint16 m_nIndex2; // 0x000A
	uint16 m_nFlags; // 0x000C
	uint16 m_nTargetIndex; // 0x000E
};
class CSequenceUpdateNodeBase : public CLeafUpdateNode // animgraphlib
{
	float32 m_playbackSpeed; // 0x006C
	bool m_bLoop; // 0x0070
};
class PulseGraphExecutionHistoryNodeDesc_t // pulse_runtime_lib
{
	CBufferString strCellDesc; // 0x0000
	PulseSymbol_t strBindingName; // 0x0010
};
class InfoForResourceTypeCVDataResource // resourcesystem
{
};
class FloatInputMaterialVariable_t // particles
{
	CUtlString m_strVariable; // 0x0000
	CParticleCollectionFloatInput m_flInput; // 0x0008
};
class MaterialOverride_t : public BaseSceneObjectOverride_t // worldrenderer
{
	uint32 m_nSubSceneObject; // 0x0004
	uint32 m_nDrawCallIndex; // 0x0008
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_pMaterial; // 0x0010
	Vector m_vLinearTintColor; // 0x0018
};
class CNmReferencePoseTask : public CNmPoseTask // animlib
{
};
class CSymbolAnimParameter : public CConcreteAnimParameter // animgraphlib
{
	CGlobalSymbol m_defaultValue; // 0x0080
};
class PARTICLE_EHANDLE__ // particleslib
{
	int32 unused; // 0x0000
};
class PostProcessingResource_t // materialsystem2
{
	bool m_bHasTonemapParams; // 0x0000
	PostProcessingTonemapParameters_t m_toneMapParams; // 0x0004
	bool m_bHasBloomParams; // 0x0040
	PostProcessingBloomParameters_t m_bloomParams; // 0x0044
	bool m_bHasVignetteParams; // 0x00CC
	PostProcessingVignetteParameters_t m_vignetteParams; // 0x00D0
	bool m_bHasLocalContrastParams; // 0x00F4
	PostProcessingLocalContrastParameters_t m_localConstrastParams; // 0x00F8
	int32 m_nColorCorrectionVolumeDim; // 0x010C
	CUtlBinaryBlock m_colorCorrectionVolumeData; // 0x0110
	bool m_bHasColorCorrection; // 0x0120
	bool m_bHasFogScatteringParams; // 0x0121
	PostProcessingFogScatteringParameters_t m_fogScatteringParams; // 0x0124
};
class C_INIT_RandomVector : public CParticleFunctionInitializer // particles
{
	Vector m_vecMin; // 0x01D8
	Vector m_vecMax; // 0x01E4
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01F0
	CRandomNumberGeneratorParameters m_randomnessParameters; // 0x01F4
};
class C_OP_TimeVaryingForce : public CParticleFunctionForce // particles
{
	float32 m_flStartLerpTime; // 0x01E0
	Vector m_StartingForce; // 0x01E4
	float32 m_flEndLerpTime; // 0x01F0
	Vector m_EndingForce; // 0x01F4
};
class C_INIT_ScaleVelocity : public CParticleFunctionInitializer // particles
{
	CParticleCollectionVecInput m_vecScale; // 0x01D8
};
class CVoiceContainerSetElement // soundsystem_voicecontainers
{
	CSoundContainerReference m_sound; // 0x0000
	float32 m_flVolumeDB; // 0x0018
};
class VMixDiffusorDesc_t // soundsystem_lowlevel
{
	float32 m_flSize; // 0x0000
	float32 m_flComplexity; // 0x0004
	float32 m_flFeedback; // 0x0008
	float32 m_flOutputGain; // 0x000C
};
class AnimStateID // modellib
{
	uint32 m_id; // 0x0000
};
class CNmIDToFloatNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	float32 m_defaultValue; // 0x0014
	CUtlLeanVectorFixedGrowable< CGlobalSymbol, 5 > m_IDs; // 0x0018
	CUtlLeanVectorFixedGrowable< float32, 5 > m_values; // 0x0048
};
class CStateNodeStateData // animgraphlib
{
	CAnimUpdateNodeRef m_pChild; // 0x0000
	bitfield:1 m_bExclusiveRootMotion; // 0x0000
	bitfield:1 m_bExclusiveRootMotionFirstFrame; // 0x0000
};
class CMoodVData // animationsystem
{
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x0000
	MoodType_t m_nMoodType; // 0x00E0
	CUtlVector< MoodAnimationLayer_t > m_animationLayers; // 0x00E8
};
class CVoiceContainerAnalysisBase // soundsystem_voicecontainers
{
	bool m_bRegenerateCurveOnCompile; // 0x0008
	CPiecewiseCurve m_curve; // 0x0010
};
class CSoundInfoHeader // soundsystem_voicecontainers
{
};
class RnSoftbodySpring_t // physicslib
{
	uint16[2] m_nParticle; // 0x0000
	float32 m_flLength; // 0x0004
};
class C_OP_MovementPlaceOnGround : public CParticleFunctionOperator // particles
{
	CPerParticleFloatInput m_flOffset; // 0x01D0
	float32 m_flMaxTraceLength; // 0x0340
	float32 m_flTolerance; // 0x0344
	float32 m_flTraceOffset; // 0x0348
	float32 m_flLerpRate; // 0x034C
	char[128] m_CollisionGroupName; // 0x0350
	ParticleTraceSet_t m_nTraceSet; // 0x03D0
	int32 m_nRefCP1; // 0x03D4
	int32 m_nRefCP2; // 0x03D8
	int32 m_nLerpCP; // 0x03DC
	ParticleTraceMissBehavior_t m_nTraceMissBehavior; // 0x03E8
	bool m_bIncludeShotHull; // 0x03EC
	bool m_bIncludeWater; // 0x03ED
	bool m_bSetNormal; // 0x03F0
	bool m_bScaleOffset; // 0x03F1
	int32 m_nPreserveOffsetCP; // 0x03F4
	int32 m_nIgnoreCP; // 0x03F8
};
class CVoiceContainerLoopTrigger : public CVoiceContainerBase // soundsystem_voicecontainers
{
	CSoundContainerReference m_sound; // 0x00A8
	float32 m_flRetriggerTimeMin; // 0x00C0
	float32 m_flRetriggerTimeMax; // 0x00C4
	float32 m_flFadeTime; // 0x00C8
	bool m_bCrossFade; // 0x00CC
};
class RnMeshDesc_t : public RnShapeDesc_t // physicslib
{
	RnMesh_t m_Mesh; // 0x0018
};
class CNmStateNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
	int16 m_nChildNodeIdx; // 0x0010
	CUtlLeanVectorFixedGrowable< CGlobalSymbol, 3 > m_entryEvents; // 0x0018
	CUtlLeanVectorFixedGrowable< CGlobalSymbol, 3 > m_executeEvents; // 0x0038
	CUtlLeanVectorFixedGrowable< CGlobalSymbol, 3 > m_exitEvents; // 0x0058
	CUtlLeanVectorFixedGrowable< CNmStateNode::TimedEvent_t, 1 > m_timedRemainingEvents; // 0x0078
	CUtlLeanVectorFixedGrowable< CNmStateNode::TimedEvent_t, 1 > m_timedElapsedEvents; // 0x0090
	int16 m_nLayerWeightNodeIdx; // 0x00A8
	int16 m_nLayerRootMotionWeightNodeIdx; // 0x00AA
	int16 m_nLayerBoneMaskNodeIdx; // 0x00AC
	bool m_bIsOffState; // 0x00AE
	bool m_bUseActualElapsedTimeInStateForTimedEvents; // 0x00AF
};
class CPairedSequenceComponentUpdater : public CAnimComponentUpdater // animgraphlib
{
};
class CCycleControlClipUpdateNode : public CLeafUpdateNode // animgraphlib
{
	CUtlVector< TagSpan_t > m_tags; // 0x0060
	HSequence m_hSequence; // 0x007C
	float32 m_duration; // 0x0080
	AnimValueSource m_valueSource; // 0x0084
	CAnimParamHandle m_paramIndex; // 0x0088
	bool m_bLockWhenWaning; // 0x008A
};
class CPathMoverEntitySpawn // server
{
	CHandle< CFuncMover > hMover; // 0x0000
	CUtlVector< CHandle< CBaseEntity > > vecOtherEntities; // 0x0008
};
class CNetworkTransmitComponent // server
{
	uint8 m_nTransmitStateOwnedCounter; // 0x0184
};
class ragdollelement_t // server
{
	Vector originParentSpace; // 0x0000
	int32 parentIndex; // 0x0020
	float32 m_flRadius; // 0x0024
	int32 m_nHeight; // 0x0028
};
class C_OP_RenderScreenVelocityRotate : public CParticleFunctionRenderer // particles
{
	float32 m_flRotateRateDegrees; // 0x0220
	float32 m_flForwardDegrees; // 0x0224
};
class CNmFrameSnapEvent : public CNmEvent // animlib
{
	NmFrameSnapEventMode_t m_frameSnapMode; // 0x0020
};
class FootPinningPoseOpFixedData_t // animgraphlib
{
	CUtlVector< FootFixedData_t > m_footInfo; // 0x0000
	float32 m_flBlendTime; // 0x0018
	float32 m_flLockBreakDistance; // 0x001C
	float32 m_flMaxLegTwist; // 0x0020
	int32 m_nHipBoneIndex; // 0x0024
	bool m_bApplyLegTwistLimits; // 0x0028
	bool m_bApplyFootRotationLimits; // 0x0029
};
class CollisionGroupContext_t // particles
{
	int32 m_nCollisionGroupNumber; // 0x0000
};
class C_OP_SetControlPointPositionToTimeOfDayValue : public CParticleFunctionPreEmission // particles
{
	int32 m_nControlPointNumber; // 0x01D8
	char[128] m_pszTimeOfDayParameter; // 0x01DC
	Vector m_vecDefaultValue; // 0x025C
};
class C_INIT_RandomNamedModelMeshGroup : public C_INIT_RandomNamedModelElement // particles
{
};
class CNmReferencedGraphNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
	int16 m_nReferencedGraphIdx; // 0x0010
	int16 m_nFallbackNodeIdx; // 0x0012
};
class CNmChainLookatNode::CDefinition : public CNmPassthroughNode::CDefinition // animlib
{
	CGlobalSymbol m_chainEndBoneID; // 0x0018
	int16 m_nLookatTargetNodeIdx; // 0x0020
	int16 m_nEnabledNodeIdx; // 0x0022
	float32 m_flBlendTimeSeconds; // 0x0024
	uint8 m_nChainLength; // 0x0028
	bool m_bIsTargetInWorldSpace; // 0x0029
	Vector m_chainForwardDir; // 0x002C
};
class CNmGraphEventConditionNode::Condition_t // animlib
{
	CGlobalSymbol m_eventID; // 0x0000
	NmGraphEventTypeCondition_t m_eventTypeCondition; // 0x0008
};
class SkeletonBoneBounds_t // modellib
{
	Vector m_vecCenter; // 0x0000
	Vector m_vecSize; // 0x000C
};
class inv_image_camera_t // client
{
	QAngle angle; // 0x0000
	float32 fov; // 0x000C
	float32 znear; // 0x0010
	float32 zfar; // 0x0014
	Vector target; // 0x0018
	Vector target_nudge; // 0x0024
	float32 orbit_distance; // 0x0030
};
class CCopyRecipientFilter // server
{
	int32 m_Flags; // 0x0008
	CUtlVector< CPlayerSlot > m_Recipients; // 0x0010
	CPlayerSlot m_slotPlayerExcludedDueToPrediction; // 0x0030
};
class C_OP_ConstrainLineLength : public CParticleFunctionConstraint // particles
{
	float32 m_flMinDistance; // 0x01D0
	float32 m_flMaxDistance; // 0x01D4
};
class C_OP_RemapParticleCountOnScalarEndCap : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	int32 m_nInputMin; // 0x01D4
	int32 m_nInputMax; // 0x01D8
	float32 m_flOutputMin; // 0x01DC
	float32 m_flOutputMax; // 0x01E0
	bool m_bBackwards; // 0x01E4
	ParticleSetMethod_t m_nSetMethod; // 0x01E8
};
class C_INIT_RemapTransformToVector : public CParticleFunctionInitializer // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D8
	Vector m_vInputMin; // 0x01DC
	Vector m_vInputMax; // 0x01E8
	Vector m_vOutputMin; // 0x01F4
	Vector m_vOutputMax; // 0x0200
	CParticleTransformInput m_TransformInput; // 0x0210
	CParticleTransformInput m_LocalSpaceTransform; // 0x0278
	float32 m_flStartTime; // 0x02E0
	float32 m_flEndTime; // 0x02E4
	ParticleSetMethod_t m_nSetMethod; // 0x02E8
	bool m_bOffset; // 0x02EC
	bool m_bAccelerate; // 0x02ED
	float32 m_flRemapBias; // 0x02F0
};
class CBlend2DUpdateNode : public CAnimUpdateNodeBase // animgraphlib
{
	CUtlVector< BlendItem_t > m_items; // 0x0060
	CUtlVector< TagSpan_t > m_tags; // 0x0078
	CParamSpanUpdater m_paramSpans; // 0x0090
	CUtlVector< int32 > m_nodeItemIndices; // 0x00A8
	CAnimInputDamping m_damping; // 0x00C0
	AnimValueSource m_blendSourceX; // 0x00D8
	CAnimParamHandle m_paramX; // 0x00DC
	AnimValueSource m_blendSourceY; // 0x00E0
	CAnimParamHandle m_paramY; // 0x00E4
	Blend2DMode m_eBlendMode; // 0x00E8
	float32 m_playbackSpeed; // 0x00EC
	bool m_bLoop; // 0x00F0
	bool m_bLockBlendOnReset; // 0x00F1
	bool m_bLockWhenWaning; // 0x00F2
	bool m_bAnimEventsAndTagsOnMostWeightedOnly; // 0x00F3
};
class CNmSyncEventIndexConditionNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nSourceStateNodeIdx; // 0x0010
	CNmSyncEventIndexConditionNode::TriggerMode_t m_triggerMode; // 0x0012
	int32 m_syncEventIdx; // 0x0014
};
class CSpeedScaleUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	CAnimParamHandle m_paramIndex; // 0x0070
};
class CPulse_Variable // pulse_runtime_lib
{
	PulseSymbol_t m_Name; // 0x0000
	CUtlString m_Description; // 0x0010
	CPulseValueFullType m_Type; // 0x0018
	KeyValues3 m_DefaultValue; // 0x0030
	PulseVariableKeysSource_t m_nKeysSource; // 0x0044
	bool m_bIsPublicBlackboardVariable; // 0x0048
	bool m_bIsObservable; // 0x0049
	PulseDocNodeID_t m_nEditorNodeID; // 0x004C
};
class AnimTagID // modellib
{
	uint32 m_id; // 0x0000
};
class ParticleNode_t // server
{
	CHandle< CBaseEntity > m_hEntity; // 0x0000
	ParticleIndex_t m_iIndex; // 0x0004
	GameTime_t m_flStartTime; // 0x0008
	float32 m_flGrowthDuration; // 0x000C
	Vector m_vecGrowthOrigin; // 0x0010
	float32 m_flEndcapTime; // 0x001C
	bool m_bMarkedForDelete; // 0x0020
};
class CResponseCriteriaSet // server
{
	int32 m_nNumPrefixedContexts; // 0x0030
	bool m_bOverrideOnAppend; // 0x0034
};
class C_OP_RenderStandardLight : public CParticleFunctionRenderer // particles
{
	ParticleLightTypeChoiceList_t m_nLightType; // 0x0220
	CParticleCollectionVecInput m_vecColorScale; // 0x0228
	ParticleColorBlendType_t m_nColorBlendType; // 0x08E0
	CPerParticleFloatInput m_flIntensity; // 0x08E8
	bool m_bCastShadows; // 0x0A58
	CParticleCollectionFloatInput m_flTheta; // 0x0A60
	CParticleCollectionFloatInput m_flPhi; // 0x0BD0
	CParticleCollectionFloatInput m_flRadiusMultiplier; // 0x0D40
	StandardLightingAttenuationStyle_t m_nAttenuationStyle; // 0x0EB0
	CParticleCollectionFloatInput m_flFalloffLinearity; // 0x0EB8
	CParticleCollectionFloatInput m_flFiftyPercentFalloff; // 0x1028
	CParticleCollectionFloatInput m_flZeroPercentFalloff; // 0x1198
	bool m_bRenderDiffuse; // 0x1308
	bool m_bRenderSpecular; // 0x1309
	CUtlString m_lightCookie; // 0x1310
	int32 m_nPriority; // 0x1318
	ParticleLightFogLightingMode_t m_nFogLightingMode; // 0x131C
	CParticleCollectionRendererFloatInput m_flFogContribution; // 0x1320
	ParticleLightBehaviorChoiceList_t m_nCapsuleLightBehavior; // 0x1490
	float32 m_flCapsuleLength; // 0x1494
	bool m_bReverseOrder; // 0x1498
	bool m_bClosedLoop; // 0x1499
	ParticleAttributeIndex_t m_nPrevPntSource; // 0x149C
	float32 m_flMaxLength; // 0x14A0
	float32 m_flMinLength; // 0x14A4
	bool m_bIgnoreDT; // 0x14A8
	float32 m_flConstrainRadiusToLengthRatio; // 0x14AC
	float32 m_flLengthScale; // 0x14B0
	float32 m_flLengthFadeInTime; // 0x14B4
};
class C_OP_RenderLightBeam : public CParticleFunctionRenderer // particles
{
	CParticleCollectionVecInput m_vColorBlend; // 0x0220
	ParticleColorBlendType_t m_nColorBlendType; // 0x08D8
	CParticleCollectionFloatInput m_flBrightnessLumensPerMeter; // 0x08E0
	bool m_bCastShadows; // 0x0A50
	CParticleCollectionFloatInput m_flSkirt; // 0x0A58
	CParticleCollectionFloatInput m_flRange; // 0x0BC8
	CParticleCollectionFloatInput m_flThickness; // 0x0D38
};
class CSeqSeqDescFlag // animationsystem
{
	bool m_bLooping; // 0x0000
	bool m_bSnap; // 0x0001
	bool m_bAutoplay; // 0x0002
	bool m_bPost; // 0x0003
	bool m_bHidden; // 0x0004
	bool m_bMulti; // 0x0005
	bool m_bLegacyDelta; // 0x0006
	bool m_bLegacyWorldspace; // 0x0007
	bool m_bLegacyCyclepose; // 0x0008
	bool m_bLegacyRealtime; // 0x0009
	bool m_bModelDoc; // 0x000A
};
class CStateNodeTransitionData // animgraphlib
{
	CBlendCurve m_curve; // 0x0000
	CAnimValue< float32 > m_blendDuration; // 0x0008
	CAnimValue< float32 > m_resetCycleValue; // 0x0010
	bitfield:1 m_bReset; // 0x0000
	bitfield:3 m_resetCycleOption; // 0x0000
};
class CToggleComponentActionUpdater : public CAnimActionUpdater // animgraphlib
{
	AnimComponentID m_componentID; // 0x0018
	bool m_bSetEnabled; // 0x001C
};
class CNmFootstepEventIDNode::CDefinition : public CNmIDValueNode::CDefinition // animlib
{
	int16 m_nSourceStateNodeIdx; // 0x0010
	CNmBitFlags m_eventConditionRules; // 0x0014
};
class CNmStateMachineNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
	CUtlLeanVectorFixedGrowable< CNmStateMachineNode::StateDefinition_t, 5 > m_stateDefinitions; // 0x0010
	int16 m_nDefaultStateIndex; // 0x0130
};
class CFuseProgram // mathlib_extended
{
	CUtlVector< uint8 > m_programBuffer; // 0x0000
	CUtlVector< FuseVariableIndex_t > m_variablesRead; // 0x0018
	CUtlVector< FuseVariableIndex_t > m_variablesWritten; // 0x0030
	int32 m_nMaxTempVarsUsed; // 0x0048
};
class C_CSGO_PreviewPlayer_GraphController : public CAnimGraphControllerBase // client
{
	CAnimGraphParamRef< char* > m_pszCharacterMode; // 0x0090
	CAnimGraphParamRef< char* > m_pszTeamPreviewVariant; // 0x00C0
	CAnimGraphParamRef< char* > m_pszTeamPreviewPosition; // 0x00F0
	CAnimGraphParamRef< char* > m_pszEndOfMatchCelebration; // 0x0120
	CAnimGraphParamRef< int32 > m_nTeamPreviewRandom; // 0x0150
	CAnimGraphParamRef< char* > m_pszWeaponState; // 0x0178
	CAnimGraphParamRef< char* > m_pszWeaponType; // 0x01A8
	CAnimGraphParamRef< bool > m_bCT; // 0x01D8
};
class CAI_Expresser // server
{
	GameTime_t m_flStopTalkTime; // 0x0060
	GameTime_t m_flStopTalkTimeWithoutDelay; // 0x0064
	GameTime_t m_flQueuedSpeechTime; // 0x0068
	GameTime_t m_flBlockedTalkTime; // 0x006C
	int32 m_voicePitch; // 0x0070
	GameTime_t m_flLastTimeAcceptedSpeak; // 0x0074
	bool m_bAllowSpeakingInterrupts; // 0x0078
	bool m_bConsiderSceneInvolvementAsSpeech; // 0x0079
	bool m_bSceneEntityDisabled; // 0x007A
	int32 m_nLastSpokenPriority; // 0x007C
	CBaseFlex* m_pOuter; // 0x0098
};
class ModelConfigHandle_t // server
{
	uint32 m_Value; // 0x0000
};
class C_OP_DriveCPFromGlobalSoundFloat : public CParticleFunctionPreEmission // particles
{
	int32 m_nOutputControlPoint; // 0x01D8
	int32 m_nOutputField; // 0x01DC
	float32 m_flInputMin; // 0x01E0
	float32 m_flInputMax; // 0x01E4
	float32 m_flOutputMin; // 0x01E8
	float32 m_flOutputMax; // 0x01EC
	CUtlString m_StackName; // 0x01F0
	CUtlString m_OperatorName; // 0x01F8
	CUtlString m_FieldName; // 0x0200
};
class World_t // worldrenderer
{
	WorldBuilderParams_t m_builderParams; // 0x0000
	CUtlVector< NodeData_t > m_worldNodes; // 0x0060
	BakedLightingInfo_t m_worldLightingInfo; // 0x0078
	CUtlVector< CStrongHandleCopyable< InfoForResourceTypeCEntityLump > > m_entityLumps; // 0x00C0
};
class CCachedPose // animgraphlib
{
	CUtlVector< CTransform > m_transforms; // 0x0008
	CUtlVector< float32 > m_morphWeights; // 0x0020
	HSequence m_hSequence; // 0x0038
	float32 m_flCycle; // 0x003C
};
class ConfigIndex // animgraphlib
{
	uint16 m_nGroup; // 0x0000
	uint16 m_nConfig; // 0x0002
};
class PulseGraphInstanceID_t // pulse_runtime_lib
{
	uint32 m_Value; // 0x0000
};
class CMaterialAttributeAnimTag : public CAnimTagBase // animgraphlib
{
	CUtlString m_AttributeName; // 0x0058
	MatterialAttributeTagType_t m_AttributeType; // 0x0060
	float32 m_flValue; // 0x0064
	Color m_Color; // 0x0068
};
class EventClientAdvanceNonRenderedFrame_t // engine2
{
};
class CMovementStatsProperty // server
{
	int32 m_nUseCounter; // 0x0010
	CVectorExponentialMovingAverage m_emaMovementDirection; // 0x0014
};
class DestructiblePartDestructionRequest_t // server
{
	EDestructibleParts_DestroyParameterFlags m_nDestroyFlags; // 0x0000
	DamageTypes_t m_nDamageType; // 0x0004
	float32 m_flPartDamage; // 0x0008
	float32 m_flPartDamageRadius; // 0x000C
	VectorWS m_vWsPartDamageOrigin; // 0x0010
	Vector m_vWsPartDamageForce; // 0x001C
};
class C_OP_RemapControlPointDirectionToVector : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	float32 m_flScale; // 0x01D4
	int32 m_nControlPointNumber; // 0x01D8
};
class C_OP_ScreenSpacePositionOfTarget : public CParticleFunctionOperator // particles
{
	CPerParticleVecInput m_vecTargetPosition; // 0x01D0
	bool m_bOututBehindness; // 0x0888
	ParticleAttributeIndex_t m_nBehindFieldOutput; // 0x088C
	CParticleRemapFloatInput m_flBehindOutputRemap; // 0x0890
	ParticleSetMethod_t m_nBehindSetMethod; // 0x0A00
};
class C_INIT_PositionOffset : public CParticleFunctionInitializer // particles
{
	CPerParticleVecInput m_OffsetMin; // 0x01D8
	CPerParticleVecInput m_OffsetMax; // 0x0890
	CParticleTransformInput m_TransformInput; // 0x0F48
	bool m_bLocalCoords; // 0x0FB0
	bool m_bProportional; // 0x0FB1
	CRandomNumberGeneratorParameters m_randomnessParameters; // 0x0FB4
};
class C_OP_ChladniWave : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	CPerParticleFloatInput m_flInputMin; // 0x01D8
	CPerParticleFloatInput m_flInputMax; // 0x0348
	CPerParticleFloatInput m_flOutputMin; // 0x04B8
	CPerParticleFloatInput m_flOutputMax; // 0x0628
	CPerParticleVecInput m_vecWaveLength; // 0x0798
	CPerParticleVecInput m_vecHarmonics; // 0x0E50
	ParticleSetMethod_t m_nSetMethod; // 0x1508
	int32 m_nLocalSpaceControlPoint; // 0x150C
	bool m_b3D; // 0x1510
};
class AnimationSnapshotBase_t // animationsystem
{
	float32 m_flRealTime; // 0x0000
	matrix3x4a_t m_rootToWorld; // 0x0010
	bool m_bBonesInWorldSpace; // 0x0040
	CUtlVector< uint32 > m_boneSetupMask; // 0x0048
	CUtlVector< matrix3x4a_t > m_boneTransforms; // 0x0060
	CUtlVector< float32 > m_flexControllers; // 0x0078
	AnimationSnapshotType_t m_SnapshotType; // 0x0090
	bool m_bHasDecodeDump; // 0x0094
	AnimationDecodeDebugDumpElement_t m_DecodeDump; // 0x0098
};
class CNmTwoBoneIKNode::CDefinition : public CNmPassthroughNode::CDefinition // animlib
{
	CGlobalSymbol m_effectorBoneID; // 0x0018
	int16 m_nEffectorTargetNodeIdx; // 0x0020
	int16 m_nEnabledNodeIdx; // 0x0022
	float32 m_flBlendTimeSeconds; // 0x0024
	NmIKBlendMode_t m_blendMode; // 0x0028
	bool m_bIsTargetInWorldSpace; // 0x0029
	float32 m_flReferencePoseTwistWeight; // 0x002C
};
class CNmSoundEvent : public CNmEvent // animlib
{
	CNmEventRelevance_t m_relevance; // 0x0020
	CUtlString m_name; // 0x0028
	CNmSoundEvent::Position_t m_position; // 0x0030
	CUtlString m_attachmentName; // 0x0038
	CUtlString m_tags; // 0x0040
	bool m_bContinuePlayingSoundAtDurationEnd; // 0x0048
	float32 m_flDurationInterruptionThreshold; // 0x004C
};
class CBoneMaskUpdateNode : public CBinaryUpdateNode // animgraphlib
{
	int32 m_nWeightListIndex; // 0x0094
	float32 m_flRootMotionBlend; // 0x0098
	BoneMaskBlendSpace m_blendSpace; // 0x009C
	BinaryNodeChildOption m_footMotionTiming; // 0x00A0
	bool m_bUseBlendScale; // 0x00A4
	AnimValueSource m_blendValueSource; // 0x00A8
	CAnimParamHandle m_hBlendParameter; // 0x00AC
};
class CCommentarySystem // server
{
	bool m_bCommentaryConvarsChanging; // 0x0011
	bool m_bCommentaryEnabledMidGame; // 0x0012
	GameTime_t m_flNextTeleportTime; // 0x0014
	int32 m_iTeleportStage; // 0x0018
	bool m_bCheatState; // 0x001C
	bool m_bIsFirstSpawnGroupToLoad; // 0x001D
	CHandle< CPointCommentaryNode > m_hCurrentNode; // 0x0038
	CHandle< CPointCommentaryNode > m_hActiveCommentaryNode; // 0x003C
	CHandle< CPointCommentaryNode > m_hLastCommentaryNode; // 0x0040
	CUtlVector< CHandle< CPointCommentaryNode > > m_vecNodes; // 0x0048
};
class FeFitMatrix_t // physicslib
{
	CTransform bone; // 0x0000
	Vector vCenter; // 0x0020
	uint16 nEnd; // 0x002C
	uint16 nNode; // 0x002E
	uint16 nBeginDynamic; // 0x0030
};
class CCPPScriptComponentUpdater : public CAnimComponentUpdater // animgraphlib
{
	CUtlVector< CGlobalSymbol > m_scriptsToRun; // 0x0030
};
class PostProcessingLocalContrastParameters_t // materialsystem2
{
	float32 m_flLocalContrastStrength; // 0x0000
	float32 m_flLocalContrastEdgeStrength; // 0x0004
	float32 m_flLocalContrastVignetteStart; // 0x0008
	float32 m_flLocalContrastVignetteEnd; // 0x000C
	float32 m_flLocalContrastVignetteBlur; // 0x0010
};
class dynpitchvol_base_t // server
{
	int32 preset; // 0x0000
	int32 pitchrun; // 0x0004
	int32 pitchstart; // 0x0008
	int32 spinup; // 0x000C
	int32 spindown; // 0x0010
	int32 volrun; // 0x0014
	int32 volstart; // 0x0018
	int32 fadein; // 0x001C
	int32 fadeout; // 0x0020
	int32 lfotype; // 0x0024
	int32 lforate; // 0x0028
	int32 lfomodpitch; // 0x002C
	int32 lfomodvol; // 0x0030
	int32 cspinup; // 0x0034
	int32 cspincount; // 0x0038
	int32 pitch; // 0x003C
	int32 spinupsav; // 0x0040
	int32 spindownsav; // 0x0044
	int32 pitchfrac; // 0x0048
	int32 vol; // 0x004C
	int32 fadeinsav; // 0x0050
	int32 fadeoutsav; // 0x0054
	int32 volfrac; // 0x0058
	int32 lfofrac; // 0x005C
	int32 lfomult; // 0x0060
};
class C_OP_DistanceBetweenTransforms : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	CParticleTransformInput m_TransformStart; // 0x01D8
	CParticleTransformInput m_TransformEnd; // 0x0240
	CPerParticleFloatInput m_flInputMin; // 0x02A8
	CPerParticleFloatInput m_flInputMax; // 0x0418
	CPerParticleFloatInput m_flOutputMin; // 0x0588
	CPerParticleFloatInput m_flOutputMax; // 0x06F8
	float32 m_flMaxTraceLength; // 0x0868
	float32 m_flLOSScale; // 0x086C
	char[128] m_CollisionGroupName; // 0x0870
	ParticleTraceSet_t m_nTraceSet; // 0x08F0
	bool m_bLOS; // 0x08F4
	ParticleSetMethod_t m_nSetMethod; // 0x08F8
};
class C_INIT_SequenceLifeTime : public CParticleFunctionInitializer // particles
{
	float32 m_flFramerate; // 0x01D8
};
class C_INIT_RandomNamedModelBodyPart : public C_INIT_RandomNamedModelElement // particles
{
};
class C_OP_RemapModelVolumetoCP : public CParticleFunctionPreEmission // particles
{
	BBoxVolumeType_t m_nBBoxType; // 0x01D8
	int32 m_nInControlPointNumber; // 0x01DC
	int32 m_nOutControlPointNumber; // 0x01E0
	int32 m_nOutControlPointMaxNumber; // 0x01E4
	int32 m_nField; // 0x01E8
	float32 m_flInputMin; // 0x01EC
	float32 m_flInputMax; // 0x01F0
	float32 m_flOutputMin; // 0x01F4
	float32 m_flOutputMax; // 0x01F8
	bool m_bBBoxOnly; // 0x01FC
	bool m_bCubeRoot; // 0x01FD
};
class C_OP_LerpEndCapScalar : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	float32 m_flOutput; // 0x01D4
	float32 m_flLerpTime; // 0x01D8
};
class CVMixGraphDescData // soundsystem_lowlevel
{
	CUtlString m_name; // 0x0000
	int32 m_nGraphOutputChannels; // 0x0008
	bool m_bIsMainGraph; // 0x000C
};
class FeBoxRigid_t // physicslib
{
	CTransform tmFrame2; // 0x0000
	uint16 nNode; // 0x0020
	uint16 nCollisionMask; // 0x0022
	Vector vSize; // 0x0024
	uint16 nVertexMapIndex; // 0x0030
	uint16 nFlags; // 0x0032
};
class PulseRuntimeBlackboardReferenceIndex_t // pulse_runtime_lib
{
	int16 m_Value; // 0x0000
};
class CNmVirtualParameterIDNode::CDefinition : public CNmIDValueNode::CDefinition // animlib
{
	int16 m_nChildNodeIdx; // 0x0010
};
class C_OP_CreateParticleSystemRenderer : public CParticleFunctionRenderer // particles
{
	CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_hEffect; // 0x0220
	EventTypeSelection_t m_nEventType; // 0x0228
	CUtlLeanVector< CPAssignment_t > m_vecCPs; // 0x0230
	CUtlString m_szParticleConfig; // 0x0240
	CPerParticleVecInput m_AggregationPos; // 0x0248
};
class VMixVocoderDesc_t // soundsystem_lowlevel
{
	int32 m_nBandCount; // 0x0000
	float32 m_flBandwidth; // 0x0004
	float32 m_fldBModGain; // 0x0008
	float32 m_flFreqRangeStart; // 0x000C
	float32 m_flFreqRangeEnd; // 0x0010
	float32 m_fldBUnvoicedGain; // 0x0014
	float32 m_flAttackTimeMS; // 0x0018
	float32 m_flReleaseTimeMS; // 0x001C
	int32 m_nDebugBand; // 0x0020
	bool m_bPeakMode; // 0x0024
};
class RnVertex_t // physicslib
{
	uint8 m_nEdge; // 0x0000
};
class FollowAttachmentSettings_t // animgraphlib
{
	CAnimAttachment m_attachment; // 0x0000
	int32 m_boneIndex; // 0x0080
	AttachmentHandle_t m_attachmentHandle; // 0x0084
	bool m_bMatchTranslation; // 0x0085
	bool m_bMatchRotation; // 0x0086
};
class CNmSpeedScaleNode::CDefinition : public CNmSpeedScaleBaseNode::CDefinition // animlib
{
};
class EventPostDataUpdate_t // engine2
{
	int32 m_nCount; // 0x0000
};
class C_INIT_NormalAlignToCP : public CParticleFunctionInitializer // particles
{
	CParticleTransformInput m_transformInput; // 0x01D8
	ParticleControlPointAxis_t m_nControlPointAxis; // 0x0240
};
class AggregateLODSetup_t // worldrenderer
{
	Vector m_vLODOrigin; // 0x0000
	float32 m_fMaxObjectScale; // 0x000C
	CUtlVector< float32 > m_fSwitchDistances; // 0x0010
};
class CPerParticleVecInput : public CParticleVecInput // particleslib
{
};
class CSolveIKTargetHandle_t // animgraphlib
{
	CAnimParamHandle m_positionHandle; // 0x0000
	CAnimParamHandle m_orientationHandle; // 0x0002
};
class MaterialResourceData_t // materialsystem2
{
	CUtlString m_materialName; // 0x0000
	CUtlString m_shaderName; // 0x0008
	CUtlVector< MaterialParamInt_t > m_intParams; // 0x0010
	CUtlVector< MaterialParamFloat_t > m_floatParams; // 0x0028
	CUtlVector< MaterialParamVector_t > m_vectorParams; // 0x0040
	CUtlVector< MaterialParamTexture_t > m_textureParams; // 0x0058
	CUtlVector< MaterialParamBuffer_t > m_dynamicParams; // 0x0070
	CUtlVector< MaterialParamBuffer_t > m_dynamicTextureParams; // 0x0088
	CUtlVector< MaterialParamInt_t > m_intAttributes; // 0x00A0
	CUtlVector< MaterialParamFloat_t > m_floatAttributes; // 0x00B8
	CUtlVector< MaterialParamVector_t > m_vectorAttributes; // 0x00D0
	CUtlVector< MaterialParamTexture_t > m_textureAttributes; // 0x00E8
	CUtlVector< MaterialParamString_t > m_stringAttributes; // 0x0100
	CUtlVector< CUtlString > m_renderAttributesUsed; // 0x0118
};
class CRandStopwatch : public CStopwatchBase // server
{
	float32 m_flMinInterval; // 0x000C
	float32 m_flMaxInterval; // 0x0010
};
class C_OP_DragRelativeToPlane : public CParticleFunctionOperator // particles
{
	CParticleCollectionFloatInput m_flDragAtPlane; // 0x01D0
	CParticleCollectionFloatInput m_flFalloff; // 0x0340
	bool m_bDirectional; // 0x04B0
	CParticleCollectionVecInput m_vecPlaneNormal; // 0x04B8
	int32 m_nControlPointNumber; // 0x0B70
};
class C_OP_MaxVelocity : public CParticleFunctionOperator // particles
{
	float32 m_flMaxVelocity; // 0x01D0
	float32 m_flMinVelocity; // 0x01D4
	int32 m_nOverrideCP; // 0x01D8
	int32 m_nOverrideCPField; // 0x01DC
};
class C_OP_RemapBoundingVolumetoCP : public CParticleFunctionPreEmission // particles
{
	int32 m_nOutControlPointNumber; // 0x01D8
	float32 m_flInputMin; // 0x01DC
	float32 m_flInputMax; // 0x01E0
	float32 m_flOutputMin; // 0x01E4
	float32 m_flOutputMax; // 0x01E8
};
class FourCovMatrices3 // physicslib
{
	FourVectors m_vDiag; // 0x0000
	fltx4 m_flXY; // 0x0030
	fltx4 m_flXZ; // 0x0040
	fltx4 m_flYZ; // 0x0050
};
class CNmGraphDefinition // animlib
{
	CGlobalSymbol m_variationID; // 0x0000
	CStrongHandle< InfoForResourceTypeCNmSkeleton > m_skeleton; // 0x0008
	CNmGraphVariationUserData* m_pUserData; // 0x0010
	CUtlVector< int16 > m_persistentNodeIndices; // 0x0018
	int16 m_nRootNodeIdx; // 0x0030
	CUtlVector< CGlobalSymbol > m_controlParameterIDs; // 0x0038
	CUtlVector< CGlobalSymbol > m_virtualParameterIDs; // 0x0050
	CUtlVector< int16 > m_virtualParameterNodeIndices; // 0x0068
	CUtlVector< CNmGraphDefinition::ReferencedGraphSlot_t > m_referencedGraphSlots; // 0x0080
	CUtlVector< CNmGraphDefinition::ExternalGraphSlot_t > m_externalGraphSlots; // 0x0098
	CUtlVector< CNmGraphDefinition::ExternalPoseSlot_t > m_externalPoseSlots; // 0x00B0
	CUtlVector< CUtlString > m_nodePaths; // 0x0138
	CUtlVector< CStrongHandleVoid > m_resources; // 0x0150
};
class DynamicMeshDeformParams_t // modellib
{
	float32 m_flTensionCompressScale; // 0x0000
	float32 m_flTensionStretchScale; // 0x0004
	bool m_bRecomputeSmoothNormalsAfterAnimation; // 0x0008
	bool m_bComputeDynamicMeshTensionAfterAnimation; // 0x0009
	bool m_bSmoothNormalsAcrossUvSeams; // 0x000A
	bool m_bEnableEyeBulgeDeformation; // 0x000B
};
class CNmFloatRemapNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	CNmFloatRemapNode::RemapRange_t m_inputRange; // 0x0014
	CNmFloatRemapNode::RemapRange_t m_outputRange; // 0x001C
};
class CSeqAutoLayer // animationsystem
{
	int16 m_nLocalReference; // 0x0000
	int16 m_nLocalPose; // 0x0002
	CSeqAutoLayerFlag m_flags; // 0x0004
	float32 m_start; // 0x000C
	float32 m_peak; // 0x0010
	float32 m_tail; // 0x0014
	float32 m_end; // 0x0018
};
class InfoForResourceTypeCGcExportableExternalData // resourcesystem
{
};
class CNavVolumeAll : public CNavVolumeVector // navlib
{
};
class C_OP_RenderDeferredLight : public CParticleFunctionRenderer // particles
{
	bool m_bUseAlphaTestWindow; // 0x0220
	bool m_bUseTexture; // 0x0221
	float32 m_flRadiusScale; // 0x0224
	float32 m_flAlphaScale; // 0x0228
	ParticleAttributeIndex_t m_nAlpha2Field; // 0x022C
	CParticleCollectionVecInput m_vecColorScale; // 0x0230
	ParticleColorBlendType_t m_nColorBlendType; // 0x08E8
	float32 m_flLightDistance; // 0x08EC
	float32 m_flStartFalloff; // 0x08F0
	float32 m_flDistanceFalloff; // 0x08F4
	float32 m_flSpotFoV; // 0x08F8
	ParticleAttributeIndex_t m_nAlphaTestPointField; // 0x08FC
	ParticleAttributeIndex_t m_nAlphaTestRangeField; // 0x0900
	ParticleAttributeIndex_t m_nAlphaTestSharpnessField; // 0x0904
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hTexture; // 0x0908
	int32 m_nHSVShiftControlPoint; // 0x0910
};
class C_INIT_InitFloatCollection : public CParticleFunctionInitializer // particles
{
	CParticleCollectionFloatInput m_InputValue; // 0x01D8
	ParticleAttributeIndex_t m_nOutputField; // 0x0348
};
class C_OP_RemapDotProductToScalar : public CParticleFunctionOperator // particles
{
	int32 m_nInputCP1; // 0x01D0
	int32 m_nInputCP2; // 0x01D4
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D8
	float32 m_flInputMin; // 0x01DC
	float32 m_flInputMax; // 0x01E0
	float32 m_flOutputMin; // 0x01E4
	float32 m_flOutputMax; // 0x01E8
	bool m_bUseParticleVelocity; // 0x01EC
	ParticleSetMethod_t m_nSetMethod; // 0x01F0
	bool m_bActiveRange; // 0x01F4
	bool m_bUseParticleNormal; // 0x01F5
};
class CFeIndexedJiggleBone // physicslib
{
	uint32 m_nNode; // 0x0000
	uint32 m_nJiggleParent; // 0x0004
	CFeJiggleBone m_jiggleBone; // 0x0008
};
class CProductQuantizer // animgraphlib
{
	CUtlVector< CVectorQuantizer > m_subQuantizers; // 0x0000
	int32 m_nDimensions; // 0x0018
};
class CUnaryUpdateNode : public CAnimUpdateNodeBase // animgraphlib
{
	CAnimUpdateNodeRef m_pChildNode; // 0x0060
};
class CFootstepTableHandle // server
{
};
class SceneEventId_t // server
{
	uint32 m_Value; // 0x0000
};
class CNetworkOriginQuantizedVector // server
{
	CNetworkedQuantizedFloat m_vecX; // 0x0010
	CNetworkedQuantizedFloat m_vecY; // 0x0018
	CNetworkedQuantizedFloat m_vecZ; // 0x0020
};
class CMorphBundleData // modellib
{
	float32 m_flULeftSrc; // 0x0000
	float32 m_flVTopSrc; // 0x0004
	CUtlVector< float32 > m_offsets; // 0x0008
	CUtlVector< float32 > m_ranges; // 0x0020
};
class CDampedValueComponentUpdater : public CAnimComponentUpdater // animgraphlib
{
	CUtlVector< CDampedValueUpdateItem > m_items; // 0x0030
};
class CAnimStateMachineUpdater // animgraphlib
{
	CUtlVector< CStateUpdateData > m_states; // 0x0008
	CUtlVector< CTransitionUpdateData > m_transitions; // 0x0020
	int32 m_startStateIndex; // 0x0050
};
class CNmBoolValueNode::CDefinition : public CNmValueNode::CDefinition // animlib
{
};
class CHitBoxSet // modellib
{
	CUtlString m_name; // 0x0000
	uint32 m_nNameHash; // 0x0008
	CUtlVector< CHitBox > m_HitBoxes; // 0x0010
	CUtlString m_SourceFilename; // 0x0028
};
class InfoForResourceTypeCChoreoSceneResource // resourcesystem
{
};
class magnetted_objects_t // server
{
	CHandle< CBaseEntity > hEntity; // 0x0008
};
class CParticleFunctionPreEmission : public CParticleFunctionOperator // particles
{
	bool m_bRunOnce; // 0x01D0
};
class C_OP_SetSingleControlPointPosition : public CParticleFunctionPreEmission // particles
{
	bool m_bSetOnce; // 0x01D8
	int32 m_nCP1; // 0x01DC
	CParticleCollectionVecInput m_vecCP1Pos; // 0x01E0
	CParticleTransformInput m_transformInput; // 0x0898
};
class CParticleMassCalculationParameters // particles
{
	ParticleMassMode_t m_nMassMode; // 0x0000
	CPerParticleFloatInput m_flRadius; // 0x0008
	CPerParticleFloatInput m_flNominalRadius; // 0x0178
	CPerParticleFloatInput m_flScale; // 0x02E8
};
class ISkeletonAnimationController // server
{
};
class C_OP_SetControlPointsToParticle : public CParticleFunctionOperator // particles
{
	int32 m_nChildGroupID; // 0x01D0
	int32 m_nFirstControlPoint; // 0x01D4
	int32 m_nNumControlPoints; // 0x01D8
	int32 m_nFirstSourcePoint; // 0x01DC
	bool m_bReverse; // 0x01E0
	bool m_bSetOrientation; // 0x01E1
	ParticleOrientationSetMode_t m_nOrientationMode; // 0x01E4
	ParticleParentSetMode_t m_nSetParent; // 0x01E8
};
class C_OP_ExternalGameImpulseForce : public CParticleFunctionForce // particles
{
	CPerParticleFloatInput m_flForceScale; // 0x01E0
	bool m_bRopes; // 0x0350
	bool m_bRopesZOnly; // 0x0351
	bool m_bExplosions; // 0x0352
	bool m_bParticles; // 0x0353
};
class C_OP_Callback : public CParticleFunctionRenderer // particles
{
};
class CVoiceContainerSwitch : public CVoiceContainerBase // soundsystem_voicecontainers
{
	CUtlVector< CSoundContainerReference > m_soundsToPlay; // 0x00A8
};
class PhysFeModelDesc_t // physicslib
{
	CUtlVector< uint32 > m_CtrlHash; // 0x0000
	CUtlVector< CUtlString > m_CtrlName; // 0x0018
	uint32 m_nStaticNodeFlags; // 0x0030
	uint32 m_nDynamicNodeFlags; // 0x0034
	float32 m_flLocalForce; // 0x0038
	float32 m_flLocalRotation; // 0x003C
	uint16 m_nNodeCount; // 0x0040
	uint16 m_nStaticNodes; // 0x0042
	uint16 m_nRotLockStaticNodes; // 0x0044
	uint16 m_nFirstPositionDrivenNode; // 0x0046
	uint16 m_nSimdTriCount1; // 0x0048
	uint16 m_nSimdTriCount2; // 0x004A
	uint16 m_nSimdQuadCount1; // 0x004C
	uint16 m_nSimdQuadCount2; // 0x004E
	uint16 m_nQuadCount1; // 0x0050
	uint16 m_nQuadCount2; // 0x0052
	uint16 m_nTreeDepth; // 0x0054
	uint16 m_nNodeBaseJiggleboneDependsCount; // 0x0056
	uint16 m_nRopeCount; // 0x0058
	CUtlVector< uint16 > m_Ropes; // 0x0060
	CUtlVector< FeNodeBase_t > m_NodeBases; // 0x0078
	CUtlVector< FeSimdNodeBase_t > m_SimdNodeBases; // 0x0090
	CUtlVector< FeQuad_t > m_Quads; // 0x00A8
	CUtlVector< FeSimdQuad_t > m_SimdQuads; // 0x00C0
	CUtlVector< FeSimdTri_t > m_SimdTris; // 0x00D8
	CUtlVector< FeSimdRodConstraint_t > m_SimdRods; // 0x00F0
	CUtlVector< FeSimdRodConstraintAnim_t > m_SimdRodsAnim; // 0x0108
	CUtlVector< CTransform > m_InitPose; // 0x0120
	CUtlVector< FeRodConstraint_t > m_Rods; // 0x0138
	CUtlVector< FeTwistConstraint_t > m_Twists; // 0x0150
	CUtlVector< FeHingeLimit_t > m_HingeLimits; // 0x0168
	CUtlVector< uint32 > m_AntiTunnelBytecode; // 0x0180
	CUtlVector< FeDynKinLink_t > m_DynKinLinks; // 0x0198
	CUtlVector< FeAntiTunnelProbe_t > m_AntiTunnelProbes; // 0x01B0
	CUtlVector< uint16 > m_AntiTunnelTargetNodes; // 0x01C8
	CUtlVector< FeNodeStrayBox_t > m_NodeStrayBoxes; // 0x01E0
	CUtlVector< FeAxialEdgeBend_t > m_AxialEdges; // 0x01F8
	CUtlVector< float32 > m_NodeInvMasses; // 0x0210
	CUtlVector< FeCtrlOffset_t > m_CtrlOffsets; // 0x0228
	CUtlVector< FeCtrlOsOffset_t > m_CtrlOsOffsets; // 0x0240
	CUtlVector< FeFollowNode_t > m_FollowNodes; // 0x0258
	CUtlVector< FeCollisionPlane_t > m_CollisionPlanes; // 0x0270
	CUtlVector< FeNodeIntegrator_t > m_NodeIntegrator; // 0x0288
	CUtlVector< FeSpringIntegrator_t > m_SpringIntegrator; // 0x02A0
	CUtlVector< FeSimdSpringIntegrator_t > m_SimdSpringIntegrator; // 0x02B8
	CUtlVector< FeWorldCollisionParams_t > m_WorldCollisionParams; // 0x02D0
	CUtlVector< float32 > m_LegacyStretchForce; // 0x02E8
	CUtlVector< float32 > m_NodeCollisionRadii; // 0x0300
	CUtlVector< float32 > m_DynNodeFriction; // 0x0318
	CUtlVector< float32 > m_LocalRotation; // 0x0330
	CUtlVector< float32 > m_LocalForce; // 0x0348
	CUtlVector< FeTaperedCapsuleStretch_t > m_TaperedCapsuleStretches; // 0x0360
	CUtlVector< FeTaperedCapsuleRigid_t > m_TaperedCapsuleRigids; // 0x0378
	CUtlVector< FeSphereRigid_t > m_SphereRigids; // 0x0390
	CUtlVector< uint16 > m_WorldCollisionNodes; // 0x03A8
	CUtlVector< uint16 > m_TreeParents; // 0x03C0
	CUtlVector< uint16 > m_TreeCollisionMasks; // 0x03D8
	CUtlVector< FeTreeChildren_t > m_TreeChildren; // 0x03F0
	CUtlVector< uint16 > m_FreeNodes; // 0x0408
	CUtlVector< FeFitMatrix_t > m_FitMatrices; // 0x0420
	CUtlVector< FeFitWeight_t > m_FitWeights; // 0x0438
	CUtlVector< FeNodeReverseOffset_t > m_ReverseOffsets; // 0x0450
	CUtlVector< FeAnimStrayRadius_t > m_AnimStrayRadii; // 0x0468
	CUtlVector< FeSimdAnimStrayRadius_t > m_SimdAnimStrayRadii; // 0x0480
	CUtlVector< FeKelagerBend2_t > m_KelagerBends; // 0x0498
	CUtlVector< FeCtrlSoftOffset_t > m_CtrlSoftOffsets; // 0x04B0
	CUtlVector< CFeIndexedJiggleBone > m_JiggleBones; // 0x04C8
	CUtlVector< uint16 > m_SourceElems; // 0x04E0
	CUtlVector< uint32 > m_GoalDampedSpringIntegrators; // 0x04F8
	CUtlVector< FeTri_t > m_Tris; // 0x0510
	uint16 m_nTriCount1; // 0x0528
	uint16 m_nTriCount2; // 0x052A
	uint8 m_nReservedUint8; // 0x052C
	uint8 m_nExtraPressureIterations; // 0x052D
	uint8 m_nExtraGoalIterations; // 0x052E
	uint8 m_nExtraIterations; // 0x052F
	CUtlVector< FeSDFRigid_t > m_SDFRigids; // 0x0530
	CUtlVector< FeBoxRigid_t > m_BoxRigids; // 0x0548
	CUtlVector< uint8 > m_DynNodeVertexSet; // 0x0560
	CUtlVector< uint32 > m_VertexSetNames; // 0x0578
	CUtlVector< FeRigidColliderIndices_t > m_RigidColliderPriorities; // 0x0590
	CUtlVector< FeMorphLayerDepr_t > m_MorphLayers; // 0x05A8
	CUtlVector< uint8 > m_MorphSetData; // 0x05C0
	CUtlVector< FeVertexMapDesc_t > m_VertexMaps; // 0x05D8
	CUtlVector< uint8 > m_VertexMapValues; // 0x05F0
	CUtlVector< FeEffectDesc_t > m_Effects; // 0x0608
	CUtlVector< FeCtrlOffset_t > m_LockToParent; // 0x0620
	CUtlVector< uint16 > m_LockToGoal; // 0x0638
	CUtlVector< int16 > m_SkelParents; // 0x0650
	CUtlVector< FeNodeWindBase_t > m_DynNodeWindBases; // 0x0668
	CUtlVector< FeModelSelfCollisionLayer_t > m_SelfCollisionLayers; // 0x0680
	float32 m_flInternalPressure; // 0x0698
	float32 m_flDefaultTimeDilation; // 0x069C
	float32 m_flWindage; // 0x06A0
	float32 m_flWindDrag; // 0x06A4
	float32 m_flDefaultSurfaceStretch; // 0x06A8
	float32 m_flDefaultThreadStretch; // 0x06AC
	float32 m_flDefaultGravityScale; // 0x06B0
	float32 m_flDefaultVelAirDrag; // 0x06B4
	float32 m_flDefaultExpAirDrag; // 0x06B8
	float32 m_flDefaultVelQuadAirDrag; // 0x06BC
	float32 m_flDefaultExpQuadAirDrag; // 0x06C0
	float32 m_flRodVelocitySmoothRate; // 0x06C4
	float32 m_flQuadVelocitySmoothRate; // 0x06C8
	float32 m_flAddWorldCollisionRadius; // 0x06CC
	float32 m_flDefaultVolumetricSolveAmount; // 0x06D0
	float32 m_flMotionSmoothCDT; // 0x06D4
	float32 m_flLocalDrag1; // 0x06D8
	uint16 m_nRodVelocitySmoothIterations; // 0x06DC
	uint16 m_nQuadVelocitySmoothIterations; // 0x06DE
};
class CModelConfigElement_SetMaterialGroupOnAttachedModels : public CModelConfigElement // modellib
{
	CUtlString m_MaterialGroupName; // 0x0048
};
class CNmConstTargetNode::CDefinition : public CNmTargetValueNode::CDefinition // animlib
{
	CNmTarget m_value; // 0x0010
};
class CNmConstFloatNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	float32 m_flValue; // 0x0010
};
class CDirectionalBlendUpdateNode : public CLeafUpdateNode // animgraphlib
{
	HSequence[8] m_hSequences; // 0x005C
	CAnimInputDamping m_damping; // 0x0080
	AnimValueSource m_blendValueSource; // 0x0098
	CAnimParamHandle m_paramIndex; // 0x009C
	float32 m_playbackSpeed; // 0x00A0
	float32 m_duration; // 0x00A4
	bool m_bLoop; // 0x00A8
	bool m_bLockBlendOnReset; // 0x00A9
};
class CStopwatch : public CStopwatchBase // server
{
	float32 m_flInterval; // 0x000C
};
class C_OP_VelocityDecay : public CParticleFunctionOperator // particles
{
	float32 m_flMinVelocity; // 0x01D0
};
class C_OP_CalculateVectorAttribute : public CParticleFunctionOperator // particles
{
	Vector m_vStartValue; // 0x01D0
	ParticleAttributeIndex_t m_nFieldInput1; // 0x01DC
	float32 m_flInputScale1; // 0x01E0
	ParticleAttributeIndex_t m_nFieldInput2; // 0x01E4
	float32 m_flInputScale2; // 0x01E8
	ControlPointReference_t m_nControlPointInput1; // 0x01EC
	float32 m_flControlPointScale1; // 0x0200
	ControlPointReference_t m_nControlPointInput2; // 0x0204
	float32 m_flControlPointScale2; // 0x0218
	ParticleAttributeIndex_t m_nFieldOutput; // 0x021C
	Vector m_vFinalOutputScale; // 0x0220
};
class CSSDSMsg_EndFrame // scenesystem
{
	CUtlVector< CSSDSEndFrameViewInfo > m_Views; // 0x0000
};
class RnMesh_t // physicslib
{
	Vector m_vMin; // 0x0000
	Vector m_vMax; // 0x000C
	CUtlVector< RnNode_t > m_Nodes; // 0x0018
	CUtlVectorSIMDPaddedVector m_Vertices; // 0x0030
	CUtlVector< RnTriangle_t > m_Triangles; // 0x0048
	CUtlVector< RnWing_t > m_Wings; // 0x0060
	CUtlVector< uint8 > m_TriangleEdgeFlags; // 0x0078
	CUtlVector< uint8 > m_Materials; // 0x0090
	Vector m_vOrthographicAreas; // 0x00A8
	uint32 m_nFlags; // 0x00B4
	uint32 m_nDebugFlags; // 0x00B8
};
class RnPlane_t // physicslib
{
	Vector m_vNormal; // 0x0000
	float32 m_flOffset; // 0x000C
};
class CFeVertexMapBuildArray // physicslib
{
	CUtlVector< FeVertexMapBuild_t* > m_Array; // 0x0000
};
class CInputStreamUpdateNode : public CLeafUpdateNode // animgraphlib
{
};
class CAnimScriptManager // animgraphlib
{
	CUtlVector< ScriptInfo_t > m_scriptInfo; // 0x0010
};
class CAnimMovement // animationsystem
{
	int32 endframe; // 0x0000
	int32 motionflags; // 0x0004
	float32 v0; // 0x0008
	float32 v1; // 0x000C
	float32 angle; // 0x0010
	Vector vector; // 0x0014
	Vector position; // 0x0020
};
class CBlendCurve // animgraphlib
{
	float32 m_flControlPoint1; // 0x0000
	float32 m_flControlPoint2; // 0x0004
};
class SkeletonDemoDb_t // modellib
{
	CUtlVector< SkeletonAnimCapture_t* > m_AnimCaptures; // 0x0000
	CUtlVector< SkeletonAnimCapture_t::Camera_t > m_CameraTrack; // 0x0018
	float32 m_flRecordingTime; // 0x0030
};
class CNmIDSelectorNode::CDefinition : public CNmIDValueNode::CDefinition // animlib
{
	CUtlVectorFixedGrowable< int16, 5 > m_conditionNodeIndices; // 0x0010
	CUtlVectorFixedGrowable< CGlobalSymbol, 5 > m_values; // 0x0038
	CGlobalSymbol m_defaultValue; // 0x0078
};
class RenderInputLayoutField_t // rendersystemdx11
{
	char[32] m_pSemanticName; // 0x0000
	int8 m_nSemanticIndex; // 0x0020
	int16 m_nOffset; // 0x0028
	int8 m_nSlot; // 0x002A
	RenderSlotType_t m_nSlotType; // 0x002B
	char[32] m_szShaderSemantic; // 0x002C
};
class AABB_t // mathlib_extended
{
	Vector m_vMinBounds; // 0x0000
	Vector m_vMaxBounds; // 0x000C
};
class C_INIT_RandomVectorComponent : public CParticleFunctionInitializer // particles
{
	float32 m_flMin; // 0x01D8
	float32 m_flMax; // 0x01DC
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01E0
	int32 m_nComponent; // 0x01E4
};
class C_OP_InheritFromParentParticles : public CParticleFunctionOperator // particles
{
	float32 m_flScale; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	int32 m_nIncrement; // 0x01D8
	bool m_bRandomDistribution; // 0x01DC
};
class CBaseTrailRenderer : public CBaseRendererSource2 // particles
{
	ParticleOrientationChoiceList_t m_nOrientationType; // 0x2DE8
	int32 m_nOrientationControlPoint; // 0x2DEC
	float32 m_flMinSize; // 0x2DF0
	float32 m_flMaxSize; // 0x2DF4
	CParticleCollectionRendererFloatInput m_flStartFadeSize; // 0x2DF8
	CParticleCollectionRendererFloatInput m_flEndFadeSize; // 0x2F68
	bool m_bClampV; // 0x30D8
};
class CPhysSurfacePropertiesVehicle // modellib
{
	float32 m_wheelDrag; // 0x0000
	float32 m_wheelFrictionScale; // 0x0004
};
class CLookComponentUpdater : public CAnimComponentUpdater // animgraphlib
{
	CAnimParamHandle m_hLookHeading; // 0x0034
	CAnimParamHandle m_hLookHeadingNormalized; // 0x0036
	CAnimParamHandle m_hLookHeadingVelocity; // 0x0038
	CAnimParamHandle m_hLookPitch; // 0x003A
	CAnimParamHandle m_hLookDistance; // 0x003C
	CAnimParamHandle m_hLookDirection; // 0x003E
	CAnimParamHandle m_hLookTarget; // 0x0040
	CAnimParamHandle m_hLookTargetWorldSpace; // 0x0042
	bool m_bNetworkLookTarget; // 0x0044
};
class CSetParameterActionUpdater : public CAnimActionUpdater // animgraphlib
{
	CAnimParamHandle m_hParam; // 0x0018
	CAnimVariant m_value; // 0x001A
};
class CConstantForceController // server
{
	Vector m_linear; // 0x000C
	RotationVector m_angular; // 0x0018
	Vector m_linearSave; // 0x0024
	RotationVector m_angularSave; // 0x0030
};
class C_OP_ModelSurfaceSnapshotGenerator : public CParticleFunctionPreEmission // particles
{
	int32 m_nCPSnapshot; // 0x01D8
	CParticleModelInput m_modelInput; // 0x01E0
	CParticleCollectionFloatInput m_flRecalcRate; // 0x0240
	CParticleCollectionFloatInput m_flUSpacing; // 0x03B0
	CParticleCollectionFloatInput m_flVSpacing; // 0x0520
	CParticleCollectionFloatInput m_flSurfaceOffset; // 0x0690
	bool m_bSetNormal; // 0x0800
	bool m_bSetUp; // 0x0801
	bool m_bSetGravity; // 0x0802
	bool m_bSetUV; // 0x0803
};
class C_OP_ConstrainDistanceToUserSpecifiedPath : public CParticleFunctionConstraint // particles
{
	float32 m_fMinDistance; // 0x01D0
	float32 m_flMaxDistance; // 0x01D4
	float32 m_flTimeScale; // 0x01D8
	bool m_bLoopedPath; // 0x01DC
	CUtlVector< PointDefinitionWithTimeValues_t > m_pointList; // 0x01E0
};
class ClutterTile_t // worldrenderer
{
	uint32 m_nFirstInstance; // 0x0000
	uint32 m_nLastInstance; // 0x0004
	AABB_t m_BoundsWs; // 0x0008
};
class CVoiceContainerAmpedDecayingSineWave : public CVoiceContainerDecayingSineWave // soundsystem_voicecontainers
{
	float32 m_flGainAmount; // 0x00B0
};
class CVMixAutoFilterProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixAutoFilterDesc_t m_desc; // 0x0020
};
class CNmFootEvent : public CNmEvent // animlib
{
	NmFootPhase_t m_phase; // 0x0020
};
class CompositeMaterialEditorPoint_t // compositematerialslib
{
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_ModelName; // 0x0000
	int32 m_nSequenceIndex; // 0x00E0
	float32 m_flCycle; // 0x00E4
	KeyValues3 m_KVModelStateChoices; // 0x00E8
	bool m_bEnableChildModel; // 0x00F8
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_ChildModelName; // 0x0100
	CUtlVector< CompositeMaterialAssemblyProcedure_t > m_vecCompositeMaterialAssemblyProcedures; // 0x01E0
	CUtlVector< CompositeMaterial_t > m_vecCompositeMaterials; // 0x01F8
};
class CEntitySubclassVDataBase // server
{
};
class C_INIT_InitFromParentKilled : public CParticleFunctionInitializer // particles
{
	ParticleAttributeIndex_t m_nAttributeToCopy; // 0x01D8
	EventTypeSelection_t m_nEventType; // 0x01DC
};
class C_OP_RenderOmni2Light : public CParticleFunctionRenderer // particles
{
	ParticleOmni2LightTypeChoiceList_t m_nLightType; // 0x0220
	CParticleCollectionVecInput m_vColorBlend; // 0x0228
	ParticleColorBlendType_t m_nColorBlendType; // 0x08E0
	ParticleLightUnitChoiceList_t m_nBrightnessUnit; // 0x08E4
	CPerParticleFloatInput m_flBrightnessLumens; // 0x08E8
	CPerParticleFloatInput m_flBrightnessCandelas; // 0x0A58
	bool m_bCastShadows; // 0x0BC8
	bool m_bFog; // 0x0BC9
	CPerParticleFloatInput m_flFogScale; // 0x0BD0
	CPerParticleFloatInput m_flLuminaireRadius; // 0x0D40
	CPerParticleFloatInput m_flSkirt; // 0x0EB0
	CPerParticleFloatInput m_flRange; // 0x1020
	CPerParticleFloatInput m_flInnerConeAngle; // 0x1190
	CPerParticleFloatInput m_flOuterConeAngle; // 0x1300
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0x1470
	bool m_bSphericalCookie; // 0x1478
};
class CNmPoseTask // animlib
{
};
class CFootCycleDefinition // modellib
{
	Vector m_vStancePositionMS; // 0x0000
	Vector m_vMidpointPositionMS; // 0x000C
	float32 m_flStanceDirectionMS; // 0x0018
	Vector m_vToStrideStartPos; // 0x001C
	CAnimCycle m_stanceCycle; // 0x0028
	CFootCycle m_footLiftCycle; // 0x002C
	CFootCycle m_footOffCycle; // 0x0030
	CFootCycle m_footStrikeCycle; // 0x0034
	CFootCycle m_footLandCycle; // 0x0038
};
class CRenderBufferBinding // modellib
{
	uint64 m_hBuffer; // 0x0000
	uint32 m_nBindOffsetBytes; // 0x0010
};
class CMotionNode // animgraphlib
{
	CUtlString m_name; // 0x0018
	AnimNodeID m_id; // 0x0020
};
class CMultiplayer_Expresser : public CAI_ExpresserWithFollowup // server
{
	bool m_bAllowMultipleScenes; // 0x00A0
};
class C_INIT_InitFloat : public CParticleFunctionInitializer // particles
{
	CPerParticleFloatInput m_InputValue; // 0x01D8
	ParticleAttributeIndex_t m_nOutputField; // 0x0348
	ParticleSetMethod_t m_nSetMethod; // 0x034C
	CPerParticleFloatInput m_InputStrength; // 0x0350
};
class CollisionDetailLayerInfo_t::Name_t // physicslib
{
	CUtlStringToken m_nNameToken; // 0x0000
	CUtlString m_sNameString; // 0x0008
};
class CSchemaSystemInternalRegistration // schemasystem
{
	Vector2D m_Vector2D; // 0x0000
	Vector m_Vector; // 0x0008
	VectorWS m_VectorWS; // 0x0014
	VectorAligned m_VectorAligned; // 0x0020
	Quaternion m_Quaternion; // 0x0030
	QAngle m_QAngle; // 0x0040
	RotationVector m_RotationVector; // 0x004C
	RadianEuler m_RadianEuler; // 0x0058
	DegreeEuler m_DegreeEuler; // 0x0064
	QuaternionStorage m_QuaternionStorage; // 0x0070
	matrix3x4_t m_matrix3x4_t; // 0x0080
	matrix3x4a_t m_matrix3x4a_t; // 0x00B0
	Color m_Color; // 0x00E0
	Vector4D m_Vector4D; // 0x00E4
	CTransform m_CTransform; // 0x0100
	KeyValues* m_pKeyValues; // 0x0120
	CUtlBinaryBlock m_CUtlBinaryBlock; // 0x0128
	CUtlString m_CUtlString; // 0x0138
	CUtlSymbol m_CUtlSymbol; // 0x0140
	CUtlStringToken m_stringToken; // 0x0144
	CUtlStringTokenWithStorage m_stringTokenWithStorage; // 0x0148
	CResourceArray< CResourcePointer< CResourceString > > m_ResourceTypes; // 0x0160
	KeyValues3 m_KV3; // 0x0168
};
class C_OP_SetCPtoVector : public CParticleFunctionOperator // particles
{
	int32 m_nCPInput; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
};
class CNmStateCompletedConditionNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nSourceStateNodeIdx; // 0x0010
	int16 m_nTransitionDurationOverrideNodeIdx; // 0x0012
	float32 m_flTransitionDurationSeconds; // 0x0014
};
class CBoolAnimParameter : public CConcreteAnimParameter // animgraphlib
{
	bool m_bDefaultValue; // 0x0080
};
class VPhysXBodyPart_t // modellib
{
	uint32 m_nFlags; // 0x0000
	float32 m_flMass; // 0x0004
	VPhysics2ShapeDef_t m_rnShape; // 0x0008
	uint16 m_nCollisionAttributeIndex; // 0x0080
	uint16 m_nReserved; // 0x0082
	float32 m_flInertiaScale; // 0x0084
	float32 m_flLinearDamping; // 0x0088
	float32 m_flAngularDamping; // 0x008C
	float32 m_flLinearDrag; // 0x0090
	float32 m_flAngularDrag; // 0x0094
	bool m_bOverrideMassCenter; // 0x0098
	Vector m_vMassCenterOverride; // 0x009C
};
class C_INIT_InitSkinnedPositionFromCPSnapshot : public CParticleFunctionInitializer // particles
{
	int32 m_nSnapshotControlPointNumber; // 0x01D8
	int32 m_nControlPointNumber; // 0x01DC
	bool m_bRandom; // 0x01E0
	int32 m_nRandomSeed; // 0x01E4
	bool m_bRigid; // 0x01E8
	bool m_bSetNormal; // 0x01E9
	bool m_bIgnoreDt; // 0x01EA
	float32 m_flMinNormalVelocity; // 0x01EC
	float32 m_flMaxNormalVelocity; // 0x01F0
	SnapshotIndexType_t m_nIndexType; // 0x01F4
	CPerParticleFloatInput m_flReadIndex; // 0x01F8
	float32 m_flIncrement; // 0x0368
	int32 m_nFullLoopIncrement; // 0x036C
	int32 m_nSnapShotStartPoint; // 0x0370
	float32 m_flBoneVelocity; // 0x0374
	float32 m_flBoneVelocityMax; // 0x0378
	bool m_bCopyColor; // 0x037C
	bool m_bCopyAlpha; // 0x037D
	bool m_bSetRadius; // 0x037E
};
class C_OP_LerpToOtherAttribute : public CParticleFunctionOperator // particles
{
	CPerParticleFloatInput m_flInterpolation; // 0x01D0
	ParticleAttributeIndex_t m_nFieldInputFrom; // 0x0340
	ParticleAttributeIndex_t m_nFieldInput; // 0x0344
	ParticleAttributeIndex_t m_nFieldOutput; // 0x0348
};
class InfoForResourceTypeVMapResourceData_t // worldrenderer
{
};
class RnTriangle_t // physicslib
{
	int32[3] m_nIndex; // 0x0000
};
class FourVectors2D // physicslib
{
	fltx4 x; // 0x0000
	fltx4 y; // 0x0010
};
class CStopAtGoalUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	float32 m_flOuterRadius; // 0x0074
	float32 m_flInnerRadius; // 0x0078
	float32 m_flMaxScale; // 0x007C
	float32 m_flMinScale; // 0x0080
	CAnimInputDamping m_damping; // 0x0088
};
class CNmLayerBlendNode::LayerDefinition_t // animlib
{
	int16 m_nInputNodeIdx; // 0x0000
	int16 m_nWeightValueNodeIdx; // 0x0002
	int16 m_nBoneMaskValueNodeIdx; // 0x0004
	int16 m_nRootMotionWeightValueNodeIdx; // 0x0006
	bool m_bIsSynchronized; // 0x0008
	bool m_bIgnoreEvents; // 0x0009
	bool m_bIsStateMachineLayer; // 0x000A
	NmPoseBlendMode_t m_blendMode; // 0x000B
};
class CNmIKJoint // animlib
{
	int32 m_nParentIndex; // 0x0000
	int32 m_nBodyIndex; // 0x0004
	CTransform m_xLocalFrame; // 0x0010
	float32 m_flSwingLimit; // 0x0030
	float32 m_flMinTwistLimit; // 0x0034
	float32 m_flMaxTwistLimit; // 0x0038
	float32 m_flWeight; // 0x003C
};
class CNmRootMotionOverrideNode::CDefinition : public CNmPassthroughNode::CDefinition // animlib
{
	int16 m_desiredMovingVelocityNodeIdx; // 0x0018
	int16 m_desiredFacingDirectionNodeIdx; // 0x001A
	int16 m_linearVelocityLimitNodeIdx; // 0x001C
	int16 m_angularVelocityLimitNodeIdx; // 0x001E
	float32 m_maxLinearVelocity; // 0x0020
	float32 m_maxAngularVelocityRadians; // 0x0024
	CNmBitFlags m_overrideFlags; // 0x0028
};
class CFuseSymbolTable // mathlib_extended
{
	CUtlVector< ConstantInfo_t > m_constants; // 0x0000
	CUtlVector< VariableInfo_t > m_variables; // 0x0018
	CUtlVector< FunctionInfo_t > m_functions; // 0x0030
	CUtlHashtable< CUtlStringToken, int32 > m_constantMap; // 0x0048
	CUtlHashtable< CUtlStringToken, int32 > m_variableMap; // 0x0068
	CUtlHashtable< CUtlStringToken, int32 > m_functionMap; // 0x0088
};
class C_OP_SetControlPointOrientation : public CParticleFunctionPreEmission // particles
{
	bool m_bUseWorldLocation; // 0x01D8
	bool m_bRandomize; // 0x01DA
	bool m_bSetOnce; // 0x01DB
	int32 m_nCP; // 0x01DC
	int32 m_nHeadLocation; // 0x01E0
	QAngle m_vecRotation; // 0x01E4
	QAngle m_vecRotationB; // 0x01F0
	CParticleCollectionFloatInput m_flInterpolation; // 0x0200
};
class CModelConfig // modellib
{
	CUtlString m_ConfigName; // 0x0000
	CUtlVector< CModelConfigElement* > m_Elements; // 0x0008
	bool m_bTopLevel; // 0x0020
	bool m_bActiveInEditorByDefault; // 0x0021
};
class PermModelDataAnimatedMaterialAttribute_t // modellib
{
	CUtlString m_AttributeName; // 0x0000
	int32 m_nNumChannels; // 0x0008
};
class CNewParticleEffect : public IParticleEffect // particleslib
{
	CNewParticleEffect* m_pNext; // 0x0010
	CNewParticleEffect* m_pPrev; // 0x0018
	IParticleCollection* m_pParticles; // 0x0020
	char* m_pDebugName; // 0x0028
	bitfield:1 m_bDontRemove; // 0x0000
	bitfield:1 m_bRemove; // 0x0000
	bitfield:1 m_bNeedsBBoxUpdate; // 0x0000
	bitfield:1 m_bIsFirstFrame; // 0x0000
	bitfield:1 m_bAutoUpdateBBox; // 0x0000
	bitfield:1 m_bAllocated; // 0x0000
	bitfield:1 m_bSimulate; // 0x0000
	bitfield:1 m_bShouldPerformCullCheck; // 0x0000
	bitfield:1 m_bForceNoDraw; // 0x0000
	bitfield:1 m_bSuppressScreenSpaceEffect; // 0x0000
	bitfield:1 m_bShouldSave; // 0x0000
	bitfield:1 m_bShouldSimulateDuringGamePaused; // 0x0000
	bitfield:1 m_bShouldCheckFoW; // 0x0000
	bitfield:1 m_bIsAsyncCreate; // 0x0000
	bitfield:1 m_bFreezeTransitionActive; // 0x0000
	bitfield:1 m_bFreezeTargetState; // 0x0000
	bitfield:1 m_bCanFreeze; // 0x0000
	Vector m_vSortOrigin; // 0x0040
	float32 m_flScale; // 0x004C
	PARTICLE_EHANDLE__* m_hOwner; // 0x0050
	CParticleProperty* m_pOwningParticleProperty; // 0x0058
	float32 m_flFreezeTransitionStart; // 0x0070
	float32 m_flFreezeTransitionDuration; // 0x0074
	float32 m_flFreezeTransitionOverride; // 0x0078
	Vector m_LastMin; // 0x007C
	Vector m_LastMax; // 0x0088
	CSplitScreenSlot m_nSplitScreenUser; // 0x0094
	Vector m_vecAggregationCenter; // 0x0098
	int32 m_RefCount; // 0x00D0
};
class CNmBoneMaskValueNode::CDefinition : public CNmValueNode::CDefinition // animlib
{
};
class CNmParameterizedClipSelectorNode::CDefinition : public CNmClipReferenceNode::CDefinition // animlib
{
	CUtlLeanVectorFixedGrowable< int16, 5 > m_optionNodeIndices; // 0x0010
	CUtlLeanVectorFixedGrowable< uint8, 5 > m_optionWeights; // 0x0028
	int16 m_parameterNodeIdx; // 0x0038
	bool m_bIgnoreInvalidOptions; // 0x003A
	bool m_bHasWeightsSet; // 0x003B
};
class InfoForResourceTypeIMaterial2 // resourcesystem
{
};
class CClientAlphaProperty : public IClientAlphaProperty // client
{
	uint16 m_nDistFadeStart; // 0x0010
	uint16 m_nDistFadeEnd; // 0x0012
	bitfield:14 m_nDesyncOffset; // 0x0000
	bitfield:1 m_bAlphaOverride; // 0x0000
	bitfield:1 m_bShadowAlphaOverride; // 0x0000
	bitfield:3 m_nRenderMode; // 0x0000
	bitfield:5 m_nRenderFX; // 0x0000
	uint8 m_nAlpha; // 0x0017
	float32 m_flFadeScale; // 0x0018
	GameTime_t m_flRenderFxStartTime; // 0x001C
	float32 m_flRenderFxDuration; // 0x0020
};
class CFloatExponentialMovingAverage // server
{
};
class CGameChoreoServices : public IChoreoServices // server
{
	CHandle< CBaseAnimGraph > m_hOwner; // 0x0008
	CHandle< CScriptedSequence > m_hScriptedSequence; // 0x000C
	IChoreoServices::ScriptState_t m_scriptState; // 0x0010
	IChoreoServices::ChoreoState_t m_choreoState; // 0x0014
	GameTime_t m_flTimeStartedState; // 0x0018
};
class CStateMachineUpdateNode : public CAnimUpdateNodeBase // animgraphlib
{
	CAnimStateMachineUpdater m_stateMachine; // 0x0070
	CUtlVector< CStateNodeStateData > m_stateData; // 0x00C8
	CUtlVector< CStateNodeTransitionData > m_transitionData; // 0x00E0
	bool m_bBlockWaningTags; // 0x00FC
	bool m_bLockStateWhenWaning; // 0x00FD
	bool m_bResetWhenActivated; // 0x00FE
};
class InfoForResourceTypeProceduralTestResource_t // resourcesystem
{
};
class CSimpleSimTimer // server
{
	GameTime_t m_flNext; // 0x0000
	WorldGroupId_t m_nWorldGroupId; // 0x0004
};
class CNavVolumeMarkupVolume : public CNavVolume // server
{
};
class CVMixSteamAudioHybridReverbProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
};
class CVoiceContainerParameterBlender : public CVoiceContainerBase // soundsystem_voicecontainers
{
	CSoundContainerReference m_firstSound; // 0x00A8
	CSoundContainerReference m_secondSound; // 0x00C0
	bool m_bEnableOcclusionBlend; // 0x00D8
	CPiecewiseCurve m_curve1; // 0x00E0
	CPiecewiseCurve m_curve2; // 0x0120
	bool m_bEnableDistanceBlend; // 0x0160
	CPiecewiseCurve m_curve3; // 0x0168
	CPiecewiseCurve m_curve4; // 0x01A8
};
class CSeqBoneMaskList // animationsystem
{
	CBufferString m_sName; // 0x0000
	CUtlVector< int16 > m_nLocalBoneArray; // 0x0010
	CUtlVector< float32 > m_flBoneWeightArray; // 0x0028
	float32 m_flDefaultMorphCtrlWeight; // 0x0040
	CUtlVector< std::pair< CBufferString, float32 > > m_morphCtrlWeightArray; // 0x0048
};
class VPhysXRange_t // modellib
{
	float32 m_flMin; // 0x0000
	float32 m_flMax; // 0x0004
};
class C_OP_SetFloat : public CParticleFunctionOperator // particles
{
	CPerParticleFloatInput m_InputValue; // 0x01D0
	ParticleAttributeIndex_t m_nOutputField; // 0x0340
	ParticleSetMethod_t m_nSetMethod; // 0x0344
	CPerParticleFloatInput m_Lerp; // 0x0348
};
class IParticleSystemDefinition // particles
{
};
class TagSpan_t // animgraphlib
{
	int32 m_tagIndex; // 0x0000
	float32 m_startCycle; // 0x0004
	float32 m_endCycle; // 0x0008
};
class CSeqPoseParamDesc // animationsystem
{
	CBufferString m_sName; // 0x0000
	float32 m_flStart; // 0x0010
	float32 m_flEnd; // 0x0014
	float32 m_flLoop; // 0x0018
	bool m_bLooping; // 0x001C
};
class NmCompressionSettings_t // animlib
{
	NmCompressionSettings_t::QuantizationRange_t m_translationRangeX; // 0x0000
	NmCompressionSettings_t::QuantizationRange_t m_translationRangeY; // 0x0008
	NmCompressionSettings_t::QuantizationRange_t m_translationRangeZ; // 0x0010
	NmCompressionSettings_t::QuantizationRange_t m_scaleRange; // 0x0018
	Quaternion m_constantRotation; // 0x0020
	bool m_bIsRotationStatic; // 0x0030
	bool m_bIsTranslationStatic; // 0x0031
	bool m_bIsScaleStatic; // 0x0032
};
class FuseFunctionIndex_t // mathlib_extended
{
	uint16 m_Value; // 0x0000
};
class C_INIT_RemapNamedModelElementToScalar : public CParticleFunctionInitializer // particles
{
	CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x01D8
	CUtlVector< CUtlString > m_names; // 0x01E0
	CUtlVector< float32 > m_values; // 0x01F8
	ParticleAttributeIndex_t m_nFieldInput; // 0x0210
	ParticleAttributeIndex_t m_nFieldOutput; // 0x0214
	ParticleSetMethod_t m_nSetMethod; // 0x0218
	bool m_bModelFromRenderer; // 0x021C
};
class CSlowDownOnSlopesUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	float32 m_flSlowDownStrength; // 0x0070
};
class CNmTargetWarpEvent : public CNmEvent // animlib
{
	NmTargetWarpRule_t m_rule; // 0x0020
	NmTargetWarpAlgorithm_t m_algorithm; // 0x0021
};
class CPathAnimMotorUpdaterBase : public CAnimMotorUpdaterBase // animgraphlib
{
	bool m_bLockToPath; // 0x0020
};
class MaterialParamInt_t : public MaterialParam_t // materialsystem2
{
	int32 m_nValue; // 0x0008
};
class CHintMessage // server
{
	char* m_hintString; // 0x0000
	CUtlVector< char* > m_args; // 0x0008
	float32 m_duration; // 0x0020
};
class C_OP_FadeOutSimple : public CParticleFunctionOperator // particles
{
	float32 m_flFadeOutTime; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
};
class C_OP_EndCapTimedFreeze : public CParticleFunctionOperator // particles
{
	CParticleCollectionFloatInput m_flFreezeTime; // 0x01D0
};
class VMixFilterDesc_t // soundsystem_lowlevel
{
	VMixFilterType_t m_nFilterType; // 0x0000
	VMixFilterSlope_t m_nFilterSlope; // 0x0002
	bool m_bEnabled; // 0x0003
	float32 m_fldbGain; // 0x0004
	float32 m_flCutoffFreq; // 0x0008
	float32 m_flQ; // 0x000C
};
class CFootCycle : public CCycleBase // modellib
{
};
class PulseCursorID_t // pulse_runtime_lib
{
	int32 m_Value; // 0x0000
};
class CAnimFoot // modellib
{
	CUtlString m_name; // 0x0000
	Vector m_vBallOffset; // 0x0008
	Vector m_vHeelOffset; // 0x0014
	int32 m_ankleBoneIndex; // 0x0020
	int32 m_toeBoneIndex; // 0x0024
};
class InfoForResourceTypeCEntityLump // resourcesystem
{
};
class EntOutput_t // entity2
{
};
class C_INIT_RandomRadius : public CParticleFunctionInitializer // particles
{
	float32 m_flRadiusMin; // 0x01D8
	float32 m_flRadiusMax; // 0x01DC
	float32 m_flRadiusRandExponent; // 0x01E0
};
class WorldBuilderParams_t // worldrenderer
{
	float32 m_flMinDrawVolumeSize; // 0x0000
	bool m_bBuildBakedLighting; // 0x0004
	bool m_bAggregateInstanceStreams; // 0x0005
	BakedLightingInfo_t m_bakedLightingInfo; // 0x0008
	uint64 m_nCompileTimestamp; // 0x0050
	uint64 m_nCompileFingerprint; // 0x0058
};
class InfoForResourceTypeCJavaScriptResource // resourcesystem
{
};
class ParticleChildrenInfo_t // particles
{
	CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_ChildRef; // 0x0000
	float32 m_flDelay; // 0x0008
	bool m_bEndCap; // 0x000C
	bool m_bDisableChild; // 0x000D
	ParticleDetailLevel_t m_nDetailLevel; // 0x0010
};
class ModelReference_t // particles
{
	CStrongHandle< InfoForResourceTypeCModel > m_model; // 0x0000
	float32 m_flRelativeProbabilityOfSpawn; // 0x0008
};
class CAddUpdateNode : public CBinaryUpdateNode // animgraphlib
{
	BinaryNodeChildOption m_footMotionTiming; // 0x0094
	bool m_bApplyToFootMotion; // 0x0098
	bool m_bApplyChannelsSeparately; // 0x0099
	bool m_bUseModelSpace; // 0x009A
	bool m_bApplyScale; // 0x009B
};
class CNmLegacyEvent : public CNmEvent // animlib
{
	CUtlString m_animEventClassName; // 0x0020
	KeyValues3 m_KV; // 0x0028
};
class CEntityIOOutput // entity2
{
};
class EventServerProcessNetworking_t : public EventSimulate_t // engine2
{
};
class EventServerPollNetworking_t : public EventSimulate_t // engine2
{
};
class C_INIT_RemapQAnglesToRotation : public CParticleFunctionInitializer // particles
{
	CParticleTransformInput m_TransformInput; // 0x01D8
};
class C_OP_LockToBone : public CParticleFunctionOperator // particles
{
	CParticleModelInput m_modelInput; // 0x01D0
	CParticleTransformInput m_transformInput; // 0x0230
	float32 m_flLifeTimeFadeStart; // 0x0298
	float32 m_flLifeTimeFadeEnd; // 0x029C
	float32 m_flJumpThreshold; // 0x02A0
	float32 m_flPrevPosScale; // 0x02A4
	char[128] m_HitboxSetName; // 0x02A8
	bool m_bRigid; // 0x0328
	bool m_bUseBones; // 0x0329
	ParticleAttributeIndex_t m_nFieldOutput; // 0x032C
	ParticleAttributeIndex_t m_nFieldOutputPrev; // 0x0330
	ParticleRotationLockType_t m_nRotationSetType; // 0x0334
	bool m_bRigidRotationLock; // 0x0338
	CPerParticleVecInput m_vecRotation; // 0x0340
	CPerParticleFloatInput m_flRotLerp; // 0x09F8
};
class MaterialVariable_t // particles
{
	CUtlString m_strVariable; // 0x0000
	ParticleAttributeIndex_t m_nVariableField; // 0x0008
	float32 m_flScale; // 0x000C
};
class FeTri_t // physicslib
{
	uint16[3] nNode; // 0x0000
	float32 w1; // 0x0008
	float32 w2; // 0x000C
	float32 v1x; // 0x0010
	Vector2D v2; // 0x0014
};
class CNmCachedBoolNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	NmCachedValueMode_t m_mode; // 0x0014
};
class CFootMotion // modellib
{
	CUtlVector< CFootStride > m_strides; // 0x0000
	CUtlString m_name; // 0x0018
	bool m_bAdditive; // 0x0020
};
class CEnumAnimParameter : public CConcreteAnimParameter // animgraphlib
{
	uint8 m_defaultValue; // 0x0088
	CUtlVector< CUtlString > m_enumOptions; // 0x0090
	CUtlVector< uint64 > m_vecEnumReferenced; // 0x00A8
};
class InfoForResourceTypeCTestResourceData // resourcesystem
{
};
class AggregateSceneObject_t // worldrenderer
{
	ObjectTypeFlags_t m_allFlags; // 0x0000
	ObjectTypeFlags_t m_anyFlags; // 0x0004
	int16 m_nLayer; // 0x0008
	int16 m_instanceStream; // 0x000A
	int16 m_vertexAlbedoStream; // 0x000C
	CUtlVector< AggregateMeshInfo_t > m_aggregateMeshes; // 0x0010
	CUtlVector< AggregateLODSetup_t > m_lodSetups; // 0x0028
	CUtlVector< uint16 > m_visClusterMembership; // 0x0040
	CUtlVector< matrix3x4_t > m_fragmentTransforms; // 0x0058
	CStrongHandle< InfoForResourceTypeCModel > m_renderableModel; // 0x0070
};
class CVMixPitchShiftProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixPitchShiftDesc_t m_desc; // 0x0020
};
class CSingleFrameUpdateNode : public CLeafUpdateNode // animgraphlib
{
	CUtlVector< CSmartPtr< CAnimActionUpdater > > m_actions; // 0x0058
	CPoseHandle m_hPoseCacheHandle; // 0x0070
	HSequence m_hSequence; // 0x0074
	float32 m_flCycle; // 0x0078
};
class CNmBoneMaskSwitchNode::CDefinition : public CNmBoneMaskValueNode::CDefinition // animlib
{
	int16 m_nSwitchValueNodeIdx; // 0x0010
	int16 m_nTrueValueNodeIdx; // 0x0012
	int16 m_nFalseValueNodeIdx; // 0x0014
	float32 m_flBlendTimeSeconds; // 0x0018
	bool m_bSwitchDynamically; // 0x001C
};
class CHitReactUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	HitReactFixedSettings_t m_opFixedSettings; // 0x0070
	CAnimParamHandle m_triggerParam; // 0x00BC
	CAnimParamHandle m_hitBoneParam; // 0x00BE
	CAnimParamHandle m_hitOffsetParam; // 0x00C0
	CAnimParamHandle m_hitDirectionParam; // 0x00C2
	CAnimParamHandle m_hitStrengthParam; // 0x00C4
	float32 m_flMinDelayBetweenHits; // 0x00C8
	bool m_bResetChild; // 0x00CC
};
class CNmEventConsumerAttributes : public CNmEventConsumer // server
{
};
class C_INIT_CreateAlongPath : public CParticleFunctionInitializer // particles
{
	float32 m_fMaxDistance; // 0x01D8
	CPathParameters m_PathParams; // 0x01E0
	bool m_bUseRandomCPs; // 0x0220
	Vector m_vEndOffset; // 0x0224
	bool m_bSaveOffset; // 0x0230
};
class FeNodeWindBase_t // physicslib
{
	uint16 nNodeX0; // 0x0000
	uint16 nNodeX1; // 0x0002
	uint16 nNodeY0; // 0x0004
	uint16 nNodeY1; // 0x0006
};
class MotionIndex // animgraphlib
{
	uint16 m_nGroup; // 0x0000
	uint16 m_nMotion; // 0x0002
};
class CLeanMatrixUpdateNode : public CLeafUpdateNode // animgraphlib
{
	int32[3][3] m_frameCorners; // 0x005C
	CPoseHandle[9] m_poses; // 0x0080
	CAnimInputDamping m_damping; // 0x00A8
	AnimVectorSource m_blendSource; // 0x00C0
	CAnimParamHandle m_paramIndex; // 0x00C4
	Vector m_verticalAxis; // 0x00C8
	Vector m_horizontalAxis; // 0x00D4
	HSequence m_hSequence; // 0x00E0
	float32 m_flMaxValue; // 0x00E4
	int32 m_nSequenceMaxFrame; // 0x00E8
};
class PulseRuntimeCellIndex_t // pulse_runtime_lib
{
	int32 m_Value; // 0x0000
};
class AmmoTypeInfo_t // server
{
	int32 m_nMaxCarry; // 0x0010
	CRangeInt m_nSplashSize; // 0x001C
	AmmoFlags_t m_nFlags; // 0x0024
	float32 m_flMass; // 0x0028
	CRangeFloat m_flSpeed; // 0x002C
};
class C_OP_LocalAccelerationForce : public CParticleFunctionForce // particles
{
	int32 m_nCP; // 0x01E0
	int32 m_nScaleCP; // 0x01E4
	CParticleCollectionVecInput m_vecAccel; // 0x01E8
};
class C_OP_LerpEndCapVector : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	Vector m_vecOutput; // 0x01D4
	float32 m_flLerpTime; // 0x01E0
};
class C_INIT_InheritVelocity : public CParticleFunctionInitializer // particles
{
	int32 m_nControlPointNumber; // 0x01D8
	float32 m_flVelocityScale; // 0x01DC
};
class C_OP_RampScalarLinearSimple : public CParticleFunctionOperator // particles
{
	float32 m_Rate; // 0x01D0
	float32 m_flStartTime; // 0x01D4
	float32 m_flEndTime; // 0x01D8
	ParticleAttributeIndex_t m_nField; // 0x0200
};
class C_OP_RenderClientPhysicsImpulse : public CParticleFunctionRenderer // particles
{
	CPerParticleFloatInput m_flRadius; // 0x0220
	CPerParticleFloatInput m_flMagnitude; // 0x0390
	int32 m_nSimIdFilter; // 0x0500
};
class ParticleNamedValueSource_t // particleslib
{
	CUtlString m_Name; // 0x0000
	bool m_IsPublic; // 0x0008
	CPulseValueFullType m_ValueType; // 0x0010
	ParticleNamedValueConfiguration_t m_DefaultConfig; // 0x0028
};
class CNmTimeConditionNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_sourceStateNodeIdx; // 0x0010
	int16 m_nInputValueNodeIdx; // 0x0012
	float32 m_flComparand; // 0x0014
	CNmTimeConditionNode::ComparisonType_t m_type; // 0x0018
	CNmTimeConditionNode::Operator_t m_operator; // 0x0019
};
class CPulse_OutputConnection // pulse_runtime_lib
{
	PulseSymbol_t m_SourceOutput; // 0x0000
	PulseSymbol_t m_TargetEntity; // 0x0010
	PulseSymbol_t m_TargetInput; // 0x0020
	PulseSymbol_t m_Param; // 0x0030
};
class ChainToSolveData_t // animgraphlib
{
	int32 m_nChainIndex; // 0x0000
	IKSolverSettings_t m_SolverSettings; // 0x0004
	IKTargetSettings_t m_TargetSettings; // 0x0010
	SolveIKChainAnimNodeDebugSetting m_DebugSetting; // 0x0038
	float32 m_flDebugNormalizedValue; // 0x003C
	VectorAligned m_vDebugOffset; // 0x0040
};
class CNmFloatCurveNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	CPiecewiseCurve m_curve; // 0x0018
};
class CFlexRule // modellib
{
	int32 m_nFlex; // 0x0000
	CUtlVector< CFlexOp > m_FlexOps; // 0x0008
};
class CParticleFloatInput : public CParticleInput // particleslib
{
	ParticleFloatType_t m_nType; // 0x0010
	ParticleFloatMapType_t m_nMapType; // 0x0014
	float32 m_flLiteralValue; // 0x0018
	CParticleNamedValueRef m_NamedValue; // 0x0020
	int32 m_nControlPoint; // 0x0060
	ParticleAttributeIndex_t m_nScalarAttribute; // 0x0064
	ParticleAttributeIndex_t m_nVectorAttribute; // 0x0068
	int32 m_nVectorComponent; // 0x006C
	bool m_bReverseOrder; // 0x0070
	float32 m_flRandomMin; // 0x0074
	float32 m_flRandomMax; // 0x0078
	bool m_bHasRandomSignFlip; // 0x007C
	int32 m_nRandomSeed; // 0x0080
	ParticleFloatRandomMode_t m_nRandomMode; // 0x0084
	CUtlString m_strSnapshotSubset; // 0x0090
	float32 m_flLOD0; // 0x0098
	float32 m_flLOD1; // 0x009C
	float32 m_flLOD2; // 0x00A0
	float32 m_flLOD3; // 0x00A4
	ParticleAttributeIndex_t m_nNoiseInputVectorAttribute; // 0x00A8
	float32 m_flNoiseOutputMin; // 0x00AC
	float32 m_flNoiseOutputMax; // 0x00B0
	float32 m_flNoiseScale; // 0x00B4
	Vector m_vecNoiseOffsetRate; // 0x00B8
	float32 m_flNoiseOffset; // 0x00C4
	int32 m_nNoiseOctaves; // 0x00C8
	PFNoiseTurbulence_t m_nNoiseTurbulence; // 0x00CC
	PFNoiseType_t m_nNoiseType; // 0x00D0
	PFNoiseModifier_t m_nNoiseModifier; // 0x00D4
	float32 m_flNoiseTurbulenceScale; // 0x00D8
	float32 m_flNoiseTurbulenceMix; // 0x00DC
	float32 m_flNoiseImgPreviewScale; // 0x00E0
	bool m_bNoiseImgPreviewLive; // 0x00E4
	float32 m_flNoCameraFallback; // 0x00F0
	bool m_bUseBoundsCenter; // 0x00F4
	ParticleFloatInputMode_t m_nInputMode; // 0x00F8
	float32 m_flMultFactor; // 0x00FC
	float32 m_flInput0; // 0x0100
	float32 m_flInput1; // 0x0104
	float32 m_flOutput0; // 0x0108
	float32 m_flOutput1; // 0x010C
	float32 m_flNotchedRangeMin; // 0x0110
	float32 m_flNotchedRangeMax; // 0x0114
	float32 m_flNotchedOutputOutside; // 0x0118
	float32 m_flNotchedOutputInside; // 0x011C
	ParticleFloatRoundType_t m_nRoundType; // 0x0120
	ParticleFloatBiasType_t m_nBiasType; // 0x0124
	float32 m_flBiasParameter; // 0x0128
	CPiecewiseCurve m_Curve; // 0x0130
};
class AttachmentHandle_t // modellib
{
	uint8 m_Value; // 0x0000
};
class C_OP_RemapCPtoCP : public CParticleFunctionPreEmission // particles
{
	int32 m_nInputControlPoint; // 0x01D8
	int32 m_nOutputControlPoint; // 0x01DC
	int32 m_nInputField; // 0x01E0
	int32 m_nOutputField; // 0x01E4
	float32 m_flInputMin; // 0x01E8
	float32 m_flInputMax; // 0x01EC
	float32 m_flOutputMin; // 0x01F0
	float32 m_flOutputMax; // 0x01F4
	bool m_bDerivative; // 0x01F8
	float32 m_flInterpRate; // 0x01FC
};
class CSeqIKLock // animationsystem
{
	float32 m_flPosWeight; // 0x0000
	float32 m_flAngleWeight; // 0x0004
	int16 m_nLocalBone; // 0x0008
	bool m_bBonesOrientedAlongPositiveX; // 0x000A
};
class CAnimAttachment // modellib
{
	Quaternion[3] m_influenceRotations; // 0x0000
	VectorAligned[3] m_influenceOffsets; // 0x0030
	int32[3] m_influenceIndices; // 0x0060
	float32[3] m_influenceWeights; // 0x006C
	uint8 m_numInfluences; // 0x0078
};
class inv_image_map_t // client
{
	CUtlString map_name; // 0x0000
	float32 map_rotation; // 0x0008
};
class AggregateRTProxySceneObject_t // worldrenderer
{
	int16 m_nLayer; // 0x0000
	CUtlVector< RTProxyBLAS_t > m_BLASes; // 0x0008
	CUtlVector< RTProxyInstanceInfo_t > m_Instances; // 0x0020
	CUtlBinaryBlock m_VBData; // 0x0038
	CUtlBinaryBlock m_IBData; // 0x0048
	CUtlBinaryBlock m_InstanceAlbedoData; // 0x0058
};
class CVoxelVisibility // worldrenderer
{
	uint32 m_nBaseClusterCount; // 0x0040
	uint32 m_nPVSBytesPerCluster; // 0x0044
	Vector m_vMinBounds; // 0x0048
	Vector m_vMaxBounds; // 0x0054
	float32 m_flGridSize; // 0x0060
	uint32 m_nSkyVisibilityCluster; // 0x0064
	uint32 m_nSunVisibilityCluster; // 0x0068
	VoxelVisBlockOffset_t m_NodeBlock; // 0x006C
	VoxelVisBlockOffset_t m_RegionBlock; // 0x0074
	VoxelVisBlockOffset_t m_EnclosedClusterListBlock; // 0x007C
	VoxelVisBlockOffset_t m_EnclosedClustersBlock; // 0x0084
	VoxelVisBlockOffset_t m_MasksBlock; // 0x008C
	VoxelVisBlockOffset_t m_nVisBlocks; // 0x0094
};
class VMixModDelayDesc_t // soundsystem_lowlevel
{
	VMixFilterDesc_t m_feedbackFilter; // 0x0000
	bool m_bPhaseInvert; // 0x0010
	float32 m_flGlideTime; // 0x0014
	float32 m_flDelay; // 0x0018
	float32 m_flOutputGain; // 0x001C
	float32 m_flFeedbackGain; // 0x0020
	float32 m_flModRate; // 0x0024
	float32 m_flModDepth; // 0x0028
	bool m_bApplyAntialiasing; // 0x002C
};
class SkeletonAnimCapture_t::FrameStamp_t // modellib
{
	float32 m_flTime; // 0x0000
	float32 m_flEntitySimTime; // 0x0004
	bool m_bTeleportTick; // 0x0008
	bool m_bPredicted; // 0x0009
	float32 m_flCurTime; // 0x000C
	float32 m_flRealTime; // 0x0010
	int32 m_nFrameCount; // 0x0014
	int32 m_nTickCount; // 0x0018
};
class NmSyncTrackTime_t // animlib
{
	int32 m_nEventIdx; // 0x0000
	NmPercent_t m_percentageThrough; // 0x0004
};
class CNmBoneMaskNode::CDefinition : public CNmBoneMaskValueNode::CDefinition // animlib
{
	CGlobalSymbol m_boneMaskID; // 0x0010
};
class CFootStepTriggerUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	CUtlVector< FootStepTrigger > m_triggers; // 0x0070
	float32 m_flTolerance; // 0x008C
};
class C_INIT_VelocityRadialRandom : public CParticleFunctionInitializer // particles
{
	bool m_bPerParticleCenter; // 0x01D8
	int32 m_nControlPointNumber; // 0x01DC
	CPerParticleVecInput m_vecPosition; // 0x01E0
	CPerParticleVecInput m_vecFwd; // 0x0898
	CPerParticleFloatInput m_fSpeedMin; // 0x0F50
	CPerParticleFloatInput m_fSpeedMax; // 0x10C0
	Vector m_vecLocalCoordinateSystemSpeedScale; // 0x1230
	bool m_bIgnoreDelta; // 0x123D
};
class C_INIT_RemapNamedModelMeshGroupToScalar : public C_INIT_RemapNamedModelElementToScalar // particles
{
};
class EntityIOConnectionData_t // worldrenderer
{
	CUtlString m_outputName; // 0x0000
	uint32 m_targetType; // 0x0008
	CUtlString m_targetName; // 0x0010
	CUtlString m_inputName; // 0x0018
	CUtlString m_overrideParam; // 0x0020
	float32 m_flDelay; // 0x0028
	int32 m_nTimesToFire; // 0x002C
	KeyValues3 m_paramMap; // 0x0030
};
class CParamSpanUpdater // animgraphlib
{
	CUtlVector< ParamSpan_t > m_spans; // 0x0000
};
class CParticleCollectionRendererFloatInput : public CParticleCollectionFloatInput // particleslib
{
};
class CNmFloatRangeComparisonNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	Range_t m_range; // 0x0010
	int16 m_nInputValueNodeIdx; // 0x0018
	bool m_bIsInclusiveCheck; // 0x001A
};
class InfoForResourceTypeIAnimGraphModelBinding // resourcesystem
{
};
class InfoForResourceTypeIParticleSnapshot // resourcesystem
{
};
class C_OP_SetControlPointToVectorExpression : public CParticleFunctionPreEmission // particles
{
	VectorExpressionType_t m_nExpression; // 0x01D8
	int32 m_nOutputCP; // 0x01DC
	CParticleCollectionVecInput m_vInput1; // 0x01E0
	CParticleCollectionVecInput m_vInput2; // 0x0898
	CPerParticleFloatInput m_flLerp; // 0x0F50
	bool m_bNormalizedOutput; // 0x10C0
};
class CPathParameters // particles
{
	int32 m_nStartControlPointNumber; // 0x0000
	int32 m_nEndControlPointNumber; // 0x0004
	int32 m_nBulgeControl; // 0x0008
	float32 m_flBulge; // 0x000C
	float32 m_flMidPoint; // 0x0010
	Vector m_vStartPointOffset; // 0x0014
	Vector m_vMidPointOffset; // 0x0020
	Vector m_vEndOffset; // 0x002C
};
class C_INIT_InitFromVectorFieldSnapshot : public CParticleFunctionInitializer // particles
{
	int32 m_nControlPointNumber; // 0x01D8
	int32 m_nLocalSpaceCP; // 0x01DC
	int32 m_nWeightUpdateCP; // 0x01E0
	bool m_bUseVerticalVelocity; // 0x01E4
	CPerParticleVecInput m_vecScale; // 0x01E8
};
class CSosGroupActionSoundeventCountSchema : public CSosGroupActionSchema // soundsystem
{
	bool m_bExcludeStoppedSounds; // 0x0008
	CUtlString m_strCountKeyName; // 0x0010
};
class CVoiceContainerTapePlayer : public CVoiceContainerAsyncGenerator // soundsystem_voicecontainers
{
	bool m_bShouldWraparound; // 0x00B8
	CStrongHandle< InfoForResourceTypeCVoiceContainerBase > m_sourceAudio; // 0x00C0
	float32 m_flTapeSpeedAttackTime; // 0x00C8
	float32 m_flTapeSpeedReleaseTime; // 0x00CC
};
class CNmVirtualParameterVectorNode::CDefinition : public CNmVectorValueNode::CDefinition // animlib
{
	int16 m_nChildNodeIdx; // 0x0010
};
class CNmConstIDNode::CDefinition : public CNmIDValueNode::CDefinition // animlib
{
	CGlobalSymbol m_value; // 0x0010
};
class EventServerPostAdvanceTick_t : public EventPostAdvanceTick_t // engine2
{
	bool m_bLastTickBeforeClientUpdate; // 0x0040
};
class TextureControls_t // particles
{
	CParticleCollectionRendererFloatInput m_flFinalTextureScaleU; // 0x0000
	CParticleCollectionRendererFloatInput m_flFinalTextureScaleV; // 0x0170
	CParticleCollectionRendererFloatInput m_flFinalTextureOffsetU; // 0x02E0
	CParticleCollectionRendererFloatInput m_flFinalTextureOffsetV; // 0x0450
	CParticleCollectionRendererFloatInput m_flFinalTextureUVRotation; // 0x05C0
	CParticleCollectionRendererFloatInput m_flZoomScale; // 0x0730
	CParticleCollectionRendererFloatInput m_flDistortion; // 0x08A0
	bool m_bRandomizeOffsets; // 0x0A10
	bool m_bClampUVs; // 0x0A11
	SpriteCardPerParticleScale_t m_nPerParticleBlend; // 0x0A14
	SpriteCardPerParticleScale_t m_nPerParticleScale; // 0x0A18
	SpriteCardPerParticleScale_t m_nPerParticleOffsetU; // 0x0A1C
	SpriteCardPerParticleScale_t m_nPerParticleOffsetV; // 0x0A20
	SpriteCardPerParticleScale_t m_nPerParticleRotation; // 0x0A24
	SpriteCardPerParticleScale_t m_nPerParticleZoom; // 0x0A28
	SpriteCardPerParticleScale_t m_nPerParticleDistortion; // 0x0A2C
};
class PermEntityLumpData_t // worldrenderer
{
	CUtlString m_name; // 0x0008
	CUtlVector< CStrongHandleCopyable< InfoForResourceTypeCEntityLump > > m_childLumps; // 0x0010
	CUtlLeanVector< EntityKeyValueData_t > m_entityKeyValues; // 0x0028
};
class VMixPitchShiftDesc_t // soundsystem_lowlevel
{
	int32 m_nGrainSampleCount; // 0x0000
	float32 m_flPitchShift; // 0x0004
	int32 m_nQuality; // 0x0008
	int32 m_nProcType; // 0x000C
};
class CNmVectorInfoNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	CNmVectorInfoNode::Info_t m_desiredInfo; // 0x0012
};
class CModelConfigList // modellib
{
	bool m_bHideMaterialGroupInTools; // 0x0000
	bool m_bHideRenderColorInTools; // 0x0001
	CUtlVector< CModelConfig* > m_Configs; // 0x0008
};
class CNmCurrentSyncEventIDNode::CDefinition : public CNmIDValueNode::CDefinition // animlib
{
	int16 m_nSourceStateNodeIdx; // 0x0010
};
class CFootTrajectory // modellib
{
	Vector m_vOffset; // 0x0008
	float32 m_flRotationOffset; // 0x0014
	float32 m_flProgression; // 0x0018
};
class InfoForResourceTypeCResponseRulesList // resourcesystem
{
};
class SimpleConstraintSoundProfile // server
{
	float32 m_flKeyPointMinSoundThreshold; // 0x0008
	float32 m_flKeyPointMaxSoundThreshold; // 0x000C
	float32 m_reversalSoundThresholdSmall; // 0x0010
	float32 m_reversalSoundThresholdMedium; // 0x0014
	float32 m_reversalSoundThresholdLarge; // 0x0018
};
class AggregateVertexAlbedoStreamOnDiskData_t // worldrenderer
{
	CUtlBinaryBlock m_BufferData; // 0x0000
};
class AnimationSnapshot_t : public AnimationSnapshotBase_t // animationsystem
{
	int32 m_nEntIndex; // 0x0110
	CUtlString m_modelName; // 0x0118
};
class LookAtBone_t // animgraphlib
{
	int32 m_index; // 0x0000
	float32 m_weight; // 0x0004
};
class CNmValueNode::CDefinition : public CNmGraphNode::CDefinition // animlib
{
};
class VMixDynamicsBand_t // soundsystem_lowlevel
{
	float32 m_fldbGainInput; // 0x0000
	float32 m_fldbGainOutput; // 0x0004
	float32 m_fldbThresholdBelow; // 0x0008
	float32 m_fldbThresholdAbove; // 0x000C
	float32 m_flRatioBelow; // 0x0010
	float32 m_flRatioAbove; // 0x0014
	float32 m_flAttackTimeMS; // 0x0018
	float32 m_flReleaseTimeMS; // 0x001C
	bool m_bEnable; // 0x0020
	bool m_bSolo; // 0x0021
};
class CPulse_RegisterInfo // pulse_runtime_lib
{
	PulseRuntimeRegisterIndex_t m_nReg; // 0x0000
	CPulseValueFullType m_Type; // 0x0008
	CKV3MemberNameWithStorage m_OriginName; // 0x0020
	int32 m_nWrittenByInstruction; // 0x0058
	int32 m_nLastReadByInstruction; // 0x005C
};
class CNmAnimationPoseNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
	int16 m_nPoseTimeValueNodeIdx; // 0x0010
	int16 m_nDataSlotIdx; // 0x0012
	Range_t m_inputTimeRemapRange; // 0x0014
	float32 m_flUserSpecifiedTime; // 0x001C
	bool m_bUseFramesAsInput; // 0x0020
};
class NavGravity_t // navlib
{
	Vector m_vGravity; // 0x0000
	bool m_bDefault; // 0x000C
};
class C_INIT_CreateSequentialPath : public CParticleFunctionInitializer // particles
{
	float32 m_fMaxDistance; // 0x01D8
	float32 m_flNumToAssign; // 0x01DC
	bool m_bLoop; // 0x01E0
	bool m_bCPPairs; // 0x01E1
	bool m_bSaveOffset; // 0x01E2
	CPathParameters m_PathParams; // 0x01F0
};
class C_OP_SetUserEvent : public CParticleFunctionOperator // particles
{
	CPerParticleFloatInput m_flInput; // 0x01D0
	CPerParticleFloatInput m_flRisingEdge; // 0x0340
	EventTypeSelection_t m_nRisingEventType; // 0x04B0
	CPerParticleFloatInput m_flFallingEdge; // 0x04B8
	EventTypeSelection_t m_nFallingEventType; // 0x0628
};
class VMixUtilityDesc_t // soundsystem_lowlevel
{
	VMixChannelOperation_t m_nOp; // 0x0000
	float32 m_flInputPan; // 0x0004
	float32 m_flOutputBalance; // 0x0008
	float32 m_fldbOutputGain; // 0x000C
	bool m_bBassMono; // 0x0010
	float32 m_flBassFreq; // 0x0014
};
class FeTaperedCapsuleRigid_t // physicslib
{
	fltx4[2] vSphere; // 0x0000
	uint16 nNode; // 0x0020
	uint16 nCollisionMask; // 0x0022
	uint16 nVertexMapIndex; // 0x0024
	uint16 nFlags; // 0x0026
};
class CMotionGraphGroup // animgraphlib
{
	CMotionSearchDB m_searchDB; // 0x0000
	CUtlVector< CSmartPtr< CMotionGraph > > m_motionGraphs; // 0x00B8
	CUtlVector< CMotionGraphConfig > m_motionGraphConfigs; // 0x00D0
	CUtlVector< int32 > m_sampleToConfig; // 0x00E8
	AnimScriptHandle m_hIsActiveScript; // 0x0100
};
class CBtNode // server
{
};
class C_OP_ClampScalar : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	CPerParticleFloatInput m_flOutputMin; // 0x01D8
	CPerParticleFloatInput m_flOutputMax; // 0x0348
};
class C_OP_WorldTraceConstraint : public CParticleFunctionConstraint // particles
{
	int32 m_nCP; // 0x01D0
	Vector m_vecCpOffset; // 0x01D4
	ParticleCollisionMode_t m_nCollisionMode; // 0x01E0
	ParticleCollisionMode_t m_nCollisionModeMin; // 0x01E4
	ParticleTraceSet_t m_nTraceSet; // 0x01E8
	char[128] m_CollisionGroupName; // 0x01EC
	bool m_bWorldOnly; // 0x026C
	bool m_bBrushOnly; // 0x026D
	bool m_bIncludeWater; // 0x026E
	int32 m_nIgnoreCP; // 0x0270
	float32 m_flCpMovementTolerance; // 0x0274
	float32 m_flRetestRate; // 0x0278
	float32 m_flTraceTolerance; // 0x027C
	float32 m_flCollisionConfirmationSpeed; // 0x0280
	float32 m_nMaxTracesPerFrame; // 0x0284
	CPerParticleFloatInput m_flRadiusScale; // 0x0288
	CPerParticleFloatInput m_flBounceAmount; // 0x03F8
	CPerParticleFloatInput m_flSlideAmount; // 0x0568
	CPerParticleFloatInput m_flRandomDirScale; // 0x06D8
	bool m_bDecayBounce; // 0x0848
	bool m_bKillonContact; // 0x0849
	float32 m_flMinSpeed; // 0x084C
	bool m_bSetNormal; // 0x0850
	ParticleAttributeIndex_t m_nStickOnCollisionField; // 0x0854
	CPerParticleFloatInput m_flStopSpeed; // 0x0858
	ParticleAttributeIndex_t m_nEntityStickDataField; // 0x09C8
	ParticleAttributeIndex_t m_nEntityStickNormalField; // 0x09CC
};
class C_INIT_RemapInitialVisibilityScalar : public CParticleFunctionInitializer // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01DC
	float32 m_flInputMin; // 0x01E0
	float32 m_flInputMax; // 0x01E4
	float32 m_flOutputMin; // 0x01E8
	float32 m_flOutputMax; // 0x01EC
};
class CStateMachineComponentUpdater : public CAnimComponentUpdater // animgraphlib
{
	CAnimStateMachineUpdater m_stateMachine; // 0x0030
};
class CAnimEnum // animationsystem
{
	uint8 m_value; // 0x0000
};
class CMeshletDescriptor // modellib
{
	PackedAABB_t m_PackedAABB; // 0x0000
	CDrawCullingData m_CullingData; // 0x0008
	uint32 m_nVertexOffset; // 0x000C
	uint32 m_nTriangleOffset; // 0x0010
	uint8 m_nVertexCount; // 0x0014
	uint8 m_nTriangleCount; // 0x0015
};
class CRagdollUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	int32 m_nWeightListIndex; // 0x0070
	RagdollPoseControl m_poseControlMethod; // 0x0074
};
class PulseRuntimeStateOffset_t // pulse_runtime_lib
{
	uint16 m_Value; // 0x0000
};
class PostProcessingFogScatteringParameters_t // materialsystem2
{
	float32 m_fRadius; // 0x0000
	float32 m_fScale; // 0x0004
	float32 m_fCubemapScale; // 0x0008
	float32 m_fVolumetricScale; // 0x000C
	float32 m_fGradientScale; // 0x0010
};
class C_INIT_RemapParticleCountToNamedModelSequenceScalar : public C_INIT_RemapParticleCountToNamedModelElementScalar // particles
{
};
class CPairedSequenceUpdateNode : public CSequenceUpdateNodeBase // animgraphlib
{
	CGlobalSymbol m_sPairedSequenceRole; // 0x0078
};
class FootLockPoseOpFixedSettings // animgraphlib
{
	CUtlVector< FootFixedData_t > m_footInfo; // 0x0000
	CAnimInputDamping m_hipDampingSettings; // 0x0018
	int32 m_nHipBoneIndex; // 0x0030
	IKSolverType m_ikSolverType; // 0x0034
	bool m_bApplyTilt; // 0x0038
	bool m_bApplyHipDrop; // 0x0039
	bool m_bAlwaysUseFallbackHinge; // 0x003A
	bool m_bApplyFootRotationLimits; // 0x003B
	bool m_bApplyLegTwistLimits; // 0x003C
	float32 m_flMaxFootHeight; // 0x0040
	float32 m_flExtensionScale; // 0x0044
	float32 m_flMaxLegTwist; // 0x0048
	bool m_bEnableLockBreaking; // 0x004C
	float32 m_flLockBreakTolerance; // 0x0050
	float32 m_flLockBlendTime; // 0x0054
	bool m_bEnableStretching; // 0x0058
	float32 m_flMaxStretchAmount; // 0x005C
	float32 m_flStretchExtensionScale; // 0x0060
};
class PulseCursorYieldToken_t // pulse_runtime_lib
{
	int32 m_Value; // 0x0000
};
class PostProcessingVignetteParameters_t // materialsystem2
{
	float32 m_flVignetteStrength; // 0x0000
	Vector2D m_vCenter; // 0x0004
	float32 m_flRadius; // 0x000C
	float32 m_flRoundness; // 0x0010
	float32 m_flFeather; // 0x0014
	Vector m_vColorTint; // 0x0018
};
class inv_image_light_barn_t // client
{
	Vector color; // 0x0000
	QAngle angle; // 0x000C
	float32 brightness; // 0x0018
	float32 orbit_distance; // 0x001C
};
class C_OP_VectorFieldSnapshot : public CParticleFunctionOperator // particles
{
	int32 m_nControlPointNumber; // 0x01D0
	ParticleAttributeIndex_t m_nAttributeToWrite; // 0x01D4
	int32 m_nLocalSpaceCP; // 0x01D8
	CPerParticleFloatInput m_flInterpolation; // 0x01E0
	CPerParticleVecInput m_vecScale; // 0x0350
	float32 m_flBoundaryDampening; // 0x0A08
	bool m_bSetVelocity; // 0x0A0C
	bool m_bLockToSurface; // 0x0A0D
	float32 m_flGridSpacing; // 0x0A10
};
class CSSDSMsg_PostLayer : public CSSDSMsg_LayerBase // scenesystem
{
};
class FeWeightedNode_t // physicslib
{
	uint16 nNode; // 0x0000
	uint16 nWeight; // 0x0002
};
class CNmTargetSelectorNode::CDefinition : public CNmClipReferenceNode::CDefinition // animlib
{
	CUtlLeanVectorFixedGrowable< int16, 5 > m_optionNodeIndices; // 0x0010
	float32 m_flOrientationScoreWeight; // 0x0028
	float32 m_flPositionScoreWeight; // 0x002C
	int16 m_parameterNodeIdx; // 0x0030
	bool m_bIgnoreInvalidOptions; // 0x0032
	bool m_bIsWorldSpaceTarget; // 0x0033
};
class CCurrentRotationVelocityMetricEvaluator : public CMotionMetricEvaluator // animgraphlib
{
};
class QuestProgress // server
{
};
class C_OP_RemapVelocityToVector : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	float32 m_flScale; // 0x01D4
	bool m_bNormalize; // 0x01D8
};
class C_INIT_CreateOnGrid : public CParticleFunctionInitializer // particles
{
	CParticleCollectionFloatInput m_nXCount; // 0x01D8
	CParticleCollectionFloatInput m_nYCount; // 0x0348
	CParticleCollectionFloatInput m_nZCount; // 0x04B8
	CParticleCollectionFloatInput m_nXSpacing; // 0x0628
	CParticleCollectionFloatInput m_nYSpacing; // 0x0798
	CParticleCollectionFloatInput m_nZSpacing; // 0x0908
	int32 m_nControlPointNumber; // 0x0A78
	bool m_bLocalSpace; // 0x0A7C
	bool m_bCenter; // 0x0A7D
	bool m_bHollow; // 0x0A7E
};
class C_OP_SetControlPointToCPVelocity : public CParticleFunctionPreEmission // particles
{
	int32 m_nCPInput; // 0x01D8
	int32 m_nCPOutputVel; // 0x01DC
	bool m_bNormalize; // 0x01E0
	int32 m_nCPOutputMag; // 0x01E4
	int32 m_nCPField; // 0x01E8
	CParticleCollectionVecInput m_vecComparisonVelocity; // 0x01F0
};
class CDspPresetModifierList // soundsystem
{
	CUtlString m_dspName; // 0x0000
	CUtlVector< CDSPMixgroupModifier > m_modifiers; // 0x0008
};
class FeKelagerBend2_t // physicslib
{
	float32[3] flWeight; // 0x0000
	float32 flHeight0; // 0x000C
	uint16[3] nNode; // 0x0010
	uint16 nReserved; // 0x0016
};
class CNmVelocityBlendNode::CDefinition : public CNmParameterizedBlendNode::CDefinition // animlib
{
};
class InfoForResourceTypeCSequenceGroupData // resourcesystem
{
};
class CFlashlightEffect // client
{
	bool m_bIsOn; // 0x0010
	bool m_bMuzzleFlashEnabled; // 0x0020
	float32 m_flMuzzleFlashBrightness; // 0x0024
	Quaternion m_quatMuzzleFlashOrientation; // 0x0030
	Vector m_vecMuzzleFlashOrigin; // 0x0040
	float32 m_flFov; // 0x004C
	float32 m_flFarZ; // 0x0050
	float32 m_flLinearAtten; // 0x0054
	bool m_bCastsShadows; // 0x0058
	float32 m_flCurrentPullBackDist; // 0x005C
	CStrongHandle< InfoForResourceTypeCTextureBase > m_FlashlightTexture; // 0x0060
	CStrongHandle< InfoForResourceTypeCTextureBase > m_MuzzleFlashTexture; // 0x0068
	char[64] m_textureName; // 0x0070
};
class C_OP_ControlpointLight : public CParticleFunctionOperator // particles
{
	float32 m_flScale; // 0x01D0
	int32 m_nControlPoint1; // 0x0660
	int32 m_nControlPoint2; // 0x0664
	int32 m_nControlPoint3; // 0x0668
	int32 m_nControlPoint4; // 0x066C
	Vector m_vecCPOffset1; // 0x0670
	Vector m_vecCPOffset2; // 0x067C
	Vector m_vecCPOffset3; // 0x0688
	Vector m_vecCPOffset4; // 0x0694
	float32 m_LightFiftyDist1; // 0x06A0
	float32 m_LightZeroDist1; // 0x06A4
	float32 m_LightFiftyDist2; // 0x06A8
	float32 m_LightZeroDist2; // 0x06AC
	float32 m_LightFiftyDist3; // 0x06B0
	float32 m_LightZeroDist3; // 0x06B4
	float32 m_LightFiftyDist4; // 0x06B8
	float32 m_LightZeroDist4; // 0x06BC
	Color m_LightColor1; // 0x06C0
	Color m_LightColor2; // 0x06C4
	Color m_LightColor3; // 0x06C8
	Color m_LightColor4; // 0x06CC
	bool m_bLightType1; // 0x06D0
	bool m_bLightType2; // 0x06D1
	bool m_bLightType3; // 0x06D2
	bool m_bLightType4; // 0x06D3
	bool m_bLightDynamic1; // 0x06D4
	bool m_bLightDynamic2; // 0x06D5
	bool m_bLightDynamic3; // 0x06D6
	bool m_bLightDynamic4; // 0x06D7
	bool m_bUseNormal; // 0x06D8
	bool m_bUseHLambert; // 0x06D9
	bool m_bClampLowerRange; // 0x06DE
	bool m_bClampUpperRange; // 0x06DF
};
class ParticleControlPointConfiguration_t // particles
{
	CUtlString m_name; // 0x0000
	CUtlVector< ParticleControlPointDriver_t > m_drivers; // 0x0008
	ParticlePreviewState_t m_previewState; // 0x0020
};
class CVMixModDelayProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixModDelayDesc_t m_desc; // 0x0020
};
class CNmIDValueNode::CDefinition : public CNmValueNode::CDefinition // animlib
{
};
class CAnimMorphDifference // animationsystem
{
	CBufferString m_name; // 0x0000
};
class CBaseIssue // server
{
	char[64] m_szTypeString; // 0x0020
	char[260] m_szDetailsString; // 0x0060
	int32 m_iNumYesVotes; // 0x0164
	int32 m_iNumNoVotes; // 0x0168
	int32 m_iNumPotentialVotes; // 0x016C
	CVoteController* m_pVoteController; // 0x0170
};
class C_OP_RemapGravityToVector : public CParticleFunctionOperator // particles
{
	CPerParticleVecInput m_vInput1; // 0x01D0
	ParticleAttributeIndex_t m_nOutputField; // 0x0888
	ParticleSetMethod_t m_nSetMethod; // 0x088C
	bool m_bNormalizedOutput; // 0x0890
};
class C_INIT_VelocityFromNormal : public CParticleFunctionInitializer // particles
{
	float32 m_fSpeedMin; // 0x01D8
	float32 m_fSpeedMax; // 0x01DC
	bool m_bIgnoreDt; // 0x01E0
};
class CSSDSEndFrameViewInfo // scenesystem
{
	uint64 m_nViewId; // 0x0000
	CUtlString m_ViewName; // 0x0008
};
class CSosGroupActionSoundeventPrioritySchema : public CSosGroupActionSchema // soundsystem
{
	CUtlString m_priorityValue; // 0x0008
	CUtlString m_priorityVolumeScalar; // 0x0010
	CUtlString m_priorityContributeButDontRead; // 0x0018
	CUtlString m_bPriorityReadButDontContribute; // 0x0020
};
class FeSourceEdge_t // physicslib
{
	uint16[2] nNode; // 0x0000
};
class CNmStateMachineNode::StateDefinition_t // animlib
{
	int16 m_nStateNodeIdx; // 0x0000
	int16 m_nEntryConditionNodeIdx; // 0x0002
	CUtlLeanVectorFixedGrowable< CNmStateMachineNode::TransitionDefinition_t, 5 > m_transitionDefinitions; // 0x0008
};
class CChoreoUpdateNode : public CUnaryUpdateNode // animgraphlib
{
};
class CStepsRemainingMetricEvaluator : public CMotionMetricEvaluator // animgraphlib
{
	CUtlVector< int32 > m_footIndices; // 0x0050
	float32 m_flMinStepsRemaining; // 0x0068
};
class CNmIsExternalGraphSlotFilledNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nExternalGraphNodeIdx; // 0x0010
};
class CBoneConstraintPoseSpaceBone::Input_t // modellib
{
	Vector m_inputValue; // 0x0000
	CUtlVector< CTransform > m_outputTransformList; // 0x0010
};
class VPhysics2ShapeDef_t // modellib
{
	CUtlVector< RnSphereDesc_t > m_spheres; // 0x0000
	CUtlVector< RnCapsuleDesc_t > m_capsules; // 0x0018
	CUtlVector< RnHullDesc_t > m_hulls; // 0x0030
	CUtlVector< RnMeshDesc_t > m_meshes; // 0x0048
	CUtlVector< uint16 > m_CollisionAttributeIndices; // 0x0060
};
class CNmVirtualParameterBoolNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nChildNodeIdx; // 0x0010
};
class RTProxyBLAS_t // worldrenderer
{
	uint32 m_nFirstIndex; // 0x0000
	uint32 m_nIndexCount; // 0x0004
	uint32 m_nVBByteOffset; // 0x0008
	uint32 m_nBaseVertex; // 0x000C
	uint16 m_nVertexCount; // 0x0010
	VertexAlbedoFormat_t m_albedoFormat; // 0x0012
	AABB_t m_boundLs; // 0x0014
	Vector m_vVertexOriginLs; // 0x002C
	Vector m_vVertexExtentLs; // 0x0038
};
class CVMixPlateReverbProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixPlateverbDesc_t m_desc; // 0x0020
};
class CVMixBoxverb2ProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixBoxverbDesc_t m_desc; // 0x0020
};
class JiggleBoneSettingsList_t // animgraphlib
{
	CUtlVector< JiggleBoneSettings_t > m_boneSettings; // 0x0000
};
class CNmControlParameterTargetNode::CDefinition : public CNmTargetValueNode::CDefinition // animlib
{
};
class FourQuaternions // mathlib_extended
{
	fltx4 x; // 0x0000
	fltx4 y; // 0x0010
	fltx4 z; // 0x0020
	fltx4 w; // 0x0030
};
class C_OP_ChooseRandomChildrenInGroup : public CParticleFunctionPreEmission // particles
{
	int32 m_nChildGroupID; // 0x01D8
	CParticleCollectionFloatInput m_flNumberOfChildren; // 0x01E0
};
class C_OP_Cull : public CParticleFunctionOperator // particles
{
	float32 m_flCullPerc; // 0x01D0
	float32 m_flCullStart; // 0x01D4
	float32 m_flCullEnd; // 0x01D8
	float32 m_flCullExp; // 0x01DC
};
class AggregateMeshInfo_t // worldrenderer
{
	uint32 m_nVisClusterMemberOffset; // 0x0000
	uint8 m_nVisClusterMemberCount; // 0x0004
	bool m_bHasTransform; // 0x0005
	uint8 m_nLODGroupMask; // 0x0006
	int16 m_nDrawCallIndex; // 0x0008
	int16 m_nLODSetupIndex; // 0x000A
	Color m_vTintColor; // 0x000C
	ObjectTypeFlags_t m_objectFlags; // 0x0010
	int32 m_nLightProbeVolumePrecomputedHandshake; // 0x0014
	uint32 m_nInstanceStreamOffset; // 0x0018
	uint32 m_nVertexAlbedoStreamOffset; // 0x001C
	AggregateInstanceStream_t m_instanceStreams; // 0x0020
};
class CVMixSteamAudioDirectProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
};
class FeCtrlSoftOffset_t // physicslib
{
	uint16 nCtrlParent; // 0x0000
	uint16 nCtrlChild; // 0x0002
	Vector vOffset; // 0x0004
	float32 flAlpha; // 0x0010
};
class CAnimActivity // animationsystem
{
	CBufferString m_name; // 0x0000
	int32 m_nActivity; // 0x0010
	int32 m_nFlags; // 0x0014
	int32 m_nWeight; // 0x0018
};
class CNmFloatRemapNode::RemapRange_t // animlib
{
	float32 m_flBegin; // 0x0000
	float32 m_flEnd; // 0x0004
};
class CDampedValueUpdateItem // animgraphlib
{
	CAnimInputDamping m_damping; // 0x0000
	CAnimParamHandle m_hParamIn; // 0x0020
	CAnimParamHandle m_hParamOut; // 0x0022
};
class CFutureFacingMetricEvaluator : public CMotionMetricEvaluator // animgraphlib
{
	float32 m_flDistance; // 0x0050
	float32 m_flTime; // 0x0054
};
class NmBoneMaskSetDefinition_t // animlib
{
	CGlobalSymbol m_ID; // 0x0000
	CNmBoneWeightList m_primaryWeightList; // 0x0008
	CUtlLeanVector< CNmBoneWeightList > m_secondaryWeightLists; // 0x0118
};
class C_OP_RemapControlPointOrientationToRotation : public CParticleFunctionOperator // particles
{
	int32 m_nCP; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	float32 m_flOffsetRot; // 0x01D8
	int32 m_nComponent; // 0x01DC
};
class C_OP_RenderTreeShake : public CParticleFunctionRenderer // particles
{
	float32 m_flPeakStrength; // 0x0220
	ParticleAttributeIndex_t m_nPeakStrengthFieldOverride; // 0x0224
	float32 m_flRadius; // 0x0228
	ParticleAttributeIndex_t m_nRadiusFieldOverride; // 0x022C
	float32 m_flShakeDuration; // 0x0230
	float32 m_flTransitionTime; // 0x0234
	float32 m_flTwistAmount; // 0x0238
	float32 m_flRadialAmount; // 0x023C
	float32 m_flControlPointOrientationAmount; // 0x0240
	int32 m_nControlPointForLinearDirection; // 0x0244
};
class C_OP_RotateVector : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	Vector m_vecRotAxisMin; // 0x01D4
	Vector m_vecRotAxisMax; // 0x01E0
	float32 m_flRotRateMin; // 0x01EC
	float32 m_flRotRateMax; // 0x01F0
	bool m_bNormalize; // 0x01F4
	CPerParticleFloatInput m_flScale; // 0x01F8
};
class CSteamAudioBakedReverbData // steamaudio
{
	int32 m_nBands; // 0x0000
	CSteamAudioProbeData m_probes; // 0x0008
	CSteamAudioProbeGrid m_grid; // 0x0010
	SteamAudioReverbSettings_t m_reverbSettings; // 0x0068
	SteamAudioReverbClusteringSettings_t m_reverbClusteringSettings; // 0x0078
	SteamAudioReverbCompressionSettings_t m_reverbCompressionSettings; // 0x0084
	CSteamAudioProbeData m_clusteredProbes; // 0x0090
	CUtlVector< int16 > m_vecClusterForProbe; // 0x0098
	CSteamAudioCompressedReverb m_compressedData; // 0x00B0
	CSteamAudioCompressedReverb m_compressedClusteredData; // 0x0110
	CSteamAudioMovableBakedData< CSteamAudioBakedReverbData > m_movables; // 0x0170
};
class BlendItem_t // animgraphlib
{
	CUtlVector< TagSpan_t > m_tags; // 0x0000
	CAnimUpdateNodeRef m_pChild; // 0x0018
	HSequence m_hSequence; // 0x0028
	Vector2D m_vPos; // 0x002C
	float32 m_flDuration; // 0x0034
	bool m_bUseCustomDuration; // 0x0038
};
class CNmBoneWeightList // animlib
{
	CResourceName m_skeletonName; // 0x0000
	CUtlVector< CGlobalSymbol > m_boneIDs; // 0x00E0
	CUtlVector< float32 > m_weights; // 0x00F8
};
class CPulseGraphExecutionHistory // pulse_runtime_lib
{
	PulseGraphInstanceID_t m_nInstanceID; // 0x0000
	CUtlString m_strFileName; // 0x0008
	CUtlVector< PulseGraphExecutionHistoryEntry_t* > m_vecHistory; // 0x0010
	CUtlOrderedMap< PulseDocNodeID_t, PulseGraphExecutionHistoryNodeDesc_t* > m_mapCellDesc; // 0x0028
	CUtlOrderedMap< PulseCursorID_t, PulseGraphExecutionHistoryCursorDesc_t* > m_mapCursorDesc; // 0x0050
};
class C_OP_AttractToControlPoint : public CParticleFunctionForce // particles
{
	Vector m_vecComponentScale; // 0x01E0
	CPerParticleFloatInput m_fForceAmount; // 0x01F0
	float32 m_fFalloffPower; // 0x0360
	CParticleTransformInput m_TransformInput; // 0x0368
	CPerParticleFloatInput m_fForceAmountMin; // 0x03D0
	bool m_bApplyMinForce; // 0x0540
};
class VMixSubgraphSwitchDesc_t // soundsystem_lowlevel
{
	CUtlString m_name; // 0x0000
	CUtlString m_effectName; // 0x0008
	CUtlVector< CUtlString > m_subgraphs; // 0x0010
	VMixSubgraphSwitchInterpolationType_t m_interpolationMode; // 0x0028
	bool m_bOnlyTailsOnFadeOut; // 0x002C
	float32 m_flInterpolationTime; // 0x0030
};
class SelectedEditItemInfo_t // soundsystem
{
	CUtlVector< SosEditItemInfo_t > m_EditItems; // 0x0000
};
class CVMixDelayProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixDelayDesc_t m_desc; // 0x0020
};
class CNmIDEventConditionNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nSourceStateNodeIdx; // 0x0010
	CNmBitFlags m_eventConditionRules; // 0x0014
	CUtlVectorFixedGrowable< CGlobalSymbol, 5 > m_eventIDs; // 0x0018
};
class CAttachment // modellib
{
	CUtlString m_name; // 0x0000
	CUtlString[3] m_influenceNames; // 0x0008
	Quaternion[3] m_vInfluenceRotations; // 0x0020
	Vector[3] m_vInfluenceOffsets; // 0x0050
	float32[3] m_influenceWeights; // 0x0074
	bool[3] m_bInfluenceRootTransform; // 0x0080
	uint8 m_nInfluences; // 0x0083
	bool m_bIgnoreRotation; // 0x0084
};
class CNmStateMachineNode::TransitionDefinition_t // animlib
{
	int16 m_nTargetStateIdx; // 0x0000
	int16 m_nConditionNodeIdx; // 0x0002
	int16 m_nTransitionNodeIdx; // 0x0004
	bool m_bCanBeForced; // 0x0006
};
class CCompressorGroup // animationsystem
{
	int32 m_nTotalElementCount; // 0x0000
	CUtlVector< char* > m_szChannelClass; // 0x0008
	CUtlVector< char* > m_szVariableName; // 0x0020
	CUtlVector< fieldtype_t > m_nType; // 0x0038
	CUtlVector< int32 > m_nFlags; // 0x0050
	CUtlVector< CUtlString > m_szGrouping; // 0x0068
	CUtlVector< int32 > m_nCompressorIndex; // 0x0080
	CUtlVector< CUtlVector< char* > > m_szElementNames; // 0x0098
	CUtlVector< CUtlVector< int32 > > m_nElementUniqueID; // 0x00B0
	CUtlVector< uint32 > m_nElementMask; // 0x00C8
	CUtlVector< CCompressor< Vector >* > m_vectorCompressor; // 0x00F8
	CUtlVector< CCompressor< QuaternionStorage >* > m_quaternionCompressor; // 0x0110
	CUtlVector< CCompressor< int32 >* > m_intCompressor; // 0x0128
	CUtlVector< CCompressor< bool >* > m_boolCompressor; // 0x0140
	CUtlVector< CCompressor< Color >* > m_colorCompressor; // 0x0158
	CUtlVector< CCompressor< Vector2D >* > m_vector2DCompressor; // 0x0170
	CUtlVector< CCompressor< Vector4D >* > m_vector4DCompressor; // 0x0188
};
class EventServerPostSimulate_t : public EventSimulate_t // engine2
{
	bool m_bLastTickBeforeClientUpdate; // 0x0030
};
class VsInputSignatureElement_t // rendersystemdx11
{
	char[64] m_pName; // 0x0000
	char[64] m_pSemantic; // 0x0040
	char[64] m_pD3DSemanticName; // 0x0080
	int32 m_nD3DSemanticIndex; // 0x00C0
};
class C_OP_ConstrainDistance : public CParticleFunctionConstraint // particles
{
	CParticleCollectionFloatInput m_fMinDistance; // 0x01D0
	CParticleCollectionFloatInput m_fMaxDistance; // 0x0340
	int32 m_nControlPointNumber; // 0x04B0
	Vector m_CenterOffset; // 0x04B4
	bool m_bGlobalCenter; // 0x04C0
};
class C_OP_InstantaneousEmitter : public CParticleFunctionEmitter // particles
{
	CParticleCollectionFloatInput m_nParticlesToEmit; // 0x01D8
	CParticleCollectionFloatInput m_flStartTime; // 0x0348
	float32 m_flInitFromKilledParentParticles; // 0x04B8
	EventTypeSelection_t m_nEventType; // 0x04BC
	CParticleCollectionFloatInput m_flParentParticleScale; // 0x04C0
	int32 m_nMaxEmittedPerFrame; // 0x0630
	int32 m_nSnapshotControlPoint; // 0x0634
	CUtlString m_strSnapshotSubset; // 0x0638
};
class C_OP_RemapNamedModelBodyPartOnceTimed : public C_OP_RemapNamedModelElementOnceTimed // particles
{
};
class CAudioEmphasisSample // soundsystem_voicecontainers
{
	float32 m_flTime; // 0x0000
	float32 m_flValue; // 0x0004
};
class CNmVirtualParameterBoneMaskNode::CDefinition : public CNmBoneMaskValueNode::CDefinition // animlib
{
	int16 m_nChildNodeIdx; // 0x0010
};
class CDistanceRemainingMetricEvaluator : public CMotionMetricEvaluator // animgraphlib
{
	float32 m_flMaxDistance; // 0x0050
	float32 m_flMinDistance; // 0x0054
	float32 m_flStartGoalFilterDistance; // 0x0058
	float32 m_flMaxGoalOvershootScale; // 0x005C
	bool m_bFilterFixedMinDistance; // 0x0060
	bool m_bFilterGoalDistance; // 0x0061
	bool m_bFilterGoalOvershoot; // 0x0062
};
class CNmLayerBlendNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
	int16 m_nBaseNodeIdx; // 0x0010
	bool m_bOnlySampleBaseRootMotion; // 0x0012
	CUtlLeanVectorFixedGrowable< CNmLayerBlendNode::LayerDefinition_t, 3 > m_layerDefinition; // 0x0018
};
class C_OP_DecayOffscreen : public CParticleFunctionOperator // particles
{
	CParticleCollectionFloatInput m_flOffscreenTime; // 0x01D0
};
class C_OP_RenderGpuImplicit : public CParticleFunctionRenderer // particles
{
	bool m_bUsePerParticleRadius; // 0x0220
	uint32 m_nVertexCountKb; // 0x0224
	uint32 m_nIndexCountKb; // 0x0228
	CParticleCollectionRendererFloatInput m_fGridSize; // 0x0230
	CParticleCollectionRendererFloatInput m_fRadiusScale; // 0x03A0
	CParticleCollectionRendererFloatInput m_fIsosurfaceThreshold; // 0x0510
	int32 m_nScaleCP; // 0x0680
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x0688
};
class C_OP_ForceBasedOnDistanceToPlane : public CParticleFunctionForce // particles
{
	float32 m_flMinDist; // 0x01E0
	Vector m_vecForceAtMinDist; // 0x01E4
	float32 m_flMaxDist; // 0x01F0
	Vector m_vecForceAtMaxDist; // 0x01F4
	Vector m_vecPlaneNormal; // 0x0200
	int32 m_nControlPointNumber; // 0x020C
	float32 m_flExponent; // 0x0210
};
class FeEffectDesc_t // physicslib
{
	CUtlString sName; // 0x0000
	uint32 nNameHash; // 0x0008
	int32 nType; // 0x000C
	KeyValues3 m_Params; // 0x0010
};
class FeSphereRigid_t // physicslib
{
	fltx4 vSphere; // 0x0000
	uint16 nNode; // 0x0010
	uint16 nCollisionMask; // 0x0012
	uint16 nVertexMapIndex; // 0x0014
	uint16 nFlags; // 0x0016
};
class CNmVirtualParameterTargetNode::CDefinition : public CNmTargetValueNode::CDefinition // animlib
{
	int16 m_nChildNodeIdx; // 0x0010
};
class CPlayerPawnComponent // server
{
	CNetworkVarChainer __m_pChainEntity; // 0x0008
};
class CIronSightController // server
{
	bool m_bIronSightAvailable; // 0x0008
	float32 m_flIronSightAmount; // 0x000C
	float32 m_flIronSightAmountGained; // 0x0010
	float32 m_flIronSightAmountBiased; // 0x0014
};
class CAnimEventListener : public CAnimEventListenerBase // server
{
};
class C_INIT_PositionOffsetToCP : public CParticleFunctionInitializer // particles
{
	int32 m_nControlPointNumberStart; // 0x01D8
	int32 m_nControlPointNumberEnd; // 0x01DC
	bool m_bLocalCoords; // 0x01E0
};
class C_OP_SetCPOrientationToGroundNormal : public CParticleFunctionOperator // particles
{
	float32 m_flInterpRate; // 0x01D0
	float32 m_flMaxTraceLength; // 0x01D4
	float32 m_flTolerance; // 0x01D8
	float32 m_flTraceOffset; // 0x01DC
	char[128] m_CollisionGroupName; // 0x01E0
	ParticleTraceSet_t m_nTraceSet; // 0x0260
	int32 m_nInputCP; // 0x0264
	int32 m_nOutputCP; // 0x0268
	bool m_bIncludeWater; // 0x0278
};
class CVMixNameInputMeter : public CVMixInputBase // soundsystem_lowlevel
{
	int32 m_nValueIndex; // 0x0010
};
class C_INIT_ScreenSpacePositionOfTarget : public CParticleFunctionInitializer // particles
{
	CPerParticleVecInput m_vecTargetPosition; // 0x01D8
	bool m_bOututBehindness; // 0x0890
	ParticleAttributeIndex_t m_nBehindFieldOutput; // 0x0894
	CParticleRemapFloatInput m_flBehindOutputRemap; // 0x0898
};
class C_INIT_RemapParticleCountToScalar : public CParticleFunctionInitializer // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D8
	int32 m_nInputMin; // 0x01DC
	int32 m_nInputMax; // 0x01E0
	int32 m_nScaleControlPoint; // 0x01E4
	int32 m_nScaleControlPointField; // 0x01E8
	float32 m_flOutputMin; // 0x01EC
	float32 m_flOutputMax; // 0x01F0
	ParticleSetMethod_t m_nSetMethod; // 0x01F4
	bool m_bActiveRange; // 0x01F8
	bool m_bInvert; // 0x01F9
	bool m_bWrap; // 0x01FA
	float32 m_flRemapBias; // 0x01FC
};
class CVectorAnimParameter : public CConcreteAnimParameter // animgraphlib
{
	Vector m_defaultValue; // 0x0080
	bool m_bInterpolate; // 0x008C
	AnimParamVectorType_t m_vectorType; // 0x0090
};
class CNmParameterizedSelectorNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
	CUtlLeanVectorFixedGrowable< int16, 5 > m_optionNodeIndices; // 0x0010
	CUtlLeanVectorFixedGrowable< uint8, 5 > m_optionWeights; // 0x0028
	int16 m_parameterNodeIdx; // 0x0038
	bool m_bIgnoreInvalidOptions; // 0x003A
	bool m_bHasWeightsSet; // 0x003B
};
class CAnimUpdateNodeRef // animgraphlib
{
	int32 m_nodeIndex; // 0x0008
};
class CAnimBone // animationsystem
{
	CBufferString m_name; // 0x0000
	int32 m_parent; // 0x0010
	Vector m_pos; // 0x0014
	QuaternionStorage m_quat; // 0x0020
	float32 m_scale; // 0x0030
	QuaternionStorage m_qAlignment; // 0x0034
	int32 m_flags; // 0x0044
};
class RenderHairStrandInfo_t // modellib
{
	uint32[2] m_nGuideHairIndices_nSurfaceTriIndex; // 0x0000
	uint16[4] m_vGuideBary_vBaseBary; // 0x0008
	uint16[4] m_vRootOffset_flLengthScale; // 0x0010
	uint16[2] m_nPackedBaseUv; // 0x0018
	uint32 m_nPackedSurfaceNormalOs; // 0x001C
	uint32 m_nPackedSurfaceTangentOs; // 0x0020
	uint32 m_nDataOffset_Segments; // 0x0024
};
class ResponseFollowup // server
{
	char* followup_concept; // 0x0000
	char* followup_contexts; // 0x0008
	float32 followup_delay; // 0x0010
	char* followup_target; // 0x0014
	char* followup_entityiotarget; // 0x001C
	char* followup_entityioinput; // 0x0024
	float32 followup_entityiodelay; // 0x002C
	bool bFired; // 0x0030
};
class C_OP_SetSimulationRate : public CParticleFunctionPreEmission // particles
{
	CParticleCollectionFloatInput m_flSimulationScale; // 0x01D8
};
class CNmStateNode::TimedEvent_t // animlib
{
	CGlobalSymbol m_ID; // 0x0000
	float32 m_flTimeValueSeconds; // 0x0008
	CNmStateNode::TimedEvent_t::Comparison_t m_comparisionOperator; // 0x000C
};
class CAnimationGraphVisualizerText : public CAnimationGraphVisualizerPrimitiveBase // animgraphlib
{
	VectorAligned m_vWsPosition; // 0x0040
	Color m_Color; // 0x0050
	CUtlString m_Text; // 0x0058
};
class CSceneRequest // server
{
	CUtlSymbolLarge m_szPayloadTypeName; // 0x0000
	SceneRequestHandle_t m_uHandle; // 0x0008
	ESceneRequestState_t m_state; // 0x000C
};
class CTakeDamageSummaryScopeGuard // server
{
	CUtlVector< SummaryTakeDamageInfo_t* > m_vecSummaries; // 0x0008
};
class CVMixVocoderProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixVocoderDesc_t m_desc; // 0x0020
};
class FeCtrlOsOffset_t // physicslib
{
	uint16 nCtrlParent; // 0x0000
	uint16 nCtrlChild; // 0x0002
};
class CMotionGraphUpdateNode : public CLeafUpdateNode // animgraphlib
{
	CSmartPtr< CMotionGraph > m_pMotionGraph; // 0x0058
};
class CMotionMetricEvaluator // animgraphlib
{
	CUtlVector< float32 > m_means; // 0x0018
	CUtlVector< float32 > m_standardDeviations; // 0x0030
	float32 m_flWeight; // 0x0048
	int32 m_nDimensionStartIndex; // 0x004C
};
class GameTime_t // entity2
{
	float32 m_Value; // 0x0000
};
class EntInput_t // entity2
{
};
class C_OP_RemapNamedModelMeshGroupEndCap : public C_OP_RemapNamedModelElementEndCap // particles
{
};
class C_OP_MaintainEmitter : public CParticleFunctionEmitter // particles
{
	CParticleCollectionFloatInput m_nParticlesToMaintain; // 0x01D8
	float32 m_flStartTime; // 0x0348
	CParticleCollectionFloatInput m_flEmissionDuration; // 0x0350
	float32 m_flEmissionRate; // 0x04C0
	int32 m_nSnapshotControlPoint; // 0x04C4
	CUtlString m_strSnapshotSubset; // 0x04C8
	bool m_bEmitInstantaneously; // 0x04D0
	bool m_bFinalEmitOnStop; // 0x04D1
	CParticleCollectionFloatInput m_flScale; // 0x04D8
};
class CFeMorphLayer // physicslib
{
	CUtlString m_Name; // 0x0000
	uint32 m_nNameHash; // 0x0008
	CUtlVector< uint16 > m_Nodes; // 0x0010
	CUtlVector< Vector > m_InitPos; // 0x0028
	CUtlVector< float32 > m_Gravity; // 0x0040
	CUtlVector< float32 > m_GoalStrength; // 0x0058
	CUtlVector< float32 > m_GoalDamping; // 0x0070
};
class CMorphRectData // modellib
{
	int16 m_nXLeftDst; // 0x0000
	int16 m_nYTopDst; // 0x0002
	float32 m_flUWidthSrc; // 0x0004
	float32 m_flVHeightSrc; // 0x0008
	CUtlVector< CMorphBundleData > m_bundleDatas; // 0x0010
};
class CEditableMotionGraph : public CMotionGraph // animgraphlib
{
};
class InfoForResourceTypeCPanoramaStyle // resourcesystem
{
};
class CSceneEventInfo // server
{
	int32 m_iLayer; // 0x0000
	int32 m_iPriority; // 0x0004
	HSequence m_hSequence; // 0x0008
	float32 m_flWeight; // 0x000C
	CStrongHandle< InfoForResourceTypeCNmClip > m_hAnimClip; // 0x0010
	CGlobalSymbol m_sAnimClipSlot; // 0x0018
	CGlobalSymbol m_sAnimClipSlotWeight; // 0x0020
	bool m_bHasArrived; // 0x0028
	int32 m_nType; // 0x002C
	GameTime_t m_flNext; // 0x0030
	bool m_bIsGesture; // 0x0034
	bool m_bShouldRemove; // 0x0035
	CHandle< CBaseEntity > m_hTarget; // 0x005C
	SceneEventId_t m_nSceneEventId; // 0x0060
	bool m_bClientSide; // 0x0064
	bool m_bStarted; // 0x0065
};
class C_OP_MovementRotateParticleAroundAxis : public CParticleFunctionOperator // particles
{
	CParticleCollectionVecInput m_vecRotAxis; // 0x01D0
	CParticleCollectionFloatInput m_flRotRate; // 0x0888
	CParticleTransformInput m_TransformInput; // 0x09F8
	bool m_bLocalSpace; // 0x0A60
};
class C_INIT_RadiusFromCPObject : public CParticleFunctionInitializer // particles
{
	int32 m_nControlPoint; // 0x01D8
};
class CReplicationParameters // particles
{
	ParticleReplicationMode_t m_nReplicationMode; // 0x0000
	bool m_bScaleChildParticleRadii; // 0x0004
	CParticleCollectionFloatInput m_flMinRandomRadiusScale; // 0x0008
	CParticleCollectionFloatInput m_flMaxRandomRadiusScale; // 0x0178
	CParticleCollectionVecInput m_vMinRandomDisplacement; // 0x02E8
	CParticleCollectionVecInput m_vMaxRandomDisplacement; // 0x09A0
	CParticleCollectionFloatInput m_flModellingScale; // 0x1058
};
class C_INIT_QuantizeFloat : public CParticleFunctionInitializer // particles
{
	CPerParticleFloatInput m_InputValue; // 0x01D8
	ParticleAttributeIndex_t m_nOutputField; // 0x0348
};
class CVMixDiffusorProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixDiffusorDesc_t m_desc; // 0x0020
};
class SosEditItemInfo_t // soundsystem
{
	SosEditItemType_t itemType; // 0x0000
	CUtlString itemName; // 0x0008
	CUtlString itemTypeName; // 0x0010
	CUtlString itemKVString; // 0x0020
	Vector2D itemPos; // 0x0028
};
class CAnimationGraphVisualizerPie : public CAnimationGraphVisualizerPrimitiveBase // animgraphlib
{
	VectorAligned m_vWsCenter; // 0x0040
	VectorAligned m_vWsStart; // 0x0050
	VectorAligned m_vWsEnd; // 0x0060
	Color m_Color; // 0x0070
};
class CPulse_InstructionDebug // pulse_runtime_lib
{
	PulseDocNodeID_t m_nFlowNodeID; // 0x0000
	PulseDocNodeID_t m_nValueNodeID; // 0x0004
	CGlobalSymbol m_SequencePointName; // 0x0008
};
class HullFlags_t // server
{
	bool m_bHull_Human; // 0x0000
	bool m_bHull_SmallCentered; // 0x0001
	bool m_bHull_WideHuman; // 0x0002
	bool m_bHull_Tiny; // 0x0003
	bool m_bHull_Medium; // 0x0004
	bool m_bHull_TinyCentered; // 0x0005
	bool m_bHull_Large; // 0x0006
	bool m_bHull_LargeCentered; // 0x0007
	bool m_bHull_MediumTall; // 0x0008
	bool m_bHull_Small; // 0x0009
};
class C_OP_RemapExternalWindToCP : public CParticleFunctionPreEmission // particles
{
	int32 m_nCP; // 0x01D8
	int32 m_nCPOutput; // 0x01DC
	CParticleCollectionVecInput m_vecScale; // 0x01E0
	bool m_bSetMagnitude; // 0x0898
	int32 m_nOutVectorField; // 0x089C
};
class CMoverUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	CAnimInputDamping m_damping; // 0x0078
	AnimValueSource m_facingTarget; // 0x0090
	CAnimParamHandle m_hMoveVecParam; // 0x0094
	CAnimParamHandle m_hMoveHeadingParam; // 0x0096
	CAnimParamHandle m_hTurnToFaceParam; // 0x0098
	float32 m_flTurnToFaceOffset; // 0x009C
	float32 m_flTurnToFaceLimit; // 0x00A0
	bool m_bAdditive; // 0x00A4
	bool m_bApplyMovement; // 0x00A5
	bool m_bOrientMovement; // 0x00A6
	bool m_bApplyRotation; // 0x00A7
	bool m_bLimitOnly; // 0x00A8
};
class CPAssignment_t // particles
{
	int32 m_nCPNumber; // 0x0000
	CPerParticleVecInput m_Pos; // 0x0008
	ParticleOrientationSetMode_t m_nOrientationMode; // 0x06C0
};
class C_INIT_RemapParticleCountToNamedModelMeshGroupScalar : public C_INIT_RemapParticleCountToNamedModelElementScalar // particles
{
};
class CVoiceContainerBase // soundsystem_voicecontainers
{
	CVSound m_vSound; // 0x0028
	CVoiceContainerAnalysisBase* m_pEnvelopeAnalyzer; // 0x00A0
};
class CNmVectorValueNode::CDefinition : public CNmValueNode::CDefinition // animlib
{
};
class PGDInstruction_t // pulse_runtime_lib
{
	PulseInstructionCode_t m_nCode; // 0x0000
	PulseRuntimeVarIndex_t m_nVar; // 0x0004
	PulseRuntimeRegisterIndex_t m_nReg0; // 0x0008
	PulseRuntimeRegisterIndex_t m_nReg1; // 0x000A
	PulseRuntimeRegisterIndex_t m_nReg2; // 0x000C
	PulseRuntimeInvokeIndex_t m_nInvokeBindingIndex; // 0x0010
	PulseRuntimeChunkIndex_t m_nChunk; // 0x0014
	int32 m_nDestInstruction; // 0x0018
	PulseRuntimeCallInfoIndex_t m_nCallInfoIndex; // 0x001C
	PulseRuntimeConstantIndex_t m_nConstIdx; // 0x0020
	PulseRuntimeDomainValueIndex_t m_nDomainValueIdx; // 0x0022
	PulseRuntimeBlackboardReferenceIndex_t m_nBlackboardReferenceIdx; // 0x0024
};
class InfoForResourceTypeCDOTAPatchNotesList // resourcesystem
{
};
class CAnimEventQueueListener : public CAnimEventListenerBase // server
{
};
class C_INIT_RandomModelSequence : public CParticleFunctionInitializer // particles
{
	char[256] m_ActivityName; // 0x01D8
	char[256] m_SequenceName; // 0x02D8
	CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x03D8
};
class CGeneralRandomRotation : public CParticleFunctionInitializer // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D8
	float32 m_flDegrees; // 0x01DC
	float32 m_flDegreesMin; // 0x01E0
	float32 m_flDegreesMax; // 0x01E4
	float32 m_flRotationRandExponent; // 0x01E8
	bool m_bRandomlyFlipDirection; // 0x01EC
};
class C_INIT_CreateWithinCapsuleTransform : public CParticleFunctionInitializer // particles
{
	CPerParticleFloatInput m_fRadiusMin; // 0x01D8
	CPerParticleFloatInput m_fRadiusMax; // 0x0348
	CPerParticleFloatInput m_fHeight; // 0x04B8
	CParticleTransformInput m_TransformInput; // 0x0628
	CPerParticleFloatInput m_fSpeedMin; // 0x0690
	CPerParticleFloatInput m_fSpeedMax; // 0x0800
	float32 m_fSpeedRandExp; // 0x0970
	CPerParticleVecInput m_LocalCoordinateSystemSpeedMin; // 0x0978
	CPerParticleVecInput m_LocalCoordinateSystemSpeedMax; // 0x1030
	ParticleAttributeIndex_t m_nFieldOutput; // 0x16E8
	ParticleAttributeIndex_t m_nFieldVelocity; // 0x16EC
};
class C_OP_RemapNamedModelSequenceEndCap : public C_OP_RemapNamedModelElementEndCap // particles
{
};
class CClothSettingsAnimTag : public CAnimTagBase // animgraphlib
{
	float32 m_flStiffness; // 0x0058
	float32 m_flEaseIn; // 0x005C
	float32 m_flEaseOut; // 0x0060
	CUtlString m_nVertexSet; // 0x0068
};
class VPhysXCollisionAttributes_t // modellib
{
	int32 m_nIncludeDetailLayerCount; // 0x0000
	uint32 m_CollisionGroup; // 0x0004
	CUtlVector< uint32 > m_InteractAs; // 0x0008
	CUtlVector< uint32 > m_InteractWith; // 0x0020
	CUtlVector< uint32 > m_InteractExclude; // 0x0038
	CUtlVector< uint32 > m_DetailLayers; // 0x0050
	CUtlString m_CollisionGroupString; // 0x0068
	CUtlVector< CUtlString > m_InteractAsStrings; // 0x0070
	CUtlVector< CUtlString > m_InteractWithStrings; // 0x0088
	CUtlVector< CUtlString > m_InteractExcludeStrings; // 0x00A0
	CUtlVector< CUtlString > m_DetailLayerStrings; // 0x00B8
};
class CSeqAutoLayerFlag // animationsystem
{
	bool m_bPost; // 0x0000
	bool m_bSpline; // 0x0001
	bool m_bXFade; // 0x0002
	bool m_bNoBlend; // 0x0003
	bool m_bLocal; // 0x0004
	bool m_bPose; // 0x0005
	bool m_bFetchFrame; // 0x0006
	bool m_bSubtract; // 0x0007
};
class CNmCachedIDNode::CDefinition : public CNmIDValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	NmCachedValueMode_t m_mode; // 0x0014
};
class EventSetTime_t // engine2
{
	EngineLoopState_t m_LoopState; // 0x0000
	int32 m_nClientOutputFrames; // 0x0028
	float64 m_flRealTime; // 0x0030
	float64 m_flRenderTime; // 0x0038
	float64 m_flRenderFrameTime; // 0x0040
	float64 m_flRenderFrameTimeUnbounded; // 0x0048
	float64 m_flRenderFrameTimeUnscaled; // 0x0050
	float64 m_flTickRemainder; // 0x0058
};
class CExampleSchemaVData_PolymorphicDerivedB : public CExampleSchemaVData_PolymorphicBase // resourcefile
{
	int32 m_nDerivedB; // 0x0010
};
class CSkeletonAnimationController : public ISkeletonAnimationController // server
{
	CSkeletonInstance* m_pSkeletonInstance; // 0x0008
};
class CMotionSearchNode // animgraphlib
{
	CUtlVector< CMotionSearchNode* > m_children; // 0x0000
	CVectorQuantizer m_quantizer; // 0x0018
	CUtlVector< CUtlVector< SampleCode > > m_sampleCodes; // 0x0038
	CUtlVector< CUtlVector< int32 > > m_sampleIndices; // 0x0050
	CUtlVector< int32 > m_selectableSamples; // 0x0068
};
class CNmVectorCreateNode::CDefinition : public CNmVectorValueNode::CDefinition // animlib
{
	int16 m_inputVectorValueNodeIdx; // 0x0010
	int16 m_inputValueXNodeIdx; // 0x0012
	int16 m_inputValueYNodeIdx; // 0x0014
	int16 m_inputValueZNodeIdx; // 0x0016
};
class CConstraintSlave // modellib
{
	Quaternion m_qBaseOrientation; // 0x0000
	Vector m_vBasePosition; // 0x0010
	uint32 m_nBoneHash; // 0x001C
	float32 m_flWeight; // 0x0020
	CUtlString m_sName; // 0x0028
};
class CSeqMultiFetch // animationsystem
{
	CSeqMultiFetchFlag m_flags; // 0x0000
	CUtlVector< int16 > m_localReferenceArray; // 0x0008
	int32[2] m_nGroupSize; // 0x0020
	int32[2] m_nLocalPose; // 0x0028
	CUtlVector< float32 > m_poseKeyArray0; // 0x0030
	CUtlVector< float32 > m_poseKeyArray1; // 0x0048
	int32 m_nLocalCyclePoseParameter; // 0x0060
	bool m_bCalculatePoseParameters; // 0x0064
	bool m_bFixedBlendWeight; // 0x0065
	float32[2] m_flFixedBlendWeightVals; // 0x0068
};
class EventSimulate_t // engine2
{
	EngineLoopState_t m_LoopState; // 0x0000
	bool m_bFirstTick; // 0x0028
	bool m_bLastTick; // 0x0029
};
class InfoForResourceTypeCNmClip // resourcesystem
{
};
class C_IronSightController // client
{
	bool m_bIronSightAvailable; // 0x0010
	float32 m_flIronSightAmount; // 0x0014
	float32 m_flIronSightAmountGained; // 0x0018
	float32 m_flIronSightAmountBiased; // 0x001C
	float32 m_flIronSightAmount_Interpolated; // 0x0020
	float32 m_flIronSightAmountGained_Interpolated; // 0x0024
	float32 m_flIronSightAmountBiased_Interpolated; // 0x0028
	float32 m_flInterpolationLastUpdated; // 0x002C
	QAngle[8] m_angDeltaAverage; // 0x0030
	QAngle m_angViewLast; // 0x0090
	Vector2D m_vecDotCoords; // 0x009C
	float32 m_flFiringInaccuracyExtraWidthMultiplier; // 0x00A4
	float32 m_flSpeedRatio; // 0x00A8
};
class CNetworkViewOffsetVector // server
{
	CNetworkedQuantizedFloat m_vecX; // 0x0010
	CNetworkedQuantizedFloat m_vecY; // 0x0018
	CNetworkedQuantizedFloat m_vecZ; // 0x0020
};
class CMotorController // server
{
	float32 m_speed; // 0x0008
	float32 m_maxTorque; // 0x000C
	VectorWS m_axis; // 0x0010
	float32 m_inertiaFactor; // 0x001C
};
class CNmFloatCurveEventNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	CGlobalSymbol m_eventID; // 0x0010
	int16 m_nDefaultNodeIdx; // 0x0018
	float32 m_flDefaultValue; // 0x001C
	CNmBitFlags m_eventConditionRules; // 0x0020
};
class CNmFloatValueNode::CDefinition : public CNmValueNode::CDefinition // animlib
{
};
class inv_image_data_t // client
{
	inv_image_map_t map; // 0x0000
	inv_image_item_t item; // 0x0010
	inv_image_camera_t camera; // 0x0030
	inv_image_light_sun_t lightsun; // 0x0064
	inv_image_light_fill_t lightfill; // 0x0080
	inv_image_light_barn_t light0; // 0x009C
	inv_image_light_barn_t light1; // 0x00BC
	inv_image_clearcolor_t clearcolor; // 0x00DC
};
class C_OP_ParentVortices : public CParticleFunctionForce // particles
{
	float32 m_flForceScale; // 0x01E0
	Vector m_vecTwistAxis; // 0x01E4
	bool m_bFlipBasedOnYaw; // 0x01F0
};
class CSosGroupActionSoundeventMinMaxValuesSchema : public CSosGroupActionSchema // soundsystem
{
	CUtlString m_strQueryPublicFieldName; // 0x0008
	CUtlString m_strDelayPublicFieldName; // 0x0010
	bool m_bExcludeStoppedSounds; // 0x0018
	bool m_bExcludeDelayedSounds; // 0x0019
	bool m_bExcludeSoundsBelowThreshold; // 0x001A
	float32 m_flExcludeSoundsMinThresholdValue; // 0x001C
	bool m_bExcludSoundsAboveThreshold; // 0x0020
	float32 m_flExcludeSoundsMaxThresholdValue; // 0x0024
	CUtlString m_strMinValueName; // 0x0028
	CUtlString m_strMaxValueName; // 0x0030
};
class ModelBoneFlexDriver_t // modellib
{
	CUtlString m_boneName; // 0x0000
	uint32 m_boneNameToken; // 0x0008
	CUtlVector< ModelBoneFlexDriverControl_t > m_controls; // 0x0010
};
class CMorphSetData // modellib
{
	int32 m_nWidth; // 0x0010
	int32 m_nHeight; // 0x0014
	CUtlVector< MorphBundleType_t > m_bundleTypes; // 0x0018
	CUtlVector< CMorphData > m_morphDatas; // 0x0030
	CStrongHandle< InfoForResourceTypeCTextureBase > m_pTextureAtlas; // 0x0048
	CUtlVector< CFlexDesc > m_FlexDesc; // 0x0050
	CUtlVector< CFlexController > m_FlexControllers; // 0x0068
	CUtlVector< CFlexRule > m_FlexRules; // 0x0080
};
class CMorphConstraint : public CBaseConstraint // modellib
{
	CUtlString m_sTargetMorph; // 0x0060
	int32 m_nSlaveChannel; // 0x0068
	float32 m_flMin; // 0x006C
	float32 m_flMax; // 0x0070
};
class CStateActionUpdater // animgraphlib
{
	CSmartPtr< CAnimActionUpdater > m_pAction; // 0x0000
	StateActionBehavior m_eBehavior; // 0x0008
};
class FootFixedData_t // animgraphlib
{
	VectorAligned m_vToeOffset; // 0x0000
	VectorAligned m_vHeelOffset; // 0x0010
	int32 m_nTargetBoneIndex; // 0x0020
	int32 m_nAnkleBoneIndex; // 0x0024
	int32 m_nIKAnchorBoneIndex; // 0x0028
	int32 m_ikChainIndex; // 0x002C
	float32 m_flMaxIKLength; // 0x0030
	int32 m_nFootIndex; // 0x0034
	int32 m_nTagIndex; // 0x0038
	float32 m_flMaxRotationLeft; // 0x003C
	float32 m_flMaxRotationRight; // 0x0040
};
class C_INIT_RemapInitialDirectionToTransformToVector : public CParticleFunctionInitializer // particles
{
	CParticleTransformInput m_TransformInput; // 0x01D8
	ParticleAttributeIndex_t m_nFieldOutput; // 0x0240
	float32 m_flScale; // 0x0244
	float32 m_flOffsetRot; // 0x0248
	Vector m_vecOffsetAxis; // 0x024C
	bool m_bNormalize; // 0x0258
};
class VMixFreeverbDesc_t // soundsystem_lowlevel
{
	float32 m_flRoomSize; // 0x0000
	float32 m_flDamp; // 0x0004
	float32 m_flWidth; // 0x0008
	float32 m_flLateReflections; // 0x000C
};
class CVMixDynamicsProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixDynamicsDesc_t m_desc; // 0x0020
};
class CNmIsInactiveBranchConditionNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
};
class FollowTargetOpFixedSettings_t // animgraphlib
{
	int32 m_boneIndex; // 0x0000
	bool m_bBoneTarget; // 0x0004
	int32 m_boneTargetIndex; // 0x0008
	bool m_bWorldCoodinateTarget; // 0x000C
	bool m_bMatchTargetOrientation; // 0x000D
};
class CEmitTagActionUpdater : public CAnimActionUpdater // animgraphlib
{
	int32 m_nTagIndex; // 0x0018
	bool m_bIsZeroDuration; // 0x001C
};
class CNmGraphVariationUserData // animlib
{
};
class CNmTwoBoneIKTask : public CNmPoseTask // animlib
{
	int32 m_nEffectorBoneIdx; // 0x0058
	int32 m_nEffectorTargetBoneIdx; // 0x005C
	CTransform m_targetTransform; // 0x0060
	CNmTarget m_effectorTarget; // 0x0080
	NmIKBlendMode_t m_blendMode; // 0x00B0
	float32 m_flBlendWeight; // 0x00B4
	bool m_bIsTargetInWorldSpace; // 0x00B8
	bool m_bIsRunningFromDeserializedData; // 0x00B9
	float32 m_flReferencePoseTwistWeight; // 0x00BC
	CGlobalSymbol m_debugEffectorBoneID; // 0x00C0
};
class CBoneConstraintPoseSpaceMorph : public CBoneConstraintBase // modellib
{
	CUtlString m_sBoneName; // 0x0020
	CUtlString m_sAttachmentName; // 0x0028
	CUtlVector< CUtlString > m_outputMorph; // 0x0030
	CUtlVector< CBoneConstraintPoseSpaceMorph::Input_t > m_inputList; // 0x0048
	bool m_bClamp; // 0x0060
};
class EventProfileStorageAvailable_t // engine2
{
	CSplitScreenSlot m_nSplitScreenSlot; // 0x0000
};
class InfoForResourceTypeCVSoundStackScriptList // resourcesystem
{
};
class C_OP_CollideWithSelf : public CParticleFunctionConstraint // particles
{
	CPerParticleFloatInput m_flRadiusScale; // 0x01D0
	CPerParticleFloatInput m_flMinimumSpeed; // 0x0340
};
class C_INIT_PlaneCull : public CParticleFunctionInitializer // particles
{
	int32 m_nControlPoint; // 0x01D8
	CParticleCollectionFloatInput m_flDistance; // 0x01E0
	bool m_bCullInside; // 0x0350
};
class C_OP_RemapDistanceToLineSegmentToVector : public C_OP_RemapDistanceToLineSegmentBase // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01E8
	Vector m_vMinOutputValue; // 0x01EC
	Vector m_vMaxOutputValue; // 0x01F8
};
class C_OP_PercentageBetweenTransformLerpCPs : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	float32 m_flInputMin; // 0x01D4
	float32 m_flInputMax; // 0x01D8
	CParticleTransformInput m_TransformStart; // 0x01E0
	CParticleTransformInput m_TransformEnd; // 0x0248
	int32 m_nOutputStartCP; // 0x02B0
	int32 m_nOutputStartField; // 0x02B4
	int32 m_nOutputEndCP; // 0x02B8
	int32 m_nOutputEndField; // 0x02BC
	ParticleSetMethod_t m_nSetMethod; // 0x02C0
	bool m_bActiveRange; // 0x02C4
	bool m_bRadialCheck; // 0x02C5
};
class CVMixSteamAudioHRTFProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
};
class CVoiceContainerGranulator : public CVoiceContainerAsyncGenerator // soundsystem_voicecontainers
{
	float32 m_flGrainLength; // 0x00B8
	float32 m_flGrainCrossfadeAmount; // 0x00BC
	float32 m_flStartJitter; // 0x00C0
	float32 m_flPlaybackJitter; // 0x00C4
	bool m_bShouldWraparound; // 0x00C8
	CStrongHandle< InfoForResourceTypeCVoiceContainerBase > m_sourceAudio; // 0x00D0
};
class COrientationWarpUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	OrientationWarpMode_t m_eMode; // 0x0074
	CAnimParamHandle m_hTargetParam; // 0x0078
	CAnimParamHandle m_hTargetPositionParam; // 0x007A
	CAnimParamHandle m_hFallbackTargetPositionParam; // 0x007C
	OrientationWarpTargetOffsetMode_t m_eTargetOffsetMode; // 0x0080
	float32 m_flTargetOffset; // 0x0084
	CAnimParamHandle m_hTargetOffsetParam; // 0x0088
	CAnimInputDamping m_damping; // 0x0090
	OrientationWarpRootMotionSource_t m_eRootMotionSource; // 0x00A8
	float32 m_flMaxRootMotionScale; // 0x00AC
	bool m_bEnablePreferredRotationDirection; // 0x00B0
	AnimValueSource m_ePreferredRotationDirection; // 0x00B4
	float32 m_flPreferredRotationThreshold; // 0x00B8
};
class CAnimGraphDebugReplay // animgraphlib
{
	CUtlString m_animGraphFileName; // 0x0040
	CUtlVector< CSmartPtr< CAnimReplayFrame > > m_frameList; // 0x0048
	int32 m_startIndex; // 0x0060
	int32 m_writeIndex; // 0x0064
	int32 m_frameCount; // 0x0068
};
class CAnimSkeleton // modellib
{
	CUtlVector< CTransform > m_localSpaceTransforms; // 0x0010
	CUtlVector< CTransform > m_modelSpaceTransforms; // 0x0028
	CUtlVector< CUtlString > m_boneNames; // 0x0040
	CUtlVector< CUtlVector< int32 > > m_children; // 0x0058
	CUtlVector< int32 > m_parents; // 0x0070
	CUtlVector< CAnimFoot > m_feet; // 0x0088
	CUtlVector< CUtlString > m_morphNames; // 0x00A0
	CUtlVector< int32 > m_lodBoneCounts; // 0x00B8
};
class CParticleCollectionFloatInput : public CParticleFloatInput // particleslib
{
};
class EventServerAdvanceTick_t : public EventAdvanceTick_t // engine2
{
};
class CGlobalLightBase // client
{
	bool m_bSpotLight; // 0x0010
	Vector m_SpotLightOrigin; // 0x0014
	QAngle m_SpotLightAngles; // 0x0020
	Vector m_ShadowDirection; // 0x002C
	Vector m_AmbientDirection; // 0x0038
	Vector m_SpecularDirection; // 0x0044
	Vector m_InspectorSpecularDirection; // 0x0050
	float32 m_flSpecularPower; // 0x005C
	float32 m_flSpecularIndependence; // 0x0060
	Color m_SpecularColor; // 0x0064
	bool m_bStartDisabled; // 0x0068
	bool m_bEnabled; // 0x0069
	Color m_LightColor; // 0x006A
	Color m_AmbientColor1; // 0x006E
	Color m_AmbientColor2; // 0x0072
	Color m_AmbientColor3; // 0x0076
	float32 m_flSunDistance; // 0x007C
	float32 m_flFOV; // 0x0080
	float32 m_flNearZ; // 0x0084
	float32 m_flFarZ; // 0x0088
	bool m_bEnableShadows; // 0x008C
	bool m_bOldEnableShadows; // 0x008D
	bool m_bBackgroundClearNotRequired; // 0x008E
	float32 m_flCloudScale; // 0x0090
	float32 m_flCloud1Speed; // 0x0094
	float32 m_flCloud1Direction; // 0x0098
	float32 m_flCloud2Speed; // 0x009C
	float32 m_flCloud2Direction; // 0x00A0
	float32 m_flAmbientScale1; // 0x00B0
	float32 m_flAmbientScale2; // 0x00B4
	float32 m_flGroundScale; // 0x00B8
	float32 m_flLightScale; // 0x00BC
	float32 m_flFoWDarkness; // 0x00C0
	bool m_bEnableSeparateSkyboxFog; // 0x00C4
	Vector m_vFowColor; // 0x00C8
	Vector m_ViewOrigin; // 0x00D4
	QAngle m_ViewAngles; // 0x00E0
	float32 m_flViewFoV; // 0x00EC
	Vector[8] m_WorldPoints; // 0x00F0
	Vector2D m_vFogOffsetLayer0; // 0x04A8
	Vector2D m_vFogOffsetLayer1; // 0x04B0
	CHandle< C_BaseEntity > m_hEnvWind; // 0x04B8
	CHandle< C_BaseEntity > m_hEnvSky; // 0x04BC
};
class CParticleFunctionConstraint : public CParticleFunction // particles
{
};
class CVMixDualCompressorProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixDualCompressorDesc_t m_desc; // 0x0020
};
class CAnimationGraphVisualizerAxis : public CAnimationGraphVisualizerPrimitiveBase // animgraphlib
{
	CTransform m_xWsTransform; // 0x0040
	float32 m_flAxisSize; // 0x0060
};
class CJumpHelperUpdateNode : public CSequenceUpdateNode // animgraphlib
{
	CAnimParamHandle m_hTargetParam; // 0x00B0
	Vector m_flOriginalJumpMovement; // 0x00B4
	float32 m_flOriginalJumpDuration; // 0x00C0
	float32 m_flJumpStartCycle; // 0x00C4
	float32 m_flJumpEndCycle; // 0x00C8
	JumpCorrectionMethod m_eCorrectionMethod; // 0x00CC
	bool[3] m_bTranslationAxis; // 0x00D0
	bool m_bScaleSpeed; // 0x00D3
};
class CAnimDesc_Flag // animationsystem
{
	bool m_bLooping; // 0x0000
	bool m_bAllZeros; // 0x0001
	bool m_bHidden; // 0x0002
	bool m_bDelta; // 0x0003
	bool m_bLegacyWorldspace; // 0x0004
	bool m_bModelDoc; // 0x0005
	bool m_bImplicitSeqIgnoreDelta; // 0x0006
	bool m_bAnimGraphAdditive; // 0x0007
};
class CRegionSVM // physicslib
{
	CUtlVector< RnPlane_t > m_Planes; // 0x0000
	CUtlVector< uint32 > m_Nodes; // 0x0018
};
class CCycleControlUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	AnimValueSource m_valueSource; // 0x0070
	CAnimParamHandle m_paramIndex; // 0x0074
	bool m_bLockWhenWaning; // 0x0076
};
class PulseGraphExecutionHistoryEntry_t // pulse_runtime_lib
{
	PulseCursorID_t nCursorID; // 0x0000
	PulseDocNodeID_t nEditorID; // 0x0004
	float32 flExecTime; // 0x0008
	uint32 unFlags; // 0x000C
	PulseSymbol_t tagName; // 0x0010
};
class InfoForResourceTypeCCSGOEconItem // resourcesystem
{
};
class GeneratedTextureHandle_t // compositematerialslib
{
	CUtlString m_strBitmapName; // 0x0000
};
class C_OP_SetControlPointToImpactPoint : public CParticleFunctionPreEmission // particles
{
	int32 m_nCPOut; // 0x01D8
	int32 m_nCPIn; // 0x01DC
	float32 m_flUpdateRate; // 0x01E0
	CParticleCollectionFloatInput m_flTraceLength; // 0x01E8
	float32 m_flStartOffset; // 0x0358
	float32 m_flOffset; // 0x035C
	Vector m_vecTraceDir; // 0x0360
	char[128] m_CollisionGroupName; // 0x036C
	ParticleTraceSet_t m_nTraceSet; // 0x03EC
	bool m_bSetToEndpoint; // 0x03F0
	bool m_bTraceToClosestSurface; // 0x03F1
	bool m_bIncludeWater; // 0x03F2
};
class C_OP_RemapVisibilityScalar : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldInput; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	float32 m_flInputMin; // 0x01D8
	float32 m_flInputMax; // 0x01DC
	float32 m_flOutputMin; // 0x01E0
	float32 m_flOutputMax; // 0x01E4
	float32 m_flRadiusScale; // 0x01E8
};
class C_OP_ScreenSpaceRotateTowardTarget : public CParticleFunctionOperator // particles
{
	CPerParticleVecInput m_vecTargetPosition; // 0x01D0
	CParticleRemapFloatInput m_flOutputRemap; // 0x0888
	ParticleSetMethod_t m_nSetMethod; // 0x09F8
	CPerParticleFloatInput m_flScreenEdgeAlignmentDistance; // 0x0A00
};
class C_INIT_CreateWithinSphereTransform : public CParticleFunctionInitializer // particles
{
	CPerParticleFloatInput m_fRadiusMin; // 0x01D8
	CPerParticleFloatInput m_fRadiusMax; // 0x0348
	CPerParticleVecInput m_vecDistanceBias; // 0x04B8
	Vector m_vecDistanceBiasAbs; // 0x0B70
	CParticleTransformInput m_TransformInput; // 0x0B80
	CPerParticleFloatInput m_fSpeedMin; // 0x0BE8
	CPerParticleFloatInput m_fSpeedMax; // 0x0D58
	float32 m_fSpeedRandExp; // 0x0EC8
	bool m_bLocalCoords; // 0x0ECC
	CPerParticleVecInput m_LocalCoordinateSystemSpeedMin; // 0x0ED0
	CPerParticleVecInput m_LocalCoordinateSystemSpeedMax; // 0x1588
	ParticleAttributeIndex_t m_nFieldOutput; // 0x1C40
	ParticleAttributeIndex_t m_nFieldVelocity; // 0x1C44
};
class C_OP_SetGravityToCP : public CParticleFunctionPreEmission // particles
{
	int32 m_nCPInput; // 0x01D8
	int32 m_nCPOutput; // 0x01DC
	CParticleCollectionFloatInput m_flScale; // 0x01E0
	bool m_bSetOrientation; // 0x0350
	bool m_bSetZDown; // 0x0351
};
class FeAnimStrayRadius_t // physicslib
{
	uint16[2] nNode; // 0x0000
	float32 flMaxDist; // 0x0004
	float32 flRelaxationFactor; // 0x0008
};
class FeAntiTunnelProbe_t // physicslib
{
	float32 flWeight; // 0x0000
	uint32 nFlags; // 0x0004
	uint16 nProbeNode; // 0x0008
	uint16 nCount; // 0x000A
	uint32 nBegin; // 0x000C
	float32 flActivationDistance; // 0x0010
	float32 flCurvatureRadius; // 0x0014
	float32 flBias; // 0x0018
};
class RnShapeDesc_t // physicslib
{
	uint32 m_nCollisionAttributeIndex; // 0x0000
	uint32 m_nSurfacePropertyIndex; // 0x0004
	CUtlString m_UserFriendlyName; // 0x0008
	bool m_bUserFriendlyNameSealed; // 0x0010
	bool m_bUserFriendlyNameLong; // 0x0011
	uint32 m_nToolMaterialHash; // 0x0014
};
class CNmFloatSelectorNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	CUtlVectorFixedGrowable< int16, 5 > m_conditionNodeIndices; // 0x0010
	CUtlVectorFixedGrowable< float32, 5 > m_values; // 0x0038
	float32 m_flDefaultValue; // 0x0068
	float32 m_flEaseTime; // 0x006C
	NmEasingOperation_t m_easingOp; // 0x0070
};
class CModelConfigElement_SetBodygroup : public CModelConfigElement // modellib
{
	CGlobalSymbol m_GroupName; // 0x0048
	int32 m_nChoice; // 0x0050
};
class CModelConfigElement_Command : public CModelConfigElement // modellib
{
	CUtlString m_Command; // 0x0048
	KeyValues3 m_Args; // 0x0050
};
class CRenderSkeleton // modellib
{
	CUtlVector< RenderSkeletonBone_t > m_bones; // 0x0000
	CUtlVector< int32 > m_boneParents; // 0x0030
	int32 m_nBoneWeightCount; // 0x0048
};
class InfoForResourceTypeCVPhysXSurfacePropertiesList // resourcesystem
{
};
class WaterWheelFrictionScale_t // server
{
	float32 m_flFractionOfWheelSubmerged; // 0x0000
	float32 m_flFrictionScale; // 0x0004
};
class CSAdditionalMatchStats_t : public CSAdditionalPerRoundStats_t // server
{
	int32 m_numRoundsSurvivedStreak; // 0x00F8
	int32 m_maxNumRoundsSurvivedStreak; // 0x00FC
	int32 m_numRoundsSurvivedTotal; // 0x0100
	int32 m_iRoundsWonWithoutPurchase; // 0x0104
	int32 m_iRoundsWonWithoutPurchaseTotal; // 0x0108
	int32 m_numFirstKills; // 0x010C
	int32 m_numClutchKills; // 0x0110
	int32 m_numPistolKills; // 0x0114
	int32 m_numSniperKills; // 0x0118
	int32 m_iNumSuicides; // 0x011C
	int32 m_iNumTeamKills; // 0x0120
	float32 m_flTeamDamage; // 0x0124
};
class C_OP_RenderCables : public CParticleFunctionRenderer // particles
{
	CParticleCollectionFloatInput m_flRadiusScale; // 0x0220
	CParticleCollectionFloatInput m_flAlphaScale; // 0x0390
	CParticleCollectionVecInput m_vecColorScale; // 0x0500
	ParticleColorBlendType_t m_nColorBlendType; // 0x0BB8
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x0BC0
	TextureRepetitionMode_t m_nTextureRepetitionMode; // 0x0BC8
	CParticleCollectionFloatInput m_flTextureRepeatsPerSegment; // 0x0BD0
	CParticleCollectionFloatInput m_flTextureRepeatsCircumference; // 0x0D40
	CParticleCollectionFloatInput m_flColorMapOffsetV; // 0x0EB0
	CParticleCollectionFloatInput m_flColorMapOffsetU; // 0x1020
	CParticleCollectionFloatInput m_flNormalMapOffsetV; // 0x1190
	CParticleCollectionFloatInput m_flNormalMapOffsetU; // 0x1300
	bool m_bDrawCableCaps; // 0x1470
	float32 m_flCapRoundness; // 0x1474
	float32 m_flCapOffsetAmount; // 0x1478
	float32 m_flTessScale; // 0x147C
	int32 m_nMinTesselation; // 0x1480
	int32 m_nMaxTesselation; // 0x1484
	int32 m_nRoundness; // 0x1488
	bool m_nForceRoundnessFixed; // 0x148C
	CParticleTransformInput m_LightingTransform; // 0x1490
	CUtlLeanVector< FloatInputMaterialVariable_t > m_MaterialFloatVars; // 0x14F8
	CUtlLeanVector< VecInputMaterialVariable_t > m_MaterialVecVars; // 0x1518
};
class VoxelVisBlockOffset_t // worldrenderer
{
	uint32 m_nOffset; // 0x0000
	uint32 m_nElementCount; // 0x0004
};
class FeSimdNodeBase_t // physicslib
{
	uint16[4] nNode; // 0x0000
	uint16[4] nNodeX0; // 0x0008
	uint16[4] nNodeX1; // 0x0010
	uint16[4] nNodeY0; // 0x0018
	uint16[4] nNodeY1; // 0x0020
	uint16[4] nDummy; // 0x0028
	FourQuaternions qAdjust; // 0x0030
};
class NmPercent_t // animlib
{
	float32 m_flValue; // 0x0000
};
class CNmGraphEventConditionNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nSourceStateNodeIdx; // 0x0010
	CNmBitFlags m_eventConditionRules; // 0x0014
	CUtlVectorFixedGrowable< CNmGraphEventConditionNode::Condition_t, 5 > m_conditions; // 0x0018
};
class C_OP_SetPerChildControlPointFromAttribute : public CParticleFunctionOperator // particles
{
	int32 m_nChildGroupID; // 0x01D0
	int32 m_nFirstControlPoint; // 0x01D4
	int32 m_nNumControlPoints; // 0x01D8
	int32 m_nParticleIncrement; // 0x01DC
	int32 m_nFirstSourcePoint; // 0x01E0
	bool m_bNumBasedOnParticleCount; // 0x01E4
	ParticleAttributeIndex_t m_nAttributeToRead; // 0x01E8
	int32 m_nCPField; // 0x01EC
};
class C_OP_LightningSnapshotGenerator : public CParticleFunctionPreEmission // particles
{
	int32 m_nCPSnapshot; // 0x01D8
	int32 m_nCPStartPnt; // 0x01DC
	int32 m_nCPEndPnt; // 0x01E0
	CParticleCollectionFloatInput m_flSegments; // 0x01E8
	CParticleCollectionFloatInput m_flOffset; // 0x0358
	CParticleCollectionFloatInput m_flOffsetDecay; // 0x04C8
	CParticleCollectionFloatInput m_flRecalcRate; // 0x0638
	CParticleCollectionFloatInput m_flUVScale; // 0x07A8
	CParticleCollectionFloatInput m_flUVOffset; // 0x0918
	CParticleCollectionFloatInput m_flSplitRate; // 0x0A88
	CParticleCollectionFloatInput m_flBranchTwist; // 0x0BF8
	ParticleLightnintBranchBehavior_t m_nBranchBehavior; // 0x0D68
	CParticleCollectionFloatInput m_flRadiusStart; // 0x0D70
	CParticleCollectionFloatInput m_flRadiusEnd; // 0x0EE0
	CParticleCollectionFloatInput m_flDedicatedPool; // 0x1050
};
class C_OP_RemapSpeed : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	float32 m_flInputMin; // 0x01D4
	float32 m_flInputMax; // 0x01D8
	float32 m_flOutputMin; // 0x01DC
	float32 m_flOutputMax; // 0x01E0
	ParticleSetMethod_t m_nSetMethod; // 0x01E4
	bool m_bIgnoreDelta; // 0x01E8
};
class CNmFloatComparisonNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	int16 m_nComparandValueNodeIdx; // 0x0012
	CNmFloatComparisonNode::Comparison_t m_comparison; // 0x0014
	float32 m_flEpsilon; // 0x0018
	float32 m_flComparisonValue; // 0x001C
};
class EventClientOutput_t // engine2
{
	EngineLoopState_t m_LoopState; // 0x0000
	float32 m_flRenderTime; // 0x0028
	float32 m_flRealTime; // 0x002C
	float32 m_flRenderFrameTimeUnbounded; // 0x0030
	bool m_bRenderOnly; // 0x0034
};
class CPathQueryUtil // server
{
	CTransform m_PathToEntityTransform; // 0x0010
	CUtlVector< Vector > m_vecPathSamplePositions; // 0x0030
	CUtlVector< float32 > m_vecPathSampleParameters; // 0x0048
	CUtlVector< float32 > m_vecPathSampleDistances; // 0x0060
	bool m_bIsClosedLoop; // 0x0078
};
class ragdoll_t // server
{
	CUtlVector< ragdollelement_t > list; // 0x0000
	CUtlVector< ragdollhierarchyjoint_t > hierarchyJoints; // 0x0018
	CUtlVector< int32 > boneIndex; // 0x0030
	bool allowStretch; // 0x0048
	bool unused; // 0x0049
};
class CNavHullVData // navlib
{
	bool m_bAgentEnabled; // 0x0000
	float32 m_agentRadius; // 0x0004
	float32 m_agentHeight; // 0x0008
	bool m_agentShortHeightEnabled; // 0x000C
	float32 m_agentShortHeight; // 0x0010
	bool m_agentCrawlEnabled; // 0x0014
	float32 m_agentCrawlHeight; // 0x0018
	float32 m_agentMaxClimb; // 0x001C
	int32 m_agentMaxSlope; // 0x0020
	float32 m_agentMaxJumpDownDist; // 0x0024
	float32 m_agentMaxJumpHorizDistBase; // 0x0028
	float32 m_agentMaxJumpUpDist; // 0x002C
	int32 m_agentBorderErosion; // 0x0030
	bool m_flowMapGenerationEnabled; // 0x0034
	float32 m_flowMapNodeMaxRadius; // 0x0038
};
class C_OP_SetCPOrientationToDirection : public CParticleFunctionOperator // particles
{
	int32 m_nInputControlPoint; // 0x01D0
	int32 m_nOutputControlPoint; // 0x01D4
};
class TextureGroup_t // particles
{
	bool m_bEnabled; // 0x0000
	bool m_bReplaceTextureWithGradient; // 0x0001
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hTexture; // 0x0008
	CColorGradient m_Gradient; // 0x0010
	SpriteCardTextureType_t m_nTextureType; // 0x0028
	SpriteCardTextureChannel_t m_nTextureChannels; // 0x002C
	ParticleTextureLayerBlendType_t m_nTextureBlendMode; // 0x0030
	CParticleCollectionRendererFloatInput m_flTextureBlend; // 0x0038
	TextureControls_t m_TextureControls; // 0x01A8
};
class CVMixOscProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixOscDesc_t m_desc; // 0x0020
};
class CBaseConstraint : public CBoneConstraintBase // modellib
{
	CUtlString m_name; // 0x0020
	Vector m_vUpVector; // 0x0028
	CUtlLeanVector< CConstraintSlave > m_slaves; // 0x0038
	CUtlVector< CConstraintTarget > m_targets; // 0x0048
};
class CPhysSurfacePropertiesSoundNames // modellib
{
	CUtlString m_impactSoft; // 0x0000
	CUtlString m_impactHard; // 0x0008
	CUtlString m_scrapeSmooth; // 0x0010
	CUtlString m_scrapeRough; // 0x0018
	CUtlString m_bulletImpact; // 0x0020
	CUtlString m_rolling; // 0x0028
	CUtlString m_break; // 0x0030
	CUtlString m_strain; // 0x0038
	CUtlString m_meleeImpact; // 0x0040
	CUtlString m_pushOff; // 0x0048
	CUtlString m_skidStop; // 0x0050
	CUtlString m_resonant; // 0x0058
};
class CNmIDComparisonNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	CNmIDComparisonNode::Comparison_t m_comparison; // 0x0012
	CUtlLeanVectorFixedGrowable< CGlobalSymbol, 4 > m_comparisionIDs; // 0x0018
};
class PulseRuntimeChunkIndex_t // pulse_runtime_lib
{
	int32 m_Value; // 0x0000
};
class MaterialParamString_t : public MaterialParam_t // materialsystem2
{
	CUtlString m_value; // 0x0008
};
class EventClientPreSimulate_t : public EventSimulate_t // engine2
{
};
class inv_image_light_sun_t // client
{
	Vector color; // 0x0000
	QAngle angle; // 0x000C
	float32 brightness; // 0x0018
};
class C_OP_Diffusion : public CParticleFunctionOperator // particles
{
	float32 m_flRadiusScale; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	int32 m_nVoxelGridResolution; // 0x01D8
};
class CSosGroupActionTimeBlockLimitSchema : public CSosGroupActionSchema // soundsystem
{
	int32 m_nMaxCount; // 0x0008
	float32 m_flMaxDuration; // 0x000C
};
class C_OP_RenderProjected : public CParticleFunctionRenderer // particles
{
	bool m_bProjectCharacter; // 0x0220
	bool m_bProjectWorld; // 0x0221
	bool m_bProjectWater; // 0x0222
	bool m_bFlipHorizontal; // 0x0223
	bool m_bEnableProjectedDepthControls; // 0x0224
	float32 m_flMinProjectionDepth; // 0x0228
	float32 m_flMaxProjectionDepth; // 0x022C
	CUtlVector< RenderProjectedMaterial_t > m_vecProjectedMaterials; // 0x0230
	CPerParticleFloatInput m_flMaterialSelection; // 0x0248
	float32 m_flAnimationTimeScale; // 0x03B8
	bool m_bOrientToNormal; // 0x03BC
	CUtlVector< MaterialVariable_t > m_MaterialVars; // 0x03C0
	CParticleCollectionFloatInput m_flRadiusScale; // 0x03D8
	CParticleCollectionFloatInput m_flAlphaScale; // 0x0548
	CParticleCollectionFloatInput m_flRollScale; // 0x06B8
	ParticleAttributeIndex_t m_nAlpha2Field; // 0x0828
	CParticleCollectionVecInput m_vecColorScale; // 0x0830
	ParticleColorBlendType_t m_nColorBlendType; // 0x0EE8
};
class CSteamAudioProbeData // steamaudio
{
	IPLProbeBatch m_pProbeBatch; // 0x0000
};
class VMixShaperDesc_t // soundsystem_lowlevel
{
	int32 m_nShape; // 0x0000
	float32 m_fldbDrive; // 0x0004
	float32 m_fldbOutputGain; // 0x0008
	float32 m_flWetMix; // 0x000C
	int32 m_nOversampleFactor; // 0x0010
};
class CAudioSentence // soundsystem_voicecontainers
{
	bool m_bShouldVoiceDuck; // 0x0000
	CUtlVector< CAudioPhonemeTag > m_RunTimePhonemes; // 0x0008
	CUtlVector< CAudioEmphasisSample > m_EmphasisSamples; // 0x0020
	CAudioMorphData m_morphData; // 0x0038
};
class CSequenceUpdateNode : public CSequenceUpdateNodeBase // animgraphlib
{
	HSequence m_hSequence; // 0x0078
	float32 m_duration; // 0x007C
	CParamSpanUpdater m_paramSpans; // 0x0080
	CUtlVector< TagSpan_t > m_tags; // 0x0098
};
class PermModelInfo_t // modellib
{
	uint32 m_nFlags; // 0x0000
	Vector m_vHullMin; // 0x0004
	Vector m_vHullMax; // 0x0010
	Vector m_vViewMin; // 0x001C
	Vector m_vViewMax; // 0x0028
	float32 m_flMass; // 0x0034
	Vector m_vEyePosition; // 0x0038
	float32 m_flMaxEyeDeflection; // 0x0044
	CUtlString m_sSurfaceProperty; // 0x0048
	CUtlString m_keyValueText; // 0x0050
};
class CNmBlendTask : public CNmBlendTaskBase // animlib
{
};
class CRemapValueUpdateItem // animgraphlib
{
	CAnimParamHandle m_hParamIn; // 0x0000
	CAnimParamHandle m_hParamOut; // 0x0002
	float32 m_flMinInputValue; // 0x0004
	float32 m_flMaxInputValue; // 0x0008
	float32 m_flMinOutputValue; // 0x000C
	float32 m_flMaxOutputValue; // 0x0010
};
class CWarpSectionAnimTag : public CWarpSectionAnimTagBase // animgraphlib
{
	bool m_bWarpPosition; // 0x0050
	bool m_bWarpOrientation; // 0x0051
};
class MoodAnimation_t // animationsystem
{
	CModelAnimNameWithDeltas m_sName; // 0x0000
	float32 m_flWeight; // 0x0008
};
class CVirtualAnimParameter : public CAnimParameterBase // animgraphlib
{
	CUtlString m_expressionString; // 0x0070
	AnimParamType_t m_eParamType; // 0x0078
};
class CVariantDefaultAllocator // entity2
{
};
class CompositeMaterialInputLooseVariable_t // compositematerialslib
{
	CUtlString m_strName; // 0x0000
	bool m_bExposeExternally; // 0x0008
	CUtlString m_strExposedFriendlyName; // 0x0010
	CUtlString m_strExposedFriendlyGroupName; // 0x0018
	bool m_bExposedVariableIsFixedRange; // 0x0020
	CUtlString m_strExposedVisibleWhenTrue; // 0x0028
	CUtlString m_strExposedHiddenWhenTrue; // 0x0030
	CUtlString m_strExposedValueList; // 0x0038
	CompositeMaterialInputLooseVariableType_t m_nVariableType; // 0x0040
	bool m_bValueBoolean; // 0x0044
	int32 m_nValueIntX; // 0x0048
	int32 m_nValueIntY; // 0x004C
	int32 m_nValueIntZ; // 0x0050
	int32 m_nValueIntW; // 0x0054
	bool m_bHasFloatBounds; // 0x0058
	float32 m_flValueFloatX; // 0x005C
	float32 m_flValueFloatX_Min; // 0x0060
	float32 m_flValueFloatX_Max; // 0x0064
	float32 m_flValueFloatY; // 0x0068
	float32 m_flValueFloatY_Min; // 0x006C
	float32 m_flValueFloatY_Max; // 0x0070
	float32 m_flValueFloatZ; // 0x0074
	float32 m_flValueFloatZ_Min; // 0x0078
	float32 m_flValueFloatZ_Max; // 0x007C
	float32 m_flValueFloatW; // 0x0080
	float32 m_flValueFloatW_Min; // 0x0084
	float32 m_flValueFloatW_Max; // 0x0088
	Color m_cValueColor4; // 0x008C
	CompositeMaterialVarSystemVar_t m_nValueSystemVar; // 0x0090
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIMaterial2 > > m_strResourceMaterial; // 0x0098
	CUtlString m_strTextureContentAssetPath; // 0x0178
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeCTextureBase > > m_strTextureRuntimeResourcePath; // 0x0180
	CUtlString m_strTextureCompilationVtexTemplate; // 0x0260
	CompositeMaterialInputTextureType_t m_nTextureType; // 0x0268
	CUtlString m_strString; // 0x0270
	CUtlString m_strPanoramaPanelPath; // 0x0278
	int32 m_nPanoramaRenderRes; // 0x0280
};
class C_INIT_NormalOffset : public CParticleFunctionInitializer // particles
{
	Vector m_OffsetMin; // 0x01D8
	Vector m_OffsetMax; // 0x01E4
	int32 m_nControlPointNumber; // 0x01F0
	bool m_bLocalCoords; // 0x01F4
	bool m_bNormalize; // 0x01F5
};
class C_INIT_SetAttributeToScalarExpression : public CParticleFunctionInitializer // particles
{
	ScalarExpressionType_t m_nExpression; // 0x01D8
	CPerParticleFloatInput m_flInput1; // 0x01E0
	CPerParticleFloatInput m_flInput2; // 0x0350
	CParticleRemapFloatInput m_flOutputRemap; // 0x04C0
	ParticleAttributeIndex_t m_nOutputField; // 0x0630
	ParticleSetMethod_t m_nSetMethod; // 0x0634
};
class CVMixShaperProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixShaperDesc_t m_desc; // 0x0020
};
class CVMixFreeverbProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixFreeverbDesc_t m_desc; // 0x0020
};
class FeFitInfluence_t // physicslib
{
	uint32 nVertexNode; // 0x0000
	float32 flWeight; // 0x0004
	uint32 nMatrixNode; // 0x0008
};
class CParticleVecInput : public CParticleInput // particleslib
{
	ParticleVecType_t m_nType; // 0x0010
	Vector m_vLiteralValue; // 0x0014
	Color m_LiteralColor; // 0x0020
	CParticleNamedValueRef m_NamedValue; // 0x0028
	bool m_bFollowNamedValue; // 0x0068
	ParticleAttributeIndex_t m_nVectorAttribute; // 0x006C
	Vector m_vVectorAttributeScale; // 0x0070
	int32 m_nControlPoint; // 0x007C
	int32 m_nDeltaControlPoint; // 0x0080
	Vector m_vCPValueScale; // 0x0084
	Vector m_vCPRelativePosition; // 0x0090
	Vector m_vCPRelativeDir; // 0x009C
	CParticleFloatInput m_FloatComponentX; // 0x00A8
	CParticleFloatInput m_FloatComponentY; // 0x0218
	CParticleFloatInput m_FloatComponentZ; // 0x0388
	CParticleFloatInput m_FloatInterp; // 0x04F8
	float32 m_flInterpInput0; // 0x0668
	float32 m_flInterpInput1; // 0x066C
	Vector m_vInterpOutput0; // 0x0670
	Vector m_vInterpOutput1; // 0x067C
	CColorGradient m_Gradient; // 0x0688
	Vector m_vRandomMin; // 0x06A0
	Vector m_vRandomMax; // 0x06AC
};
class CAnimUserDifference // animationsystem
{
	CBufferString m_name; // 0x0000
	int32 m_nType; // 0x0010
};
class CExampleSchemaVData_PolymorphicBase // resourcefile
{
	int32 m_nBase; // 0x0008
};
class C_OP_GameLiquidSpill : public CParticleFunctionRenderer // particles
{
	CParticleCollectionFloatInput m_flLiquidContentsField; // 0x0220
	CParticleCollectionFloatInput m_flExpirationTime; // 0x0390
	ParticleAttributeIndex_t m_nAmountAttribute; // 0x0500
};
class CPathMetricEvaluator : public CMotionMetricEvaluator // animgraphlib
{
	CUtlVector< float32 > m_pathTimeSamples; // 0x0050
	float32 m_flDistance; // 0x0068
	bool m_bExtrapolateMovement; // 0x006C
	float32 m_flMinExtrapolationSpeed; // 0x0070
};
class CNmCachedTargetNode::CDefinition : public CNmTargetValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	NmCachedValueMode_t m_mode; // 0x0014
};
class EventClientPreOutputParallelWithServer_t : public EventClientPreOutput_t // engine2
{
};
class C_OP_RenderAsModels : public CParticleFunctionRenderer // particles
{
	CUtlVector< ModelReference_t > m_ModelList; // 0x0220
	float32 m_flModelScale; // 0x023C
	bool m_bFitToModelSize; // 0x0240
	bool m_bNonUniformScaling; // 0x0241
	ParticleAttributeIndex_t m_nXAxisScalingAttribute; // 0x0244
	ParticleAttributeIndex_t m_nYAxisScalingAttribute; // 0x0248
	ParticleAttributeIndex_t m_nZAxisScalingAttribute; // 0x024C
	int32 m_nSizeCullBloat; // 0x0250
};
class C_OP_SetControlPointToPlayer : public CParticleFunctionPreEmission // particles
{
	int32 m_nCP1; // 0x01D8
	Vector m_vecCP1Pos; // 0x01DC
	bool m_bOrientToEyes; // 0x01E8
	ParticleEntityPos_t m_nPosition; // 0x01EC
};
class WorldNodeOnDiskBufferData_t // worldrenderer
{
	int32 m_nElementCount; // 0x0000
	int32 m_nElementSizeInBytes; // 0x0004
	CUtlVector< RenderInputLayoutField_t > m_inputLayoutFields; // 0x0008
	CUtlVector< uint8 > m_pData; // 0x0020
};
class CNmClipSelectorNode::CDefinition : public CNmClipReferenceNode::CDefinition // animlib
{
	CUtlLeanVectorFixedGrowable< int16, 5 > m_optionNodeIndices; // 0x0010
	CUtlLeanVectorFixedGrowable< int16, 5 > m_conditionNodeIndices; // 0x0028
};
class CBlockSelectionMetricEvaluator : public CMotionMetricEvaluator // animgraphlib
{
};
class PulseRegisterMap_t // pulse_runtime_lib
{
	KeyValues3 m_Inparams; // 0x0000
	CKV3MemberNameSet m_InparamsWhichCanBeMoved; // 0x0010
	KeyValues3 m_Outparams; // 0x0020
};
class CAnimActionUpdater // animgraphlib
{
};
class InfoForResourceTypeCTypeScriptResource // resourcesystem
{
};
class CNmSnapWeaponTask : public CNmPoseTask // server
{
};
class C_OP_MovementLoopInsideSphere : public CParticleFunctionOperator // particles
{
	int32 m_nCP; // 0x01D0
	CParticleCollectionFloatInput m_flDistance; // 0x01D8
	CParticleCollectionVecInput m_vecScale; // 0x0348
	ParticleAttributeIndex_t m_nDistSqrAttr; // 0x0A00
};
class C_OP_CycleScalar : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nDestField; // 0x01D0
	float32 m_flStartValue; // 0x01D4
	float32 m_flEndValue; // 0x01D8
	float32 m_flCycleTime; // 0x01DC
	bool m_bDoNotRepeatCycle; // 0x01E0
	bool m_bSynchronizeParticles; // 0x01E1
	int32 m_nCPScale; // 0x01E4
	int32 m_nCPFieldMin; // 0x01E8
	int32 m_nCPFieldMax; // 0x01EC
	ParticleSetMethod_t m_nSetMethod; // 0x01F0
};
class CVMixNameInput : public CVMixInputBase // soundsystem_lowlevel
{
	CUtlString m_defaultValue; // 0x0010
};
class CSceneObjectData // modellib
{
	Vector m_vMinBounds; // 0x0000
	Vector m_vMaxBounds; // 0x000C
	CUtlLeanVector< CMaterialDrawDescriptor > m_drawCalls; // 0x0018
	CUtlLeanVector< AABB_t > m_drawBounds; // 0x0028
	CUtlLeanVector< CMeshletDescriptor > m_meshlets; // 0x0038
	CUtlLeanVector< CSceneObjectData::RTProxyDrawDescriptor_t > m_rtProxyDrawCalls; // 0x0048
	Vector4D m_vTintColor; // 0x0058
};
class SkeletonAnimCapture_t::Bone_t // modellib
{
	CUtlString m_Name; // 0x0000
	CTransform m_BindPose; // 0x0010
	int32 m_nParent; // 0x0030
};
class CSlopeComponentUpdater : public CAnimComponentUpdater // animgraphlib
{
	float32 m_flTraceDistance; // 0x0034
	CAnimParamHandle m_hSlopeAngle; // 0x0038
	CAnimParamHandle m_hSlopeAngleFront; // 0x003A
	CAnimParamHandle m_hSlopeAngleSide; // 0x003C
	CAnimParamHandle m_hSlopeHeading; // 0x003E
	CAnimParamHandle m_hSlopeNormal; // 0x0040
	CAnimParamHandle m_hSlopeNormal_WorldSpace; // 0x0042
};
class EventClientPostOutput_t // engine2
{
	EngineLoopState_t m_LoopState; // 0x0000
	float64 m_flRenderTime; // 0x0028
	float32 m_flRenderFrameTime; // 0x0030
	float32 m_flRenderFrameTimeUnbounded; // 0x0034
	bool m_bRenderOnly; // 0x0038
};
class C_OP_RemapScalar : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldInput; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	float32 m_flInputMin; // 0x01D8
	float32 m_flInputMax; // 0x01DC
	float32 m_flOutputMin; // 0x01E0
	float32 m_flOutputMax; // 0x01E4
	bool m_bOldCode; // 0x01E8
};
class C_OP_DirectionBetweenVecsToVec : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	CPerParticleVecInput m_vecPoint1; // 0x01D8
	CPerParticleVecInput m_vecPoint2; // 0x0890
};
class C_OP_ReinitializeScalarEndCap : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	float32 m_flOutputMin; // 0x01D4
	float32 m_flOutputMax; // 0x01D8
};
class C_OP_NoiseEmitter : public CParticleFunctionEmitter // particles
{
	float32 m_flEmissionDuration; // 0x01D8
	float32 m_flStartTime; // 0x01DC
	float32 m_flEmissionScale; // 0x01E0
	int32 m_nScaleControlPoint; // 0x01E4
	int32 m_nScaleControlPointField; // 0x01E8
	int32 m_nWorldNoisePoint; // 0x01EC
	bool m_bAbsVal; // 0x01F0
	bool m_bAbsValInv; // 0x01F1
	float32 m_flOffset; // 0x01F4
	float32 m_flOutputMin; // 0x01F8
	float32 m_flOutputMax; // 0x01FC
	float32 m_flNoiseScale; // 0x0200
	float32 m_flWorldNoiseScale; // 0x0204
	Vector m_vecOffsetLoc; // 0x0208
	float32 m_flWorldTimeScale; // 0x0214
};
class CVMixDynamicsCompressorProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixDynamicsCompressorDesc_t m_desc; // 0x0020
};
class CVoiceContainerAsyncGenerator : public CVoiceContainerGenerator // soundsystem_voicecontainers
{
};
class FeNodeIntegrator_t // physicslib
{
	float32 flPointDamping; // 0x0000
	float32 flAnimationForceAttraction; // 0x0004
	float32 flAnimationVertexAttraction; // 0x0008
	float32 flGravity; // 0x000C
};
class FeWorldCollisionParams_t // physicslib
{
	float32 flWorldFriction; // 0x0000
	float32 flGroundFriction; // 0x0004
	uint16 nListBegin; // 0x0008
	uint16 nListEnd; // 0x000A
};
class CNmTargetOffsetNode::CDefinition : public CNmTargetValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	bool m_bIsBoneSpaceOffset; // 0x0012
	Quaternion m_rotationOffset; // 0x0020
	Vector m_translationOffset; // 0x0030
};
class CAnimFrameSegment // animationsystem
{
	int32 m_nUniqueFrameIndex; // 0x0000
	uint32 m_nLocalElementMasks; // 0x0004
	int32 m_nLocalChannel; // 0x0008
	CUtlBinaryBlock m_container; // 0x0010
};
class C_OP_QuantizeCPComponent : public CParticleFunctionPreEmission // particles
{
	CParticleCollectionFloatInput m_flInputValue; // 0x01D8
	int32 m_nCPOutput; // 0x0348
	int32 m_nOutVectorField; // 0x034C
	CParticleCollectionFloatInput m_flQuantizeValue; // 0x0350
};
class C_OP_PerParticleForce : public CParticleFunctionForce // particles
{
	CPerParticleFloatInput m_flForceScale; // 0x01E0
	CPerParticleVecInput m_vForce; // 0x0350
	int32 m_nCP; // 0x0A08
};
class CNmAndNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	CUtlLeanVectorFixedGrowable< int16, 4 > m_conditionNodeIndices; // 0x0010
};
class ParamSpan_t // animgraphlib
{
	CUtlVector< ParamSpanSample_t > m_samples; // 0x0000
	CAnimParamHandle m_hParam; // 0x0018
	AnimParamType_t m_eParamType; // 0x001A
	float32 m_flStartCycle; // 0x001C
	float32 m_flEndCycle; // 0x0020
};
class CNmFootEventConditionNode::CDefinition : public CNmBoolValueNode::CDefinition // animlib
{
	int16 m_nSourceStateNodeIdx; // 0x0010
	NmFootPhaseCondition_t m_phaseCondition; // 0x0012
	CNmBitFlags m_eventConditionRules; // 0x0014
};
class CBinaryUpdateNode : public CAnimUpdateNodeBase // animgraphlib
{
	CAnimUpdateNodeRef m_pChild1; // 0x0060
	CAnimUpdateNodeRef m_pChild2; // 0x0070
	BinaryNodeTiming m_timingBehavior; // 0x0080
	float32 m_flTimingBlend; // 0x0084
	bool m_bResetChild1; // 0x0088
	bool m_bResetChild2; // 0x0089
};
class PointCameraSettings_t // server
{
	float32 m_flNearBlurryDistance; // 0x0000
	float32 m_flNearCrispDistance; // 0x0004
	float32 m_flFarCrispDistance; // 0x0008
	float32 m_flFarBlurryDistance; // 0x000C
};
class FeEdgeDesc_t // physicslib
{
	uint16[2] nEdge; // 0x0000
	uint16[2][2] nSide; // 0x0004
	uint16[2] nVirtElem; // 0x000C
};
class FeMorphLayerDepr_t // physicslib
{
	CUtlString m_Name; // 0x0000
	uint32 m_nNameHash; // 0x0008
	CUtlVector< uint16 > m_Nodes; // 0x0010
	CUtlVector< Vector > m_InitPos; // 0x0028
	CUtlVector< float32 > m_Gravity; // 0x0040
	CUtlVector< float32 > m_GoalStrength; // 0x0058
	CUtlVector< float32 > m_GoalDamping; // 0x0070
	uint32 m_nFlags; // 0x0088
};
class CModelConfigElement // modellib
{
	CUtlString m_ElementName; // 0x0008
	CUtlVector< CModelConfigElement* > m_NestedElements; // 0x0010
};
class CLookAtUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	LookAtOpFixedSettings_t m_opFixedSettings; // 0x0070
	AnimVectorSource m_target; // 0x0148
	CAnimParamHandle m_paramIndex; // 0x014C
	CAnimParamHandle m_weightParamIndex; // 0x014E
	bool m_bResetChild; // 0x0150
	bool m_bLockWhenWaning; // 0x0151
};
class CNmFootstepEventPercentageThroughNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	int16 m_nSourceStateNodeIdx; // 0x0010
	NmFootPhaseCondition_t m_phaseCondition; // 0x0012
	CNmBitFlags m_eventConditionRules; // 0x0014
};
class EventClientSimulate_t : public EventSimulate_t // engine2
{
};
class InfoForResourceTypeIPulseGraphDef // resourcesystem
{
};
class CVoiceContainerSet : public CVoiceContainerBase // soundsystem_voicecontainers
{
	CUtlVector< CVoiceContainerSetElement > m_soundsToPlay; // 0x00A8
};
class CModelConfigElement_SetBodygroupOnAttachedModels : public CModelConfigElement // modellib
{
	CUtlString m_GroupName; // 0x0048
	int32 m_nChoice; // 0x0050
};
class CRenderMesh // modellib
{
	CUtlLeanVectorFixedGrowable< CSceneObjectData, 1 > m_sceneObjects; // 0x0010
	CUtlLeanVector< CBaseConstraint* > m_constraints; // 0x00B8
	CRenderSkeleton m_skeleton; // 0x00C8
	bool m_bUseUV2ForCharting; // 0x01D4
	bool m_bEmbeddedMapMesh; // 0x01D5
	DynamicMeshDeformParams_t m_meshDeformParams; // 0x01F8
	CRenderGroom* m_pGroomData; // 0x0208
};
class CPlayerControllerComponent // server
{
	CNetworkVarChainer __m_pChainEntity; // 0x0008
};
class C_OP_Decay : public CParticleFunctionOperator // particles
{
	bool m_bRopeDecay; // 0x01D0
	bool m_bForcePreserveParticleOrder; // 0x01D1
};
class C_OP_SnapshotSkinToBones : public CParticleFunctionOperator // particles
{
	bool m_bTransformNormals; // 0x01D0
	bool m_bTransformRadii; // 0x01D1
	int32 m_nControlPointNumber; // 0x01D4
	float32 m_flLifeTimeFadeStart; // 0x01D8
	float32 m_flLifeTimeFadeEnd; // 0x01DC
	float32 m_flJumpThreshold; // 0x01E0
	float32 m_flPrevPosScale; // 0x01E4
};
class CSceneObjectData::RTProxyDrawDescriptor_t // modellib
{
	CMaterialDrawDescriptor m_drawDesc; // 0x0000
	matrix3x4_t m_mWorldFromLocal; // 0x0108
	VertexAlbedoFormat_t m_nVertexAlbedoFormat; // 0x0138
	int8 m_nVertexAlbedoVB; // 0x0139
	uint16 m_nVertexAlbedoOffset; // 0x013A
	uint16 m_nVertexAlbedoStride; // 0x013C
};
class CNmFloatClampNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	Range_t m_clampRange; // 0x0014
};
class InfoForResourceTypeCNmIKRig // resourcesystem
{
};
class C_INIT_DistanceToNeighborCull : public CParticleFunctionInitializer // particles
{
	CPerParticleFloatInput m_flDistance; // 0x01D8
	bool m_bIncludeRadii; // 0x0348
	CPerParticleFloatInput m_flLifespanOverlap; // 0x0350
	ParticleAttributeIndex_t m_nFieldModify; // 0x04C0
	CPerParticleFloatInput m_flModify; // 0x04C8
	ParticleSetMethod_t m_nSetMethod; // 0x0638
	bool m_bUseNeighbor; // 0x063C
};
class CVMixAudioMeter // soundsystem_lowlevel
{
	CUtlString m_name; // 0x0000
	CUtlString m_displayName; // 0x0008
};
class FeRigidColliderIndices_t // physicslib
{
	uint16 m_nTaperedCapsuleRigidIndex; // 0x0000
	uint16 m_nSphereRigidIndex; // 0x0002
	uint16 m_nBoxRigidIndex; // 0x0004
	uint16 m_nSDFRigidIndex; // 0x0006
	uint16 m_nCollisionPlaneIndex; // 0x0008
};
class CNmVelocityBasedSpeedScaleNode::CDefinition : public CNmSpeedScaleBaseNode::CDefinition // animlib
{
};
class RenderSkeletonBone_t // modellib
{
	CUtlString m_boneName; // 0x0000
	CUtlString m_parentName; // 0x0008
	matrix3x4_t m_invBindPose; // 0x0010
	SkeletonBoneBounds_t m_bbox; // 0x0040
	float32 m_flSphereRadius; // 0x0058
};
class C_OP_RampCPLinearRandom : public CParticleFunctionPreEmission // particles
{
	int32 m_nOutControlPointNumber; // 0x01D8
	Vector m_vecRateMin; // 0x01DC
	Vector m_vecRateMax; // 0x01E8
};
class PhysShapeMarkup_t // modellib
{
	int32 m_nBodyInAggregate; // 0x0000
	int32 m_nShapeInBody; // 0x0004
	CGlobalSymbol m_sHitGroup; // 0x0008
};
class C_INIT_RemapParticleCountToNamedModelElementScalar : public C_INIT_RemapParticleCountToScalar // particles
{
	CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x0208
	CUtlString m_outputMinName; // 0x0210
	CUtlString m_outputMaxName; // 0x0218
	bool m_bModelFromRenderer; // 0x0220
};
class C_INIT_RandomScalar : public CParticleFunctionInitializer // particles
{
	float32 m_flMin; // 0x01D8
	float32 m_flMax; // 0x01DC
	float32 m_flExponent; // 0x01E0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01E4
};
class C_OP_InheritFromParentParticlesV2 : public CParticleFunctionOperator // particles
{
	CPerParticleFloatInput m_flScale; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x0340
	CPerParticleFloatInput m_nIncrement; // 0x0348
	bool m_bRandomDistribution; // 0x04B8
	bool m_bReverse; // 0x04B9
	MissingParentInheritBehavior_t m_nMissingParentBehavior; // 0x04BC
	CPerParticleFloatInput m_flInterpolation; // 0x04C0
};
class PointDefinitionWithTimeValues_t : public PointDefinition_t // particles
{
	float32 m_flTimeDuration; // 0x0014
};
class CNmPoseNode::CDefinition : public CNmGraphNode::CDefinition // animlib
{
};
class CAnimGraphNetworkSettings : public CAnimGraphSettingsGroup // animgraphlib
{
	bool m_bNetworkingEnabled; // 0x0020
};
class MaterialGroup_t // modellib
{
	CUtlString m_name; // 0x0000
	CUtlVector< CStrongHandle< InfoForResourceTypeIMaterial2 > > m_materials; // 0x0008
};
class CNmAdditiveBlendTask : public CNmBlendTaskBase // animlib
{
};
class CFollowTargetUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	FollowTargetOpFixedSettings_t m_opFixedData; // 0x0070
	CAnimParamHandle m_hParameterPosition; // 0x0088
	CAnimParamHandle m_hParameterOrientation; // 0x008A
};
class FeRodConstraint_t // physicslib
{
	uint16[2] nNode; // 0x0000
	float32 flMaxDist; // 0x0004
	float32 flMinDist; // 0x0008
	float32 flWeight0; // 0x000C
	float32 flRelaxationFactor; // 0x0010
};
class CNmRootMotionData // animlib
{
	CUtlVector< CTransform > m_transforms; // 0x0000
	int32 m_nNumFrames; // 0x0018
	float32 m_flAverageLinearVelocity; // 0x001C
	float32 m_flAverageAngularVelocityRadians; // 0x0020
	CTransform m_totalDelta; // 0x0030
};
class CBoneConstraintPoseSpaceMorph::Input_t // modellib
{
	Vector m_inputValue; // 0x0000
	CUtlVector< float32 > m_outputWeightList; // 0x0010
};
class CLeafUpdateNode : public CAnimUpdateNodeBase // animgraphlib
{
};
class PhysSoftbodyDesc_t // modellib
{
	CUtlVector< uint32 > m_ParticleBoneHash; // 0x0000
	CUtlVector< RnSoftbodyParticle_t > m_Particles; // 0x0018
	CUtlVector< RnSoftbodySpring_t > m_Springs; // 0x0030
	CUtlVector< RnSoftbodyCapsule_t > m_Capsules; // 0x0048
	CUtlVector< CTransform > m_InitPose; // 0x0060
	CUtlVector< CUtlString > m_ParticleBoneName; // 0x0078
};
class EntComponentInfo_t // entity2
{
	char* m_pName; // 0x0000
	char* m_pCPPClassname; // 0x0008
	char* m_pNetworkDataReferencedDescription; // 0x0010
	char* m_pNetworkDataReferencedPtrPropDescription; // 0x0018
	int32 m_nRuntimeIndex; // 0x0020
	uint32 m_nFlags; // 0x0024
	CEntityComponentHelper* m_pBaseClassComponentHelper; // 0x0060
};
class InfoForResourceTypeCPanoramaLayout // resourcesystem
{
};
class CRelativeLocation // server
{
	RelativeLocationType_t m_Type; // 0x0018
	Vector m_vRelativeOffset; // 0x001C
	VectorWS m_vWorldSpacePos; // 0x0028
	CHandle< CBaseEntity > m_hEntity; // 0x0034
};
class C_OP_RemapTransformToVelocity : public CParticleFunctionOperator // particles
{
	CParticleTransformInput m_TransformInput; // 0x01D0
};
class C_OP_RenderSprites : public CBaseRendererSource2 // particles
{
	CParticleCollectionRendererFloatInput m_nSequenceOverride; // 0x2DE8
	bool m_bSequenceNumbersAreRawSequenceIndices; // 0x2F58
	ParticleOrientationChoiceList_t m_nOrientationType; // 0x2F5C
	int32 m_nOrientationControlPoint; // 0x2F60
	bool m_bUseYawWithNormalAligned; // 0x2F64
	CParticleCollectionRendererFloatInput m_flMinSize; // 0x2F68
	CParticleCollectionRendererFloatInput m_flMaxSize; // 0x30D8
	CParticleCollectionRendererFloatInput m_flAlphaAdjustWithSizeAdjust; // 0x3248
	CParticleCollectionRendererFloatInput m_flStartFadeSize; // 0x33B8
	CParticleCollectionRendererFloatInput m_flEndFadeSize; // 0x3528
	float32 m_flStartFadeDot; // 0x3698
	float32 m_flEndFadeDot; // 0x369C
	bool m_bDistanceAlpha; // 0x36A0
	bool m_bSoftEdges; // 0x36A1
	float32 m_flEdgeSoftnessStart; // 0x36A4
	float32 m_flEdgeSoftnessEnd; // 0x36A8
	bool m_bOutline; // 0x36AC
	Color m_OutlineColor; // 0x36AD
	int32 m_nOutlineAlpha; // 0x36B4
	float32 m_flOutlineStart0; // 0x36B8
	float32 m_flOutlineStart1; // 0x36BC
	float32 m_flOutlineEnd0; // 0x36C0
	float32 m_flOutlineEnd1; // 0x36C4
	ParticleLightingQuality_t m_nLightingMode; // 0x36C8
	CParticleCollectionRendererVecInput m_vecLightingOverride; // 0x36D0
	CParticleCollectionRendererFloatInput m_flLightingTessellation; // 0x3D88
	CParticleCollectionRendererFloatInput m_flLightingDirectionality; // 0x3EF8
	bool m_bParticleShadows; // 0x4068
	float32 m_flShadowDensity; // 0x406C
	CReplicationParameters m_replicationParameters; // 0x4070
};
class CVMixControlOutput : public CVMixInputBase // soundsystem_lowlevel
{
	float32 m_flDefaultValue; // 0x0010
};
class CVMixConvolutionProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixConvolutionDesc_t m_desc; // 0x0020
};
class SkeletonAnimCapture_t // modellib
{
	CEntityIndex m_nEntIndex; // 0x0000
	CEntityIndex m_nEntParent; // 0x0004
	CUtlVector< CEntityIndex > m_ImportedCollision; // 0x0008
	CUtlString m_ModelName; // 0x0020
	CUtlString m_CaptureName; // 0x0028
	CUtlVector< SkeletonAnimCapture_t::Bone_t > m_ModelBindPose; // 0x0030
	CUtlVector< SkeletonAnimCapture_t::Bone_t > m_FeModelInitPose; // 0x0048
	int32 m_nFlexControllers; // 0x0060
	bool m_bPredicted; // 0x0064
	CUtlVector< SkeletonAnimCapture_t::Frame_t > m_Frames; // 0x00A8
};
class CMotionNodeSequence : public CMotionNode // animgraphlib
{
	CUtlVector< TagSpan_t > m_tags; // 0x0028
	HSequence m_hSequence; // 0x0040
	float32 m_flPlaybackSpeed; // 0x0044
};
class CNmControlParameterIDNode::CDefinition : public CNmIDValueNode::CDefinition // animlib
{
};
class CBtNodeComposite : public CBtNode // server
{
};
class CParticleFunction // particles
{
	CParticleCollectionFloatInput m_flOpStrength; // 0x0008
	ParticleEndcapMode_t m_nOpEndCapState; // 0x0178
	float32 m_flOpStartFadeInTime; // 0x017C
	float32 m_flOpEndFadeInTime; // 0x0180
	float32 m_flOpStartFadeOutTime; // 0x0184
	float32 m_flOpEndFadeOutTime; // 0x0188
	float32 m_flOpFadeOscillatePeriod; // 0x018C
	bool m_bNormalizeToStopTime; // 0x0190
	float32 m_flOpTimeOffsetMin; // 0x0194
	float32 m_flOpTimeOffsetMax; // 0x0198
	int32 m_nOpTimeOffsetSeed; // 0x019C
	int32 m_nOpTimeScaleSeed; // 0x01A0
	float32 m_flOpTimeScaleMin; // 0x01A4
	float32 m_flOpTimeScaleMax; // 0x01A8
	bool m_bDisableOperator; // 0x01AE
	CUtlString m_Notes; // 0x01B0
};
class C_OP_MoveToHitbox : public CParticleFunctionOperator // particles
{
	CParticleModelInput m_modelInput; // 0x01D0
	CParticleTransformInput m_transformInput; // 0x0230
	float32 m_flLifeTimeLerpStart; // 0x029C
	float32 m_flLifeTimeLerpEnd; // 0x02A0
	float32 m_flPrevPosScale; // 0x02A4
	char[128] m_HitboxSetName; // 0x02A8
	bool m_bUseBones; // 0x0328
	HitboxLerpType_t m_nLerpType; // 0x032C
	CPerParticleFloatInput m_flInterpolation; // 0x0330
};
class CSteamAudioBakedMaterialsData // steamaudio
{
	CSteamAudioProbeData m_probes; // 0x0000
	CUtlVector< uint32 > m_vecMaterialTokens; // 0x0008
	CUtlVector< float32 > m_vecMaterialWeights; // 0x0020
};
class CNmCachedPoseReadTask : public CNmPoseTask // animlib
{
};
class FootFixedSettings // animgraphlib
{
	TraceSettings_t m_traceSettings; // 0x0000
	VectorAligned m_vFootBaseBindPosePositionMS; // 0x0010
	float32 m_flFootBaseLength; // 0x0020
	float32 m_flMaxRotationLeft; // 0x0024
	float32 m_flMaxRotationRight; // 0x0028
	int32 m_footstepLandedTagIndex; // 0x002C
	bool m_bEnableTracing; // 0x0030
	float32 m_flTraceAngleBlend; // 0x0034
	int32 m_nDisableTagIndex; // 0x0038
	int32 m_nFootIndex; // 0x003C
};
class CAnimSequenceParams // animationsystem
{
	float32 m_flFadeInTime; // 0x0000
	float32 m_flFadeOutTime; // 0x0004
};
class CParticleSystemDefinition : public IParticleSystemDefinition // particles
{
	int32 m_nBehaviorVersion; // 0x0008
	CUtlVector< CParticleFunctionPreEmission* > m_PreEmissionOperators; // 0x0010
	CUtlVector< CParticleFunctionEmitter* > m_Emitters; // 0x0028
	CUtlVector< CParticleFunctionInitializer* > m_Initializers; // 0x0040
	CUtlVector< CParticleFunctionOperator* > m_Operators; // 0x0058
	CUtlVector< CParticleFunctionForce* > m_ForceGenerators; // 0x0070
	CUtlVector< CParticleFunctionConstraint* > m_Constraints; // 0x0088
	CUtlVector< CParticleFunctionRenderer* > m_Renderers; // 0x00A0
	CUtlVector< ParticleChildrenInfo_t > m_Children; // 0x00B8
	int32 m_nFirstMultipleOverride_BackwardCompat; // 0x0178
	int32 m_nInitialParticles; // 0x0258
	int32 m_nMaxParticles; // 0x025C
	int32 m_nGroupID; // 0x0260
	Vector m_BoundingBoxMin; // 0x0264
	Vector m_BoundingBoxMax; // 0x0270
	float32 m_flDepthSortBias; // 0x027C
	int32 m_nSortOverridePositionCP; // 0x0280
	bool m_bInfiniteBounds; // 0x0284
	bool m_bEnableNamedValues; // 0x0285
	CUtlString m_NamedValueDomain; // 0x0288
	CUtlVector< ParticleNamedValueSource_t* > m_NamedValueLocals; // 0x0290
	Color m_ConstantColor; // 0x02A8
	Vector m_ConstantNormal; // 0x02AC
	float32 m_flConstantRadius; // 0x02B8
	float32 m_flConstantRotation; // 0x02BC
	float32 m_flConstantRotationSpeed; // 0x02C0
	float32 m_flConstantLifespan; // 0x02C4
	int32 m_nConstantSequenceNumber; // 0x02C8
	int32 m_nConstantSequenceNumber1; // 0x02CC
	int32 m_nSnapshotControlPoint; // 0x02D0
	CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hSnapshot; // 0x02D8
	CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_pszCullReplacementName; // 0x02E0
	float32 m_flCullRadius; // 0x02E8
	float32 m_flCullFillCost; // 0x02EC
	int32 m_nCullControlPoint; // 0x02F0
	CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_hFallback; // 0x02F8
	int32 m_nFallbackMaxCount; // 0x0300
	CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_hLowViolenceDef; // 0x0308
	CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_hReferenceReplacement; // 0x0310
	float32 m_flPreSimulationTime; // 0x0318
	float32 m_flStopSimulationAfterTime; // 0x031C
	float32 m_flMaximumTimeStep; // 0x0320
	float32 m_flMaximumSimTime; // 0x0324
	float32 m_flMinimumSimTime; // 0x0328
	float32 m_flMinimumTimeStep; // 0x032C
	int32 m_nMinimumFrames; // 0x0330
	int32 m_nMinCPULevel; // 0x0334
	int32 m_nMinGPULevel; // 0x0338
	float32 m_flNoDrawTimeToGoToSleep; // 0x033C
	float32 m_flMaxDrawDistance; // 0x0340
	float32 m_flStartFadeDistance; // 0x0344
	float32 m_flMaxCreationDistance; // 0x0348
	int32 m_nAggregationMinAvailableParticles; // 0x034C
	float32 m_flAggregateRadius; // 0x0350
	bool m_bShouldBatch; // 0x0354
	bool m_bShouldHitboxesFallbackToRenderBounds; // 0x0355
	bool m_bShouldHitboxesFallbackToSnapshot; // 0x0356
	bool m_bShouldHitboxesFallbackToCollisionHulls; // 0x0357
	InheritableBoolType_t m_nViewModelEffect; // 0x0358
	bool m_bScreenSpaceEffect; // 0x035C
	CUtlSymbolLarge m_pszTargetLayerID; // 0x0360
	int32 m_nSkipRenderControlPoint; // 0x0368
	int32 m_nAllowRenderControlPoint; // 0x036C
	bool m_bShouldSort; // 0x0370
	CUtlVector< ParticleControlPointConfiguration_t > m_controlPointConfigurations; // 0x03B8
};
class C_INIT_InitVecCollection : public CParticleFunctionInitializer // particles
{
	CParticleCollectionVecInput m_InputValue; // 0x01D8
	ParticleAttributeIndex_t m_nOutputField; // 0x0890
};
class ExtraVertexStreamOverride_t : public BaseSceneObjectOverride_t // worldrenderer
{
	uint32 m_nSubSceneObject; // 0x0004
	uint32 m_nDrawCallIndex; // 0x0008
	MeshDrawPrimitiveFlags_t m_nAdditionalMeshDrawPrimitiveFlags; // 0x000C
	CRenderBufferBinding m_extraBufferBinding; // 0x0010
};
class VMixAutoFilterDesc_t // soundsystem_lowlevel
{
	float32 m_flEnvelopeAmount; // 0x0000
	float32 m_flAttackTimeMS; // 0x0004
	float32 m_flReleaseTimeMS; // 0x0008
	VMixFilterDesc_t m_filter; // 0x000C
	float32 m_flLFOAmount; // 0x001C
	float32 m_flLFORate; // 0x0020
	float32 m_flPhase; // 0x0024
	VMixLFOShape_t m_nLFOShape; // 0x0028
};
class VMixDynamicsDesc_t // soundsystem_lowlevel
{
	float32 m_fldbGain; // 0x0000
	float32 m_fldbNoiseGateThreshold; // 0x0004
	float32 m_fldbCompressionThreshold; // 0x0008
	float32 m_fldbLimiterThreshold; // 0x000C
	float32 m_fldbKneeWidth; // 0x0010
	float32 m_flRatio; // 0x0014
	float32 m_flLimiterRatio; // 0x0018
	float32 m_flAttackTimeMS; // 0x001C
	float32 m_flReleaseTimeMS; // 0x0020
	float32 m_flRMSTimeMS; // 0x0024
	float32 m_flWetMix; // 0x0028
	bool m_bPeakMode; // 0x002C
};
class CParticleAnimTag : public CAnimTagBase // animgraphlib
{
	CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_hParticleSystem; // 0x0058
	CUtlString m_particleSystemName; // 0x0060
	CUtlString m_configName; // 0x0068
	bool m_bDetachFromOwner; // 0x0070
	bool m_bAggregate; // 0x0071
	bool m_bStopWhenTagEnds; // 0x0072
	bool m_bTagEndStopIsInstant; // 0x0073
	CUtlString m_attachmentName; // 0x0078
	ParticleAttachment_t m_attachmentType; // 0x0080
	CUtlString m_attachmentCP1Name; // 0x0088
	ParticleAttachment_t m_attachmentCP1Type; // 0x0090
};
class CNmSkeleton::SecondarySkeleton_t // animlib
{
	CGlobalSymbol m_attachToBoneID; // 0x0000
	CStrongHandle< InfoForResourceTypeCNmSkeleton > m_skeleton; // 0x0008
};
class SoundeventPathCornerPairNetworked_t // server
{
	Vector vP1; // 0x0000
	Vector vP2; // 0x000C
	float32 flPathLengthSqr; // 0x0018
	float32 flP1Pct; // 0x001C
	float32 flP2Pct; // 0x0020
};
class CInButtonState // server
{
	uint64[3] m_pButtonStates; // 0x0008
};
class Relationship_t // server
{
	Disposition_t disposition; // 0x0000
	int32 priority; // 0x0004
};
class C_INIT_CreateFromPlaneCache : public CParticleFunctionInitializer // particles
{
	Vector m_vecOffsetMin; // 0x01D8
	Vector m_vecOffsetMax; // 0x01E4
	bool m_bUseNormal; // 0x01F1
};
class PointDefinition_t // particles
{
	int32 m_nControlPoint; // 0x0000
	bool m_bLocalCoords; // 0x0004
	Vector m_vOffset; // 0x0008
};
class CNmSyncTrack // animlib
{
	CUtlLeanVectorFixedGrowable< CNmSyncTrack::Event_t, 10 > m_syncEvents; // 0x0000
	int32 m_nStartEventOffset; // 0x00A8
};
class CAnimInputDamping // animgraphlib
{
	DampingSpeedFunction m_speedFunction; // 0x0008
	float32 m_fSpeedScale; // 0x000C
	float32 m_fFallingSpeedScale; // 0x0010
};
class CBoneConstraintBase // modellib
{
};
class InfoForResourceTypeIParticleSystemDefinition // resourcesystem
{
};
class CNmSnapWeaponNode::CDefinition : public CNmPassthroughNode::CDefinition // server
{
	int16 m_nEnabledNodeIdx; // 0x0018
	int16 m_nLockLeftHandNodeIdx; // 0x001A
	float32 m_flBlendTimeSeconds; // 0x001C
};
class CBaseRendererSource2 : public CParticleFunctionRenderer // particles
{
	CParticleCollectionRendererFloatInput m_flRadiusScale; // 0x0220
	CParticleCollectionRendererFloatInput m_flAlphaScale; // 0x0390
	CParticleCollectionRendererFloatInput m_flRollScale; // 0x0500
	ParticleAttributeIndex_t m_nAlpha2Field; // 0x0670
	CParticleCollectionRendererVecInput m_vecColorScale; // 0x0678
	ParticleColorBlendType_t m_nColorBlendType; // 0x0D30
	SpriteCardShaderType_t m_nShaderType; // 0x0D34
	CUtlString m_strShaderOverride; // 0x0D38
	CParticleCollectionRendererFloatInput m_flCenterXOffset; // 0x0D40
	CParticleCollectionRendererFloatInput m_flCenterYOffset; // 0x0EB0
	float32 m_flBumpStrength; // 0x1020
	ParticleSequenceCropOverride_t m_nCropTextureOverride; // 0x1024
	CUtlLeanVector< TextureGroup_t > m_vecTexturesInput; // 0x1028
	float32 m_flAnimationRate; // 0x1038
	AnimationType_t m_nAnimationType; // 0x103C
	bool m_bAnimateInFPS; // 0x1040
	CParticleCollectionRendererFloatInput m_flMotionVectorScaleU; // 0x1048
	CParticleCollectionRendererFloatInput m_flMotionVectorScaleV; // 0x11B8
	CParticleCollectionRendererFloatInput m_flSelfIllumAmount; // 0x1328
	CParticleCollectionRendererFloatInput m_flDiffuseAmount; // 0x1498
	CParticleCollectionRendererFloatInput m_flDiffuseClamp; // 0x1608
	int32 m_nLightingControlPoint; // 0x1778
	ParticleOutputBlendMode_t m_nOutputBlendMode; // 0x177C
	bool m_bGammaCorrectVertexColors; // 0x1780
	bool m_bSaturateColorPreAlphaBlend; // 0x1781
	CParticleCollectionRendererFloatInput m_flAddSelfAmount; // 0x1788
	CParticleCollectionRendererFloatInput m_flDesaturation; // 0x18F8
	CParticleCollectionRendererFloatInput m_flOverbrightFactor; // 0x1A68
	int32 m_nHSVShiftControlPoint; // 0x1BD8
	ParticleFogType_t m_nFogType; // 0x1BDC
	CParticleCollectionRendererFloatInput m_flFogAmount; // 0x1BE0
	bool m_bTintByFOW; // 0x1D50
	bool m_bTintByGlobalLight; // 0x1D51
	SpriteCardPerParticleScale_t m_nPerParticleAlphaReference; // 0x1D54
	SpriteCardPerParticleScale_t m_nPerParticleAlphaRefWindow; // 0x1D58
	ParticleAlphaReferenceType_t m_nAlphaReferenceType; // 0x1D5C
	CParticleCollectionRendererFloatInput m_flAlphaReferenceSoftness; // 0x1D60
	CParticleCollectionRendererFloatInput m_flSourceAlphaValueToMapToZero; // 0x1ED0
	CParticleCollectionRendererFloatInput m_flSourceAlphaValueToMapToOne; // 0x2040
	bool m_bRefract; // 0x21B0
	bool m_bRefractSolid; // 0x21B1
	CParticleCollectionRendererFloatInput m_flRefractAmount; // 0x21B8
	int32 m_nRefractBlurRadius; // 0x2328
	BlurFilterType_t m_nRefractBlurType; // 0x232C
	bool m_bOnlyRenderInEffectsBloomPass; // 0x2330
	bool m_bOnlyRenderInEffectsWaterPass; // 0x2331
	bool m_bUseMixedResolutionRendering; // 0x2332
	bool m_bOnlyRenderInEffecsGameOverlay; // 0x2333
	char[128] m_stencilTestID; // 0x2334
	bool m_bStencilTestExclude; // 0x23B4
	char[128] m_stencilWriteID; // 0x23B5
	bool m_bWriteStencilOnDepthPass; // 0x2435
	bool m_bWriteStencilOnDepthFail; // 0x2436
	bool m_bReverseZBuffering; // 0x2437
	bool m_bDisableZBuffering; // 0x2438
	ParticleDepthFeatheringMode_t m_nFeatheringMode; // 0x243C
	CParticleCollectionRendererFloatInput m_flFeatheringMinDist; // 0x2440
	CParticleCollectionRendererFloatInput m_flFeatheringMaxDist; // 0x25B0
	CParticleCollectionRendererFloatInput m_flFeatheringFilter; // 0x2720
	CParticleCollectionRendererFloatInput m_flFeatheringDepthMapFilter; // 0x2890
	CParticleCollectionRendererFloatInput m_flDepthBias; // 0x2A00
	ParticleSortingChoiceList_t m_nSortMethod; // 0x2B70
	bool m_bBlendFramesSeq0; // 0x2B74
	bool m_bMaxLuminanceBlendingSequence0; // 0x2B75
};
class C_OP_GameDecalRenderer : public CParticleFunctionRenderer // particles
{
	CGlobalSymbol m_sDecalGroupName; // 0x0220
	EventTypeSelection_t m_nEventType; // 0x0228
	ParticleCollisionMask_t m_nInteractionMask; // 0x0230
	ParticleCollisionGroup_t m_nCollisionGroup; // 0x0238
	CPerParticleVecInput m_vecStartPos; // 0x0240
	CPerParticleVecInput m_vecEndPos; // 0x08F8
	CPerParticleFloatInput m_flTraceBloat; // 0x0FB0
	CPerParticleFloatInput m_flDecalSize; // 0x1120
	CPerParticleFloatInput m_nDecalGroupIndex; // 0x1290
	CPerParticleFloatInput m_flDecalRotation; // 0x1400
	CPerParticleVecInput m_vModulationColor; // 0x1570
	bool m_bUseGameDefaultDecalSize; // 0x1C28
	bool m_bRandomDecalRotation; // 0x1C29
	bool m_bRandomlySelectDecalInGroup; // 0x1C2A
	bool m_bNoDecalsOnOwner; // 0x1C2B
	bool m_bVisualizeTraces; // 0x1C2C
};
class CExpressionActionUpdater : public CAnimActionUpdater // animgraphlib
{
	CAnimParamHandle m_hParam; // 0x0018
	AnimParamType_t m_eParamType; // 0x001A
	AnimScriptHandle m_hScript; // 0x001C
};
class CNmClipNode::CDefinition : public CNmClipReferenceNode::CDefinition // animlib
{
	int16 m_nPlayInReverseValueNodeIdx; // 0x0010
	int16 m_nResetTimeValueNodeIdx; // 0x0012
	bool m_bSampleRootMotion; // 0x0014
	bool m_bAllowLooping; // 0x0015
	int16 m_nDataSlotIdx; // 0x0016
	CUtlVectorFixedGrowable< CGlobalSymbol, 2 > m_graphEvents; // 0x0018
	float32 m_flSpeedMultiplier; // 0x0040
	int32 m_nStartSyncEventOffset; // 0x0044
};
class CNmSpeedScaleBaseNode::CDefinition : public CNmPassthroughNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0018
	float32 m_flDefaultInputValue; // 0x001C
};
class CStaticPoseCache // animgraphlib
{
	CUtlVector< CCachedPose > m_poses; // 0x0010
	int32 m_nBoneCount; // 0x0028
	int32 m_nMorphCount; // 0x002C
};
class InfoForResourceTypeCSurfaceGraph // resourcesystem
{
};
class C_OP_RenderBlobs : public CParticleFunctionRenderer // particles
{
	CParticleCollectionRendererFloatInput m_cubeWidth; // 0x0220
	CParticleCollectionRendererFloatInput m_cutoffRadius; // 0x0390
	CParticleCollectionRendererFloatInput m_renderRadius; // 0x0500
	uint32 m_nVertexCountKb; // 0x0670
	uint32 m_nIndexCountKb; // 0x0674
	int32 m_nScaleCP; // 0x0678
	CUtlVector< MaterialVariable_t > m_MaterialVars; // 0x0680
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x06B0
};
class CVMixStereoDelayProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
};
class PulseRuntimeDomainValueIndex_t // pulse_runtime_lib
{
	int16 m_Value; // 0x0000
};
class CAnimDataChannelDesc // animationsystem
{
	CBufferString m_szChannelClass; // 0x0000
	CBufferString m_szVariableName; // 0x0010
	int32 m_nFlags; // 0x0020
	int32 m_nType; // 0x0024
	CBufferString m_szGrouping; // 0x0028
	CBufferString m_szDescription; // 0x0038
	CUtlVector< CBufferString > m_szElementNameArray; // 0x0048
	CUtlVector< int32 > m_nElementIndexArray; // 0x0060
	CUtlVector< uint32 > m_nElementMaskArray; // 0x0078
};
class PostProcessingBloomParameters_t // materialsystem2
{
	BloomBlendMode_t m_blendMode; // 0x0000
	float32 m_flBloomStrength; // 0x0004
	float32 m_flScreenBloomStrength; // 0x0008
	float32 m_flBlurBloomStrength; // 0x000C
	float32 m_flBloomThreshold; // 0x0010
	float32 m_flBloomThresholdWidth; // 0x0014
	float32 m_flSkyboxBloomStrength; // 0x0018
	float32 m_flBloomStartValue; // 0x001C
	float32 m_flComputeBloomStrength; // 0x0020
	float32 m_flComputeBloomThreshold; // 0x0024
	float32 m_flComputeBloomRadius; // 0x0028
	float32 m_flComputeBloomEffectsScale; // 0x002C
	float32 m_flComputeBloomLensDirtStrength; // 0x0030
	float32 m_flComputeBloomLensDirtBlackLevel; // 0x0034
	float32[5] m_flBlurWeight; // 0x0038
	Vector[5] m_vBlurTint; // 0x004C
};
class CCS2ChickenGraphController : public CAnimGraphControllerBase // server
{
	CAnimGraph2ParamOptionalRef< CGlobalSymbol > m_action; // 0x0090
	CAnimGraph2ParamOptionalRef< CGlobalSymbol > m_actionSubtype; // 0x00A8
	CAnimGraph2ParamAutoResetOptionalRef m_bActionReset; // 0x00C0
	CAnimGraph2ParamOptionalRef< float32 > m_idleVariation; // 0x00E0
	CAnimGraph2ParamOptionalRef< float32 > m_runVariation; // 0x00F8
	CAnimGraph2ParamOptionalRef< float32 > m_panicVariation; // 0x0110
	CAnimGraph2ParamOptionalRef< float32 > m_squatVariation; // 0x0128
	CAnimGraph2ParamOptionalRef< bool > m_bInWater; // 0x0140
	bool m_bHasActionCompletedEvent; // 0x0158
	bool m_bWaitingForCompletedEvent; // 0x0159
};
class C_OP_FadeAndKill : public CParticleFunctionOperator // particles
{
	float32 m_flStartFadeInTime; // 0x01D0
	float32 m_flEndFadeInTime; // 0x01D4
	float32 m_flStartFadeOutTime; // 0x01D8
	float32 m_flEndFadeOutTime; // 0x01DC
	float32 m_flStartAlpha; // 0x01E0
	float32 m_flEndAlpha; // 0x01E4
	bool m_bForcePreserveParticleOrder; // 0x01E8
};
class C_INIT_CreateSpiralSphere : public CParticleFunctionInitializer // particles
{
	int32 m_nControlPointNumber; // 0x01D8
	int32 m_nOverrideCP; // 0x01DC
	int32 m_nDensity; // 0x01E0
	float32 m_flInitialRadius; // 0x01E4
	float32 m_flInitialSpeedMin; // 0x01E8
	float32 m_flInitialSpeedMax; // 0x01EC
	bool m_bUseParticleCount; // 0x01F0
};
class C_OP_EnableChildrenFromParentParticleCount : public CParticleFunctionPreEmission // particles
{
	int32 m_nChildGroupID; // 0x01D8
	int32 m_nFirstChild; // 0x01DC
	CParticleCollectionFloatInput m_nNumChildrenToEnable; // 0x01E0
	bool m_bDisableChildren; // 0x0350
	bool m_bPlayEndcapOnStop; // 0x0351
	bool m_bDestroyImmediately; // 0x0352
};
class CEntityComponentHelper // entity2
{
	uint32 m_flags; // 0x0008
	EntComponentInfo_t* m_pInfo; // 0x0010
	int32 m_nPriority; // 0x0018
	CEntityComponentHelper* m_pNext; // 0x0020
};
class C_OP_UpdateLightSource : public CParticleFunctionOperator // particles
{
	Color m_vColorTint; // 0x01D0
	float32 m_flBrightnessScale; // 0x01D4
	float32 m_flRadiusScale; // 0x01D8
	float32 m_flMinimumLightingRadius; // 0x01DC
	float32 m_flMaximumLightingRadius; // 0x01E0
	float32 m_flPositionDampingConstant; // 0x01E4
};
class CVMixControlMeter : public CVMixInputBase // soundsystem_lowlevel
{
	int32 m_nValueIndex; // 0x0010
};
class CNmClipReferenceNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
};
class CRootUpdateNode : public CUnaryUpdateNode // animgraphlib
{
};
class CNmDurationScaleNode::CDefinition : public CNmSpeedScaleBaseNode::CDefinition // animlib
{
};
class CAnimTagManagerUpdater // animgraphlib
{
	CUtlVector< CSmartPtr< CAnimTagBase > > m_tags; // 0x0038
};
class CPhysicsShake // server
{
	Vector m_force; // 0x0008
};
class C_OP_SpinUpdate : public CSpinUpdateBase // particles
{
};
class C_OP_MovementSkinnedPositionFromCPSnapshot : public CParticleFunctionOperator // particles
{
	int32 m_nSnapshotControlPointNumber; // 0x01D0
	int32 m_nControlPointNumber; // 0x01D4
	bool m_bRandom; // 0x01D8
	int32 m_nRandomSeed; // 0x01DC
	bool m_bSetNormal; // 0x01E0
	bool m_bSetRadius; // 0x01E1
	SnapshotIndexType_t m_nIndexType; // 0x01E4
	CPerParticleFloatInput m_flReadIndex; // 0x01E8
	CParticleCollectionFloatInput m_flIncrement; // 0x0358
	CParticleCollectionFloatInput m_nFullLoopIncrement; // 0x04C8
	CParticleCollectionFloatInput m_nSnapShotStartPoint; // 0x0638
	CPerParticleFloatInput m_flInterpolation; // 0x07A8
};
class C_OP_OscillateScalar : public CParticleFunctionOperator // particles
{
	float32 m_RateMin; // 0x01D0
	float32 m_RateMax; // 0x01D4
	float32 m_FrequencyMin; // 0x01D8
	float32 m_FrequencyMax; // 0x01DC
	ParticleAttributeIndex_t m_nField; // 0x01E0
	bool m_bProportional; // 0x01E4
	bool m_bProportionalOp; // 0x01E5
	float32 m_flStartTime_min; // 0x01E8
	float32 m_flStartTime_max; // 0x01EC
	float32 m_flEndTime_min; // 0x01F0
	float32 m_flEndTime_max; // 0x01F4
	float32 m_flOscMult; // 0x01F8
	float32 m_flOscAdd; // 0x01FC
};
class CVoiceContainerShapedNoise : public CVoiceContainerGenerator // soundsystem_voicecontainers
{
	bool m_bUseCurveForFrequency; // 0x00A8
	float32 m_flFrequency; // 0x00AC
	CPiecewiseCurve m_frequencySweep; // 0x00B0
	bool m_bUseCurveForResonance; // 0x00F0
	float32 m_flResonance; // 0x00F4
	CPiecewiseCurve m_resonanceSweep; // 0x00F8
	bool m_bUseCurveForAmplitude; // 0x0138
	float32 m_flGainInDecibels; // 0x013C
	CPiecewiseCurve m_gainSweep; // 0x0140
};
class FeNodeStrayBox_t // physicslib
{
	Vector vMin; // 0x0000
	uint32 nFlags; // 0x000C
	Vector vMax; // 0x0010
	uint16[2] nNode; // 0x001C
};
class FeSoftParent_t // physicslib
{
	int32 nParent; // 0x0000
	float32 flAlpha; // 0x0004
};
class CNmMaterialAttributeEvent : public CNmEvent // animlib
{
	CUtlString m_attributeName; // 0x0020
	CUtlStringToken m_attributeNameToken; // 0x0028
	CPiecewiseCurve m_x; // 0x0030
	CPiecewiseCurve m_y; // 0x0070
	CPiecewiseCurve m_z; // 0x00B0
	CPiecewiseCurve m_w; // 0x00F0
};
class CHandshakeAnimTagBase : public CAnimTagBase // animgraphlib
{
	bool m_bIsDisableTag; // 0x0050
};
class AutoRoomDoorwayPairs_t // server
{
	Vector vP1; // 0x0000
	Vector vP2; // 0x000C
};
class C_OP_RemapCPtoScalar : public CParticleFunctionOperator // particles
{
	int32 m_nCPInput; // 0x01D0
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D4
	int32 m_nField; // 0x01D8
	float32 m_flInputMin; // 0x01DC
	float32 m_flInputMax; // 0x01E0
	float32 m_flOutputMin; // 0x01E4
	float32 m_flOutputMax; // 0x01E8
	float32 m_flStartTime; // 0x01EC
	float32 m_flEndTime; // 0x01F0
	float32 m_flInterpRate; // 0x01F4
	ParticleSetMethod_t m_nSetMethod; // 0x01F8
};
class C_OP_PinParticleToCP : public CParticleFunctionOperator // particles
{
	int32 m_nControlPointNumber; // 0x01D0
	CParticleCollectionVecInput m_vecOffset; // 0x01D8
	bool m_bOffsetLocal; // 0x0890
	ParticleSelection_t m_nParticleSelection; // 0x0894
	CParticleCollectionFloatInput m_nParticleNumber; // 0x0898
	ParticlePinDistance_t m_nPinBreakType; // 0x0A08
	CParticleCollectionFloatInput m_flBreakDistance; // 0x0A10
	CParticleCollectionFloatInput m_flBreakSpeed; // 0x0B80
	CParticleCollectionFloatInput m_flAge; // 0x0CF0
	int32 m_nBreakControlPointNumber; // 0x0E60
	int32 m_nBreakControlPointNumber2; // 0x0E64
	CParticleCollectionFloatInput m_flBreakValue; // 0x0E68
	CPerParticleFloatInput m_flInterpolation; // 0x0FD8
	bool m_bRetainInitialVelocity; // 0x1148
};
class VMixFlangerDesc_t // soundsystem_lowlevel
{
	bool m_bPhaseInvert; // 0x0000
	float32 m_flGlideTime; // 0x0004
	float32 m_flDelay; // 0x0008
	float32 m_flOutputGain; // 0x000C
	float32 m_flFeedbackGain; // 0x0010
	float32 m_flFeedforwardGain; // 0x0014
	float32 m_flModRate; // 0x0018
	float32 m_flModDepth; // 0x001C
	bool m_bApplyAntialiasing; // 0x0020
};
class CModelConfigElement_UserPick : public CModelConfigElement // modellib
{
	CUtlVector< CUtlString > m_Choices; // 0x0048
};
class CFootFallAnimTag : public CAnimTagBase // animgraphlib
{
	FootFallTagFoot_t m_foot; // 0x0058
};
class SkeletonAnimCapture_t::Frame_t // modellib
{
	float32 m_flTime; // 0x0000
	SkeletonAnimCapture_t::FrameStamp_t m_Stamp; // 0x0004
	CTransform m_Transform; // 0x0020
	bool m_bTeleport; // 0x0040
	CUtlVector< CTransform > m_CompositeBones; // 0x0048
	CUtlVector< CTransform > m_SimStateBones; // 0x0060
	CUtlVector< CTransform > m_FeModelAnims; // 0x0078
	CUtlVector< VectorAligned > m_FeModelPos; // 0x0090
	CUtlVector< float32 > m_FlexControllerWeights; // 0x00A8
};
class IKTargetSettings_t // animgraphlib
{
	IKTargetSource m_TargetSource; // 0x0000
	IKBoneNameAndIndex_t m_Bone; // 0x0008
	AnimParamID m_AnimgraphParameterNamePosition; // 0x0018
	AnimParamID m_AnimgraphParameterNameOrientation; // 0x001C
	IKTargetCoordinateSystem m_TargetCoordSystem; // 0x0020
};
class C_OP_NormalLock : public CParticleFunctionOperator // particles
{
	int32 m_nControlPointNumber; // 0x01D0
};
class C_INIT_RemapParticleCountToNamedModelBodyPartScalar : public C_INIT_RemapParticleCountToNamedModelElementScalar // particles
{
};
class C_OP_SetVariable : public CParticleFunctionPreEmission // particles
{
	CParticleVariableRef m_variableReference; // 0x01D8
	CParticleTransformInput m_transformInput; // 0x0228
	Vector m_positionOffset; // 0x0290
	QAngle m_rotationOffset; // 0x029C
	CParticleCollectionVecInput m_vecInput; // 0x02A8
	CParticleCollectionFloatInput m_floatInput; // 0x0960
};
class RnFace_t // physicslib
{
	uint8 m_nEdge; // 0x0000
};
class CAnimUpdateSharedData // animgraphlib
{
	CUtlVector< CSmartPtr< CAnimUpdateNodeBase > > m_nodes; // 0x0010
	CUtlHashtable< CAnimNodePath, int32 > m_nodeIndexMap; // 0x0028
	CUtlVector< CSmartPtr< CAnimComponentUpdater > > m_components; // 0x0048
	CSmartPtr< CAnimParameterManagerUpdater > m_pParamListUpdater; // 0x0060
	CSmartPtr< CAnimTagManagerUpdater > m_pTagManagerUpdater; // 0x0068
	CSmartPtr< CAnimScriptManager > m_scriptManager; // 0x0070
	CAnimGraphSettingsManager m_settings; // 0x0078
	CSmartPtr< CStaticPoseCacheBuilder > m_pStaticPoseCache; // 0x00A8
	CSmartPtr< CAnimSkeleton > m_pSkeleton; // 0x00B0
	CAnimNodePath m_rootNodePath; // 0x00B8
};
class CRopeOverlapHit // server
{
	CHandle< CBaseEntity > m_hEntity; // 0x0000
	CUtlVector< int32 > m_vecOverlappingLinks; // 0x0008
};
class CNavVolumeVector : public CNavVolume // navlib
{
	bool m_bHasBeenPreFiltered; // 0x0080
};
class FeBandBendLimit_t // physicslib
{
	float32 flDistMin; // 0x0000
	float32 flDistMax; // 0x0004
	uint16[6] nNode; // 0x0008
};
class CMovementComponentUpdater : public CAnimComponentUpdater // animgraphlib
{
	CUtlVector< CSmartPtr< CAnimMotorUpdaterBase > > m_motors; // 0x0030
	CAnimInputDamping m_facingDamping; // 0x0048
	int32 m_nDefaultMotorIndex; // 0x0068
	float32 m_flDefaultRunSpeed; // 0x006C
	bool m_bMoveVarsDisabled; // 0x0070
	bool m_bNetworkPath; // 0x0071
	bool m_bNetworkFacing; // 0x0072
	CAnimParamHandle[34] m_paramHandles; // 0x0073
};
class ScriptInfo_t // animgraphlib
{
	CUtlString m_code; // 0x0000
	CUtlVector< CAnimParamHandle > m_paramsModified; // 0x0008
	CUtlVector< int32 > m_proxyReadParams; // 0x0020
	CUtlVector< int32 > m_proxyWriteParams; // 0x0038
	AnimScriptType m_eScriptType; // 0x0050
};
class AnimationDecodeDebugDump_t // animationsystem
{
	AnimationProcessingType_t m_processingType; // 0x0000
	CUtlVector< AnimationDecodeDebugDumpElement_t > m_elems; // 0x0008
};
class CHintMessageQueue // server
{
	float32 m_tmMessageEnd; // 0x0000
	CUtlVector< CHintMessage* > m_messages; // 0x0008
	CBasePlayerController* m_pPlayerController; // 0x0020
};
class WaterWheelDrag_t // server
{
	float32 m_flFractionOfWheelSubmerged; // 0x0000
	float32 m_flWheelDrag; // 0x0004
};
class C_OP_LazyCullCompareFloat : public CParticleFunctionOperator // particles
{
	CPerParticleFloatInput m_flComparsion1; // 0x01D0
	CPerParticleFloatInput m_flComparsion2; // 0x0340
	CPerParticleFloatInput m_flCullTime; // 0x04B0
};
class C_INIT_GlobalScale : public CParticleFunctionInitializer // particles
{
	float32 m_flScale; // 0x01D8
	int32 m_nScaleControlPointNumber; // 0x01DC
	int32 m_nControlPointNumber; // 0x01E0
	bool m_bScaleRadius; // 0x01E4
	bool m_bScalePosition; // 0x01E5
	bool m_bScaleVelocity; // 0x01E6
};
class RnWing_t // physicslib
{
	int32[3] m_nIndex; // 0x0000
};
class FeModelSelfCollisionLayer_t // physicslib
{
	CUtlString m_Name; // 0x0000
	CUtlVector< uint16 > m_Nodes; // 0x0008
	float32 m_flParentReaction; // 0x0020
	uint32 m_nFlags; // 0x0024
	uint32[4] m_nEndIdx; // 0x0028
};
class CNmTransitionNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
	int16 m_nTargetStateNodeIdx; // 0x0010
	int16 m_nDurationOverrideNodeIdx; // 0x0012
	int16 m_timeOffsetOverrideNodeIdx; // 0x0014
	int16 m_startBoneMaskNodeIdx; // 0x0016
	float32 m_flDuration; // 0x0018
	NmPercent_t m_boneMaskBlendInTimePercentage; // 0x001C
	float32 m_flTimeOffset; // 0x0020
	CNmBitFlags m_transitionOptions; // 0x0024
	int16 m_targetSyncIDNodeIdx; // 0x0028
	NmEasingOperation_t m_blendWeightEasing; // 0x002A
	NmRootMotionBlendMode_t m_rootMotionBlend; // 0x002B
};
class CSeqCmdLayer // animationsystem
{
	int16 m_cmd; // 0x0000
	int16 m_nLocalReference; // 0x0002
	int16 m_nLocalBonemask; // 0x0004
	int16 m_nDstResult; // 0x0006
	int16 m_nSrcResult; // 0x0008
	bool m_bSpline; // 0x000A
	float32 m_flVar1; // 0x000C
	float32 m_flVar2; // 0x0010
	int16 m_nLineNumber; // 0x0014
};
class GameTick_t // entity2
{
	int32 m_Value; // 0x0000
};
class CVoiceContainerLoopXFade : public CVoiceContainerBase // soundsystem_voicecontainers
{
	CSoundContainerReference m_sound; // 0x00A8
	float32 m_flLoopEnd; // 0x00C0
	float32 m_flLoopStart; // 0x00C4
	float32 m_flFadeOut; // 0x00C8
	float32 m_flFadeIn; // 0x00CC
	bool m_bPlayHead; // 0x00D0
	bool m_bPlayTail; // 0x00D1
	bool m_bEqualPow; // 0x00D2
};
class CastSphereSATParams_t // physicslib
{
	Vector m_vRayStart; // 0x0000
	Vector m_vRayDelta; // 0x000C
	float32 m_flRadius; // 0x0018
	float32 m_flMaxFraction; // 0x001C
	float32 m_flScale; // 0x0020
	RnHull_t* m_pHull; // 0x0028
};
class FeAntiTunnelGroupBuild_t // physicslib
{
	uint32 m_nVertexMapHash; // 0x0000
	uint32 m_nCollisionMask; // 0x0004
};
class CFootstepLandedAnimTag : public CAnimTagBase // animgraphlib
{
	FootstepLandedFootSoundType_t m_FootstepType; // 0x0058
	CUtlString m_OverrideSoundName; // 0x0060
	CUtlString m_DebugAnimSourceString; // 0x0068
	CUtlString m_BoneName; // 0x0070
	FootstepJumpPhase_t m_footstepJumpPhase; // 0x0078
};
class CNmEntityAttributeIntEvent : public CNmEntityAttributeEventBase // animlib
{
	int32 m_nIntValue; // 0x0038
};
class EventSplitScreenStateChanged_t // engine2
{
};
class CRandSimTimer : public CSimpleSimTimer // server
{
	float32 m_flMinInterval; // 0x0008
	float32 m_flMaxInterval; // 0x000C
};
class CSteamAudioCompressedReverb // steamaudio
{
	int32 m_nChannels; // 0x0000
	int32 m_nBands; // 0x0004
	int32 m_nBins; // 0x0008
	int32 m_nProbes; // 0x000C
	CUtlVector< int32 > m_vecNumSingularValues; // 0x0010
	CUtlVector< float32 > m_vecDictionary; // 0x0028
	CUtlVector< float32 > m_vecCompressedData; // 0x0040
	IPLCompressedEnergyFields m_pCompressedData; // 0x0058
};
class EventClientPollInput_t // engine2
{
	EngineLoopState_t m_LoopState; // 0x0000
	float32 m_flRealTime; // 0x0028
};
class C_OP_RenderPoints : public CParticleFunctionRenderer // particles
{
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x0220
};
class C_OP_SetCPOrientationToPointAtCP : public CParticleFunctionPreEmission // particles
{
	int32 m_nInputCP; // 0x01D8
	int32 m_nOutputCP; // 0x01DC
	CParticleCollectionFloatInput m_flInterpolation; // 0x01E0
	bool m_b2DOrientation; // 0x0350
	bool m_bAvoidSingularity; // 0x0351
	bool m_bPointAway; // 0x0352
};
class CVoiceContainerDefault : public CVoiceContainerBase // soundsystem_voicecontainers
{
};
class RnCapsuleDesc_t : public RnShapeDesc_t // physicslib
{
	RnCapsule_t m_Capsule; // 0x0018
};
class RnHull_t // physicslib
{
	Vector m_vCentroid; // 0x0000
	float32 m_flMaxAngularRadius; // 0x000C
	AABB_t m_Bounds; // 0x0010
	Vector m_vOrthographicAreas; // 0x0028
	matrix3x4_t m_MassProperties; // 0x0034
	float32 m_flVolume; // 0x0064
	float32 m_flSurfaceArea; // 0x0068
	CUtlVector< RnVertex_t > m_Vertices; // 0x0070
	CUtlVector< Vector > m_VertexPositions; // 0x0088
	CUtlVector< RnHalfEdge_t > m_Edges; // 0x00A0
	CUtlVector< RnFace_t > m_Faces; // 0x00B8
	CUtlVector< RnPlane_t > m_FacePlanes; // 0x00D0
	uint32 m_nFlags; // 0x00E8
	CRegionSVM* m_pRegionSVM; // 0x00F0
};
class CNmBoneMaskBlendNode::CDefinition : public CNmBoneMaskValueNode::CDefinition // animlib
{
	int16 m_nSourceMaskNodeIdx; // 0x0010
	int16 m_nTargetMaskNodeIdx; // 0x0012
	int16 m_nBlendWeightValueNodeIdx; // 0x0014
};
class CFootPinningUpdateNode : public CUnaryUpdateNode // animgraphlib
{
	FootPinningPoseOpFixedData_t m_poseOpFixedData; // 0x0078
	FootPinningTimingSource m_eTimingSource; // 0x00A8
	CUtlVector< CAnimParamHandle > m_params; // 0x00B0
	bool m_bResetChild; // 0x00C8
};
class EventClientPostSimulate_t : public EventSimulate_t // engine2
{
};
class CAnimLocalHierarchy // animationsystem
{
	CBufferString m_sBone; // 0x0000
	CBufferString m_sNewParent; // 0x0010
	int32 m_nStartFrame; // 0x0020
	int32 m_nPeakFrame; // 0x0024
	int32 m_nTailFrame; // 0x0028
	int32 m_nEndFrame; // 0x002C
};
class FeNodeBase_t // physicslib
{
	uint16 nNode; // 0x0000
	uint16[3] nDummy; // 0x0002
	uint16 nNodeX0; // 0x0008
	uint16 nNodeX1; // 0x000A
	uint16 nNodeY0; // 0x000C
	uint16 nNodeY1; // 0x000E
	QuaternionStorage qAdjust; // 0x0010
};
class InfoForResourceTypeIVectorGraphic // resourcesystem
{
};
class CompMatPropertyMutator_t // compositematerialslib
{
	bool m_bEnabled; // 0x0000
	CompMatPropertyMutatorType_t m_nMutatorCommandType; // 0x0004
	CUtlString m_strInitWith_Container; // 0x0008
	CUtlString m_strCopyProperty_InputContainerSrc; // 0x0010
	CUtlString m_strCopyProperty_InputContainerProperty; // 0x0018
	CUtlString m_strCopyProperty_TargetProperty; // 0x0020
	CUtlString m_strRandomRollInputVars_SeedInputVar; // 0x0028
	CUtlVector< CUtlString > m_vecRandomRollInputVars_InputVarsToRoll; // 0x0030
	CUtlString m_strCopyMatchingKeys_InputContainerSrc; // 0x0048
	CUtlString m_strCopyKeysWithSuffix_InputContainerSrc; // 0x0050
	CUtlString m_strCopyKeysWithSuffix_FindSuffix; // 0x0058
	CUtlString m_strCopyKeysWithSuffix_ReplaceSuffix; // 0x0060
	CompositeMaterialInputLooseVariable_t m_nSetValue_Value; // 0x0068
	CUtlString m_strGenerateTexture_TargetParam; // 0x02F0
	CUtlString m_strGenerateTexture_InitialContainer; // 0x02F8
	int32 m_nResolution; // 0x0300
	bool m_bIsScratchTarget; // 0x0304
	CUtlString m_strCompressionFormat; // 0x0308
	bool m_bSplatDebugInfo; // 0x0310
	bool m_bCaptureInRenderDoc; // 0x0311
	CUtlVector< CompMatPropertyMutator_t > m_vecTexGenInstructions; // 0x0318
	CUtlVector< CompMatPropertyMutator_t > m_vecConditionalMutators; // 0x0330
	CUtlString m_strPopInputQueue_Container; // 0x0348
	CUtlString m_strDrawText_InputContainerSrc; // 0x0350
	CUtlString m_strDrawText_InputContainerProperty; // 0x0358
	Vector2D m_vecDrawText_Position; // 0x0360
	Color m_colDrawText_Color; // 0x0368
	CUtlString m_strDrawText_Font; // 0x0370
	CUtlVector< CompMatMutatorCondition_t > m_vecConditions; // 0x0378
};
class C_OP_SetControlPointToHand : public CParticleFunctionPreEmission // particles
{
	int32 m_nCP1; // 0x01D8
	int32 m_nHand; // 0x01DC
	Vector m_vecCP1Pos; // 0x01E0
	bool m_bOrientToHand; // 0x01EC
};
class CVMixSteamAudioPathingProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
};
class VertexPositionNormal_t // physicslib
{
	Vector m_vPosition; // 0x0000
	Vector m_vNormal; // 0x000C
};
class FeFitWeight_t // physicslib
{
	float32 flWeight; // 0x0000
	uint16 nNode; // 0x0004
	uint16 nDummy; // 0x0006
};
class CIntAnimParameter : public CConcreteAnimParameter // animgraphlib
{
	int32 m_defaultValue; // 0x0080
	int32 m_minValue; // 0x0084
	int32 m_maxValue; // 0x0088
};
class CAnimUser // animationsystem
{
	CBufferString m_name; // 0x0000
	int32 m_nType; // 0x0010
};
class CAnimEventDefinition // animationsystem
{
	int32 m_nFrame; // 0x0008
	int32 m_nEndFrame; // 0x000C
	float32 m_flCycle; // 0x0010
	float32 m_flDuration; // 0x0014
	KeyValues3 m_EventData; // 0x0018
	CBufferString m_sLegacyOptions; // 0x0028
	CGlobalSymbol m_sEventName; // 0x0038
};
class NmSyncTrackTimeRange_t // animlib
{
	NmSyncTrackTime_t m_startTime; // 0x0000
	NmSyncTrackTime_t m_endTime; // 0x0008
};
class RsDepthStencilStateDesc_t // rendersystemdx11
{
	bitfield:1 m_bDepthTestEnable; // 0x0000
	bitfield:1 m_bDepthWriteEnable; // 0x0000
	RsComparison_t m_depthFunc; // 0x0001
	RsStencilStateDesc_t m_stencilState; // 0x0002
};
class InfoForResourceTypeCPhysAggregateData // resourcesystem
{
};
class CAnimComponentUpdater // animgraphlib
{
	CUtlString m_name; // 0x0018
	AnimComponentID m_id; // 0x0020
	AnimNodeNetworkMode m_networkMode; // 0x0024
	bool m_bStartEnabled; // 0x0028
};
class C_CommandContext // client
{
	bool needsprocessing; // 0x0000
	int32 command_number; // 0x00A0
};
class thinkfunc_t // server
{
	HSCRIPT m_hFn; // 0x0008
	CUtlStringToken m_nContext; // 0x0010
	GameTick_t m_nNextThinkTick; // 0x0014
	GameTick_t m_nLastThinkTick; // 0x0018
};
class C_OP_SetVectorAttributeToVectorExpression : public CParticleFunctionOperator // particles
{
	VectorExpressionType_t m_nExpression; // 0x01D0
	CPerParticleVecInput m_vInput1; // 0x01D8
	CPerParticleVecInput m_vInput2; // 0x0890
	CPerParticleFloatInput m_flLerp; // 0x0F48
	ParticleAttributeIndex_t m_nOutputField; // 0x10B8
	ParticleSetMethod_t m_nSetMethod; // 0x10BC
	bool m_bNormalizedOutput; // 0x10C0
};
class EntityKeyValueData_t // worldrenderer
{
	CUtlVector< EntityIOConnectionData_t > m_connections; // 0x0008
	CUtlBinaryBlock m_keyValuesData; // 0x0020
};
class CVoiceContainerStaticAdditiveSynth::CHarmonic // soundsystem_voicecontainers
{
	EWaveform m_nWaveform; // 0x0000
	EMidiNote m_nFundamental; // 0x0001
	int32 m_nOctave; // 0x0004
	float32 m_flCents; // 0x0008
	float32 m_flPhase; // 0x000C
	CPiecewiseCurve m_curve; // 0x0010
	CVoiceContainerStaticAdditiveSynth::CGainScalePerInstance m_volumeScaling; // 0x0050
};
class PhysicsParticleId_t // physicslib
{
	uint32 m_Value; // 0x0000
};
class CNmParameterizedBlendNode::CDefinition : public CNmPoseNode::CDefinition // animlib
{
	CUtlVectorFixedGrowable< int16, 5 > m_sourceNodeIndices; // 0x0010
	int16 m_nInputParameterValueNodeIdx; // 0x0038
	bool m_bAllowLooping; // 0x003A
};
class CAnimGraphModelBinding // animgraphlib
{
	CUtlString m_modelName; // 0x0008
	CSmartPtr< CAnimUpdateSharedData > m_pSharedData; // 0x0010
};
class CAI_ExpresserWithFollowup : public CAI_Expresser // server
{
};
class C_INIT_VelocityRandom : public CParticleFunctionInitializer // particles
{
	int32 m_nControlPointNumber; // 0x01D8
	CPerParticleFloatInput m_fSpeedMin; // 0x01E0
	CPerParticleFloatInput m_fSpeedMax; // 0x0350
	CPerParticleVecInput m_LocalCoordinateSystemSpeedMin; // 0x04C0
	CPerParticleVecInput m_LocalCoordinateSystemSpeedMax; // 0x0B78
	bool m_bIgnoreDT; // 0x1230
	CRandomNumberGeneratorParameters m_randomnessParameters; // 0x1234
};
class C_OP_CylindricalDistanceToTransform : public CParticleFunctionOperator // particles
{
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01D0
	CPerParticleFloatInput m_flInputMin; // 0x01D8
	CPerParticleFloatInput m_flInputMax; // 0x0348
	CPerParticleFloatInput m_flOutputMin; // 0x04B8
	CPerParticleFloatInput m_flOutputMax; // 0x0628
	CParticleTransformInput m_TransformStart; // 0x0798
	CParticleTransformInput m_TransformEnd; // 0x0800
	ParticleSetMethod_t m_nSetMethod; // 0x0868
	bool m_bActiveRange; // 0x086C
	bool m_bAdditive; // 0x086D
	bool m_bCapsule; // 0x086E
};
class C_OP_SetControlPointRotation : public CParticleFunctionPreEmission // particles
{
	CParticleCollectionVecInput m_vecRotAxis; // 0x01D8
	CParticleCollectionFloatInput m_flRotRate; // 0x0890
	int32 m_nCP; // 0x0A00
	int32 m_nLocalCP; // 0x0A04
};
class CAnimationGraphVisualizerLine : public CAnimationGraphVisualizerPrimitiveBase // animgraphlib
{
	VectorAligned m_vWsPositionStart; // 0x0040
	VectorAligned m_vWsPositionEnd; // 0x0050
	Color m_Color; // 0x0060
};
class CVMixPannerProcessorDesc : public CVMixBaseProcessorDesc // soundsystem_lowlevel
{
	VMixPannerDesc_t m_desc; // 0x0020
};
class CTaskStatusAnimTag : public CAnimTagBase // animgraphlib
{
};
class CMotionMatchingUpdateNode : public CLeafUpdateNode // animgraphlib
{
	CMotionDataSet m_dataSet; // 0x0058
	CUtlVector< CSmartPtr< CMotionMetricEvaluator > > m_metrics; // 0x0078
	CUtlVector< float32 > m_weights; // 0x0090
	bool m_bSearchEveryTick; // 0x00E0
	float32 m_flSearchInterval; // 0x00E4
	bool m_bSearchWhenClipEnds; // 0x00E8
	bool m_bSearchWhenGoalChanges; // 0x00E9
	CBlendCurve m_blendCurve; // 0x00EC
	float32 m_flSampleRate; // 0x00F4
	float32 m_flBlendTime; // 0x00F8
	bool m_bLockClipWhenWaning; // 0x00FC
	float32 m_flSelectionThreshold; // 0x0100
	float32 m_flReselectionTimeWindow; // 0x0104
	bool m_bEnableRotationCorrection; // 0x0108
	bool m_bGoalAssist; // 0x0109
	float32 m_flGoalAssistDistance; // 0x010C
	float32 m_flGoalAssistTolerance; // 0x0110
	CAnimInputDamping m_distanceScale_Damping; // 0x0118
	float32 m_flDistanceScale_OuterRadius; // 0x0130
	float32 m_flDistanceScale_InnerRadius; // 0x0134
	float32 m_flDistanceScale_MaxScale; // 0x0138
	float32 m_flDistanceScale_MinScale; // 0x013C
	bool m_bEnableDistanceScaling; // 0x0140
};
class VMapResourceData_t // worldrenderer
{
};
class CNmFloatAngleMathNode::CDefinition : public CNmFloatValueNode::CDefinition // animlib
{
	int16 m_nInputValueNodeIdx; // 0x0010
	CNmFloatAngleMathNode::Operation_t m_operation; // 0x0012
};
class CNmBlendTaskBase : public CNmPoseTask // animlib
{
};
class AimCameraOpFixedSettings_t // animgraphlib
{
	int32 m_nChainIndex; // 0x0000
	int32 m_nCameraJointIndex; // 0x0004
	int32 m_nPelvisJointIndex; // 0x0008
	int32 m_nClavicleLeftJointIndex; // 0x000C
	int32 m_nClavicleRightJointIndex; // 0x0010
	int32 m_nDepenetrationJointIndex; // 0x0014
	CUtlVector< int32 > m_propJoints; // 0x0018
};
class SheetSequenceIntegerId_t // rendersystemdx11
{
	uint32 m_Value; // 0x0000
};
class CGameScriptedMoveData // server
{
	Vector m_vAccumulatedRootMotion; // 0x0000
	QAngle m_angAccumulatedRootMotionRotation; // 0x000C
	VectorWS m_vSrc; // 0x0018
	QAngle m_angSrc; // 0x0024
	QAngle m_angCurrent; // 0x0030
	float32 m_flLockedSpeed; // 0x003C
	float32 m_flAngRate; // 0x0040
	float32 m_flDuration; // 0x0044
	GameTime_t m_flStartTime; // 0x0048
	bool m_bActive; // 0x004C
	bool m_bTeleportOnEnd; // 0x004D
	bool m_bIgnoreRotation; // 0x004E
	bool m_bSuccess; // 0x004F
	ForcedCrouchState_t m_nForcedCrouchState; // 0x0050
	bool m_bIgnoreCollisions; // 0x0054
	Vector m_vDest; // 0x0058
	QAngle m_angDst; // 0x0064
	CHandle< CBaseEntity > m_hDestEntity; // 0x0070
};
class C_OP_PlaneCull : public CParticleFunctionOperator // particles
{
	int32 m_nPlaneControlPoint; // 0x01D0
	CParticleCollectionVecInput m_vecPlaneDirection; // 0x01D8
	bool m_bLocalSpace; // 0x0890
	float32 m_flPlaneOffset; // 0x0894
};
class C_OP_SetControlPointsToModelParticles : public CParticleFunctionOperator // particles
{
	char[128] m_HitboxSetName; // 0x01D0
	char[128] m_AttachmentName; // 0x0250
	int32 m_nFirstControlPoint; // 0x02D0
	int32 m_nNumControlPoints; // 0x02D4
	int32 m_nFirstSourcePoint; // 0x02D8
	bool m_bSkin; // 0x02DC
	bool m_bAttachment; // 0x02DD
};
class C_INIT_RemapScalarToVector : public CParticleFunctionInitializer // particles
{
	ParticleAttributeIndex_t m_nFieldInput; // 0x01D8
	ParticleAttributeIndex_t m_nFieldOutput; // 0x01DC
	float32 m_flInputMin; // 0x01E0
	float32 m_flInputMax; // 0x01E4
	Vector m_vecOutputMin; // 0x01E8
	Vector m_vecOutputMax; // 0x01F4
	float32 m_flStartTime; // 0x0200
	float32 m_flEndTime; // 0x0204
	ParticleSetMethod_t m_nSetMethod; // 0x0208
	int32 m_nControlPointNumber; // 0x020C
	bool m_bLocalCoords; // 0x0210
	float32 m_flRemapBias; // 0x0214
};
class CNmFollowBoneNode::CDefinition : public CNmPassthroughNode::CDefinition // animlib
{
	CGlobalSymbol m_bone; // 0x0018
	CGlobalSymbol m_followTargetBone; // 0x0020
	int16 m_nEnabledNodeIdx; // 0x0028
	NmFollowBoneMode_t m_mode; // 0x002A
};
class CNmControlParameterVectorNode::CDefinition : public CNmVectorValueNode::CDefinition // animlib
{
};
class CHitBox // modellib
{
	CUtlString m_name; // 0x0000
